<?php





$wpsy=2;//使用成功
$ysmz1="〖10至200元现金红包〗";
echo "<font color=black>恭喜你！打开了".$ysmz1."</font><br>";




$bz= rand(1, 70);
if($bz >=1&&$bz <=50){
//////////////////////////////////////////////////〖10元红包〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖10元红包〗";//需要的到某个物品的名字    // 
$wwpid=1090;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖10元红包〗/////////////////////////////////////////
} elseif($bz >=51&&$bz <=70){ 
//////////////////////////////////////////////////〖20元红包〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖20元红包〗";//需要的到某个物品的名字    // 
$wwpid=1091;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖20元红包〗/////////////////////////////////////////


} else{
} 



include("./ini/zt_ini.php");
$wjmz=($iniFile->getItem('玩家信息','玩家名字'));
$xtxx= "恭喜玩家".$wjmz."打开了".$ysmz1."获得了".$wwpmz."真是美滋滋啊！！！";
include("./msg/msgg02.php");





?>


