<?php



$wpsy=2;//使用成功
$ysmz1="〖嫦娥月饼礼盒〗";
echo "<font color=black>恭喜你！打开了".$ysmz1."</font><br>";



$bz= rand(10, 50);
$dd=$dd+1;	
//////////////////////////////////////////////////〖玉兔月饼〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖玉兔月饼〗";//需要的到某个物品的名字    // 
$wwpid=771;                   //需要的到某个物品的id      //
$wwpsl=$bz;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=6;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖玉兔月饼〗/////////////////////////////////////////


$bz= rand(1, 100);
if($bz >=1&&$bz <=30){
$dd=$dd+1;	
//////////////////////////////////////////////////〖嫦娥月饼〗（血）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖嫦娥月饼〗（血）";//需要的到某个物品的名字    // 
$wwpid=767;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖嫦娥月饼〗（血）/////////////////////////////////////////
} else{
} 

$bz= rand(1, 100);
if($bz >=1&&$bz <=28){
$dd=$dd+1;	
//////////////////////////////////////////////////〖嫦娥月饼〗（攻）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖嫦娥月饼〗（攻）";//需要的到某个物品的名字    // 
$wwpid=768;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖嫦娥月饼〗（攻）/////////////////////////////////////////
} else{
} 
$bz= rand(1, 100);
if($bz >=1&&$bz <=26){
$dd=$dd+1;	
//////////////////////////////////////////////////〖嫦娥月饼〗（魔）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖嫦娥月饼〗（魔）";//需要的到某个物品的名字    // 
$wwpid=769;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖嫦娥月饼〗（魔）/////////////////////////////////////////
} else{
} 


$bz= rand(1, 100);
if($bz >=1&&$bz <=24){
$dd=$dd+1;	
//////////////////////////////////////////////////〖嫦娥月饼〗（防）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖嫦娥月饼〗（防）";//需要的到某个物品的名字    // 
$wwpid=770;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖嫦娥月饼〗（防）/////////////////////////////////////////
} else{
} 



$bz= rand(1, 100);
if($bz >=1&&$bz <=20){
$dd=$dd+1;	
//////////////////////////////////////////////////〖风花月饼礼盒〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖风花月饼礼盒〗";//需要的到某个物品的名字    // 
$wwpid=772;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=8;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖风花月饼礼盒〗/////////////////////////////////////////
} else{
} 

$bz= rand(1, 100);
if($bz >=1&&$bz <=20){
$dd=$dd+1;	
//////////////////////////////////////////////////〖雪月月饼礼盒〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖雪月月饼礼盒〗";//需要的到某个物品的名字    // 
$wwpid=773;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=8;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖雪月月饼礼盒〗/////////////////////////////////////////
} else{
} 


$bz= rand(1, 100);
if($bz >=1&&$bz <=20){
$dd=$dd+1;	
//////////////////////////////////////////////////〖金秋月饼礼盒〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖金秋月饼礼盒〗";//需要的到某个物品的名字    // 
$wwpid=774;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=8;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖金秋月饼礼盒〗/////////////////////////////////////////
} else{
} 

$bz= rand(1, 100);
if($bz >=1&&$bz <=20){
$dd=$dd+1;	
//////////////////////////////////////////////////〖鸿福月饼礼盒〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖鸿福月饼礼盒〗";//需要的到某个物品的名字    // 
$wwpid=775;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=8;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖鸿福月饼礼盒〗/////////////////////////////////////////
} else{
} 











$bz= rand(1, 100);
if($bz<=30){
$dd=$dd+1;	
//////////////////////////////////////////////////【金秋的思念】/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【金秋的思念】";//需要的到某个物品的名字    // 
$wwpid=744;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=6;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////【金秋的思念】/////////////////////////////////////////
include("./ini/zt_ini.php");
$wjmz=($iniFile->getItem('玩家信息','玩家名字'));
$xtxx="恭喜玩家".$wjmz."开启".$ysmz1."幸运的获得".$wwpmz;
include("./msg/msgg02.php");
} else{
} 











if($dd >=1){
} else{
echo "<font color=black>居然人品大爆发了居然是个空礼盒</font>"."<br>";
	} 		

	


//解锁当前使用的ini
include("./ini/jsini.php");
//解锁当前使用的ini



?>


