<?php





$wpsy=2;//使用成功
$ysmz1="〖感恩火鸡礼包〗";
echo "<font color=black>恭喜你！打开了".$ysmz1."</font><br>";





$bz= rand(1, 2);
if($bz ==1){
$bz= rand(1, 100);
if($bz >=1&&$bz <=40){
//////////////////////////////////////////////////〖良品烤火鸡〗（血）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖良品烤火鸡〗（血）";//需要的到某个物品的名字    // 
$wwpid=1065;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖良品烤火鸡〗（血）/////////////////////////////////////////
} elseif($bz >=40&&$bz <=70){
//////////////////////////////////////////////////〖上品烤火鸡〗（血）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖上品烤火鸡〗（血）";//需要的到某个物品的名字    // 
$wwpid=1066;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖上品烤火鸡〗（血）/////////////////////////////////////////
} elseif($bz >=70&&$bz <=90){
//////////////////////////////////////////////////〖精品烤火鸡〗（血）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖精品烤火鸡〗（血）";//需要的到某个物品的名字    // 
$wwpid=1067;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖精品烤火鸡〗（血）/////////////////////////////////////////
} elseif($bz >=90&&$bz <=100){
//////////////////////////////////////////////////〖极品烤火鸡〗（血）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖极品烤火鸡〗（血）";//需要的到某个物品的名字    // 
$wwpid=1068;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖极品烤火鸡〗（血）/////////////////////////////////////////


} else{
} 

} else{
} 

$bz= rand(1, 2);
if($bz ==1){


$bz= rand(1, 100);
if($bz >=1&&$bz <=40){
//////////////////////////////////////////////////〖良品烤火鸡〗（攻）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖良品烤火鸡〗（攻）";//需要的到某个物品的名字    // 
$wwpid=1069;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖良品烤火鸡〗（攻）/////////////////////////////////////////
} elseif($bz >=40&&$bz <=70){
//////////////////////////////////////////////////〖上品烤火鸡〗（攻）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖上品烤火鸡〗（攻）";//需要的到某个物品的名字    // 
$wwpid=1070;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖上品烤火鸡〗（攻）/////////////////////////////////////////
} elseif($bz >=70&&$bz <=90){
//////////////////////////////////////////////////〖精品烤火鸡〗（攻）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖精品烤火鸡〗（攻）";//需要的到某个物品的名字    // 
$wwpid=1071;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖精品烤火鸡〗（攻）/////////////////////////////////////////
} elseif($bz >=90&&$bz <=100){
//////////////////////////////////////////////////〖极品烤火鸡〗（攻）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖极品烤火鸡〗（攻）";//需要的到某个物品的名字    // 
$wwpid=1072;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖极品烤火鸡〗（攻）/////////////////////////////////////////


} else{
} 

} else{
} 

$bz= rand(1, 2);
if($bz ==1){

$bz= rand(1, 100);
if($bz >=1&&$bz <=40){
//////////////////////////////////////////////////〖良品烤火鸡〗（魔）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖良品烤火鸡〗（魔）";//需要的到某个物品的名字    // 
$wwpid=1073;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖良品烤火鸡〗（魔）/////////////////////////////////////////
} elseif($bz >=40&&$bz <=70){
//////////////////////////////////////////////////〖上品烤火鸡〗（魔）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖上品烤火鸡〗（魔）";//需要的到某个物品的名字    // 
$wwpid=1074;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖上品烤火鸡〗（魔）/////////////////////////////////////////
} elseif($bz >=70&&$bz <=90){
//////////////////////////////////////////////////〖精品烤火鸡〗（魔）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖精品烤火鸡〗（魔）";//需要的到某个物品的名字    // 
$wwpid=1075;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖精品烤火鸡〗（魔）/////////////////////////////////////////
} elseif($bz >=90&&$bz <=100){
//////////////////////////////////////////////////〖极品烤火鸡〗（魔）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖极品烤火鸡〗（魔）";//需要的到某个物品的名字    // 
$wwpid=1076;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖极品烤火鸡〗（魔）/////////////////////////////////////////


} else{
} 
} else{
} 

$bz= rand(1, 2);
if($bz ==1){
$bz= rand(1, 100);
if($bz >=1&&$bz <=40){
//////////////////////////////////////////////////〖良品烤火鸡〗（防）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖良品烤火鸡〗（防）";//需要的到某个物品的名字    // 
$wwpid=1077;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖良品烤火鸡〗（防）/////////////////////////////////////////
} elseif($bz >=40&&$bz <=70){
//////////////////////////////////////////////////〖上品烤火鸡〗（防）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖上品烤火鸡〗（防）";//需要的到某个物品的名字    // 
$wwpid=1078;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖上品烤火鸡〗（防）/////////////////////////////////////////
} elseif($bz >=70&&$bz <=90){
//////////////////////////////////////////////////〖精品烤火鸡〗（防）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖精品烤火鸡〗（防）";//需要的到某个物品的名字    // 
$wwpid=1079;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖精品烤火鸡〗（防）/////////////////////////////////////////
} elseif($bz >=90&&$bz <=100){
//////////////////////////////////////////////////〖极品烤火鸡〗（防）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖极品烤火鸡〗（防）";//需要的到某个物品的名字    // 
$wwpid=1080;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖极品烤火鸡〗（防）/////////////////////////////////////////


} else{
} 
} else{
} 
















include("./ini/zt_ini.php");
$wjmz=($iniFile->getItem('玩家信息','玩家名字'));
$xtxx= "恭喜玩家".$wjmz."打开了".$ysmz1."获得了大量回馈奖励~~~具体关注游戏首页介绍";
include("./msg/msgg02.php");





?>


