<?php



$wpsy=2;//使用成功
$ysmz1="〖金秋月饼礼盒〗";
echo "<font color=black>恭喜你！打开了".$ysmz1."</font><br>";



$bz= rand(1, 10);
$dd=$dd+1;	
//////////////////////////////////////////////////〖玉兔月饼〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖玉兔月饼〗";//需要的到某个物品的名字    // 
$wwpid=771;                   //需要的到某个物品的id      //
$wwpsl=$bz;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=6;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖玉兔月饼〗/////////////////////////////////////////


$bz= rand(1, 100);
if($bz >=1&&$bz <=30){
$dd=$dd+1;	
//////////////////////////////////////////////////〖黄金月饼〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖黄金月饼〗";//需要的到某个物品的名字    // 
$wwpid=757;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖黄金月饼〗/////////////////////////////////////////
} else{
} 

$bz= rand(1, 100);
if($bz >=1&&$bz <=28){
$dd=$dd+1;	
//////////////////////////////////////////////////〖云腿月饼〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖云腿月饼〗";//需要的到某个物品的名字    // 
$wwpid=758;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖云腿月饼〗/////////////////////////////////////////
} else{
} 
$bz= rand(1, 100);
if($bz >=1&&$bz <=26){
$dd=$dd+1;	
//////////////////////////////////////////////////〖水蜜桃月饼〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖水蜜桃月饼〗";//需要的到某个物品的名字    // 
$wwpid=759;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖水蜜桃月饼〗/////////////////////////////////////////
} else{
} 


$bz= rand(1, 100);
if($bz >=1&&$bz <=24){
$dd=$dd+1;	
//////////////////////////////////////////////////〖哈密瓜月饼〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖哈密瓜月饼〗";//需要的到某个物品的名字    // 
$wwpid=760;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖哈密瓜月饼〗/////////////////////////////////////////
} else{
} 



$bz= rand(1, 100);
if($bz >=1&&$bz <=24){
$dd=$dd+1;	
//////////////////////////////////////////////////〖草莓月饼〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖草莓月饼〗";//需要的到某个物品的名字    // 
$wwpid=761;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖草莓月饼〗/////////////////////////////////////////
} else{
} 


$bz= rand(1, 100);
if($bz<=5){
$dd=$dd+1;	
//////////////////////////////////////////////////【金秋的思念】/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【金秋的思念】";//需要的到某个物品的名字    // 
$wwpid=744;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=6;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////【金秋的思念】/////////////////////////////////////////
include("./ini/zt_ini.php");
$wjmz=($iniFile->getItem('玩家信息','玩家名字'));
$xtxx="恭喜玩家".$wjmz."开启".$ysmz1."幸运的获得".$wwpmz;
include("./msg/msgg02.php");
} else{
} 











if($dd >=1){
} else{
echo "<font color=black>居然人品大爆发了居然是个空礼盒</font>"."<br>";
	} 		

	


//解锁当前使用的ini
include("./ini/jsini.php");
//解锁当前使用的ini



?>


