<?php



$wpsy=2;//使用成功
$ysmz1="〖麦乐堡甜品箱〗";
echo "<font color=black>恭喜你！打开了".$ysmz1."</font><br>";



$bz= rand(100, 300);
$dd=$dd+1;	
//////////////////////////////////////////////////〖西游蛋糕〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖西游蛋糕〗";//需要的到某个物品的名字    // 
$wwpid=893;                   //需要的到某个物品的id      //
$wwpsl=$bz;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=6;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖西游蛋糕〗/////////////////////////////////////////


$bz= rand(1, 100);
if($bz >=1&&$bz <=30){
$dd=$dd+1;	
//////////////////////////////////////////////////〖麦乐堡蛋糕〗（血）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖麦乐堡蛋糕〗（血）";//需要的到某个物品的名字    // 
$wwpid=888;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖麦乐堡蛋糕〗（血）/////////////////////////////////////////
} else{
} 

$bz= rand(1, 100);
if($bz >=1&&$bz <=28){
$dd=$dd+1;	
//////////////////////////////////////////////////〖麦乐堡蛋糕〗（攻）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖麦乐堡蛋糕〗（攻）";//需要的到某个物品的名字    // 
$wwpid=889;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖麦乐堡蛋糕〗（攻）/////////////////////////////////////////
} else{
} 
$bz= rand(1, 100);
if($bz >=1&&$bz <=26){
$dd=$dd+1;	
//////////////////////////////////////////////////〖麦乐堡蛋糕〗（魔）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖麦乐堡蛋糕〗（魔）";//需要的到某个物品的名字    // 
$wwpid=890;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖麦乐堡蛋糕〗（魔）/////////////////////////////////////////
} else{
} 


$bz= rand(1, 100);
if($bz >=1&&$bz <=24){
$dd=$dd+1;	
//////////////////////////////////////////////////〖麦乐堡蛋糕〗（防）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖麦乐堡蛋糕〗（防）";//需要的到某个物品的名字    // 
$wwpid=891;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖麦乐堡蛋糕〗（防）/////////////////////////////////////////
} else{
} 



$bz= rand(1, 100);
if($bz >=1&&$bz <=20){
$dd=$dd+1;	
//////////////////////////////////////////////////〖生日甜品礼盒〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖生日甜品礼盒〗";//需要的到某个物品的名字    // 
$wwpid=905;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=8;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖生日甜品礼盒〗/////////////////////////////////////////
} else{
} 




$bz= rand(1, 100);
if($bz<=10){
$dd=$dd+1;	
$bz= rand(1, 3);
if($bz==1){
//////////////////////////////////////////////////【尊享VIP】（1天）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【尊享VIP】（1天）";//需要的到某个物品的名字    // 
$wwpid=865;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////【尊享VIP】（1天）/////////////////////////////////////////
} elseif($bz ==2){
//////////////////////////////////////////////////【尊享VIP】（3天）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【尊享VIP】（3天）";//需要的到某个物品的名字    // 
$wwpid=866;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////【尊享VIP】（3天）/////////////////////////////////////////
} elseif($bz ==3){
//////////////////////////////////////////////////【尊享VIP】（7天）/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【尊享VIP】（7天）";//需要的到某个物品的名字    // 
$wwpid=867;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////【尊享VIP】（7天）/////////////////////////////////////////
} else{
} 
include("./ini/zt_ini.php");
$wjmz=($iniFile->getItem('玩家信息','玩家名字'));
$xtxx="恭喜玩家".$wjmz."开启".$ysmz1."幸运的获得".$wwpmz;
include("./msg/msgg02.php");
} else{
} 










if($dd >=1){
} else{
echo "<font color=black>居然人品大爆发了居然是个空礼盒</font>"."<br>";
	} 		

	


//解锁当前使用的ini
include("./ini/jsini.php");
//解锁当前使用的ini



?>


