<?php




$wpsy=2;//使用成功
$ysmz1="【清凉宝箱】";
echo "<font color=black>恭喜你！打开了".$ysmz1."</font><br>";


//随机
$bz= rand(1, 10);

if($bz >=1&&$bz <=6){
	
//随机
$bz= rand(1, 10);	
if($bz >=1&&$bz <=4){
$suijisl=1;
} elseif($bz >=5&&$bz <=7){ 
$suijisl=3;
} elseif($bz >=8&&$bz <=10){ 
$suijisl=5;

} else{

}




//////////////////////////////////////////////////红宝石三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【1万西游声望卷轴】";//需要的到某个物品的名字    // 
$wwpid=564;                   //需要的到某个物品的id      //
$wwpsl=$suijisl;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////红宝石三/////////////////////////////////////////

} elseif($bz >=7&&$bz <=10){ 
//随机
$bz= rand(1, 10);	
if($bz >=1&&$bz <=4){
$suijisl=1;
} elseif($bz >=5&&$bz <=7){ 
$suijisl=3;
} elseif($bz >=8&&$bz <=10){ 
$suijisl=5;

} else{

}
//////////////////////////////////////////////////【1万法宝经验卷轴】/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【1万法宝经验卷轴】";//需要的到某个物品的名字    // 
$wwpid=565;                   //需要的到某个物品的id      //
$wwpsl=1;                      //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////【1万法宝经验卷轴】/////////////////////////////////////////




} else{

}








?>


