<?php



$wpsy=2;//使用成功
$ysmz1="〖如意の称号宝箱〗";
echo "<font color=black>恭喜你！打开了".$ysmz1."</font><br>";



$bz= rand(1,79);

if($bz ==1){
//////////////////////////////////////////////////〖属性之王〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖属性之王〗";//需要的到某个物品的名字    // 
$wwpid=147;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖属性之王〗/////////////////////////////////////////

} elseif($bz ==2){
//////////////////////////////////////////////////〖西游之星〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖西游之星〗";//需要的到某个物品的名字    // 
$wwpid=148;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖西游之星〗/////////////////////////////////////////
} elseif($bz ==3){
//////////////////////////////////////////////////〖小富豪〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖小富豪〗";//需要的到某个物品的名字    // 
$wwpid=151;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖小富豪〗/////////////////////////////////////////
} elseif($bz ==4){
//////////////////////////////////////////////////〖富豪〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖富豪〗";//需要的到某个物品的名字    // 
$wwpid=152;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖富豪〗/////////////////////////////////////////
} elseif($bz ==5){
//////////////////////////////////////////////////〖风度偏偏〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖风度偏偏〗";//需要的到某个物品的名字    // 
$wwpid=428;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖风度偏偏〗/////////////////////////////////////////
} elseif($bz ==6){
//////////////////////////////////////////////////〖至尊战神〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖至尊战神〗";//需要的到某个物品的名字    // 
$wwpid=429;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖至尊战神〗/////////////////////////////////////////
} elseif($bz ==7){
//////////////////////////////////////////////////〖谁与争峰〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖谁与争峰〗";//需要的到某个物品的名字    // 
$wwpid=430;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖谁与争峰〗/////////////////////////////////////////
} elseif($bz ==8){
//////////////////////////////////////////////////〖永不放弃〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖永不放弃〗";//需要的到某个物品的名字    // 
$wwpid=431;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖永不放弃〗/////////////////////////////////////////
} elseif($bz ==9){
//////////////////////////////////////////////////〖威震幻影〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖威震幻影〗";//需要的到某个物品的名字    // 
$wwpid=432;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖威震幻影〗/////////////////////////////////////////
} elseif($bz ==10){
//////////////////////////////////////////////////〖武文双全〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖武文双全〗";//需要的到某个物品的名字    // 
$wwpid=507;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖武文双全〗/////////////////////////////////////////	
} elseif($bz ==11){
//////////////////////////////////////////////////〖文状元〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖文状元〗";//需要的到某个物品的名字    // 
$wwpid=508;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖文状元〗/////////////////////////////////////////	
} elseif($bz ==12){
//////////////////////////////////////////////////〖三好学生〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖三好学生〗";//需要的到某个物品的名字    // 
$wwpid=509;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖三好学生〗/////////////////////////////////////////		
} elseif($bz ==13){
//////////////////////////////////////////////////〖女神之恋〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖女神之恋〗";//需要的到某个物品的名字    // 
$wwpid=551;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖女神之恋〗/////////////////////////////////////////		
} elseif($bz ==14){
//////////////////////////////////////////////////〖全服公敌〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖全服公敌〗";//需要的到某个物品的名字    // 
$wwpid=552;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖全服公敌〗/////////////////////////////////////////		
} elseif($bz ==15){
	//////////////////////////////////////////////////〖至尊天圣〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖至尊天圣〗";//需要的到某个物品的名字    // 
$wwpid=553;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖至尊天圣〗/////////////////////////////////////////		
	
} elseif($bz ==16){
//////////////////////////////////////////////////〖一掷千金〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖一掷千金〗";//需要的到某个物品的名字    // 
$wwpid=554;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖一掷千金〗/////////////////////////////////////////		
} elseif($bz ==17){
//////////////////////////////////////////////////〖至尊红颜〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖至尊红颜〗";//需要的到某个物品的名字    // 
$wwpid=555;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖至尊红颜〗/////////////////////////////////////////			
} elseif($bz ==18){
	//////////////////////////////////////////////////〖望门贵族〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖望门贵族〗";//需要的到某个物品的名字    // 
$wwpid=556;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖望门贵族〗/////////////////////////////////////////		
	
} elseif($bz ==19){
	//////////////////////////////////////////////////〖倾城伊人〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖倾城伊人〗";//需要的到某个物品的名字    // 
$wwpid=557;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖倾城伊人〗/////////////////////////////////////////		
} elseif($bz ==20){
	
	//////////////////////////////////////////////////〖天下至尊〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖天下至尊〗";//需要的到某个物品的名字    // 
$wwpid=580;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖天下至尊〗/////////////////////////////////////////		
} elseif($bz ==21){
//////////////////////////////////////////////////〖蓬莱至尊〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖蓬莱至尊〗";//需要的到某个物品的名字    // 
$wwpid=581;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖蓬莱至尊〗/////////////////////////////////////////			
} elseif($bz ==22){
//////////////////////////////////////////////////〖昆仑至尊〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖昆仑至尊〗";//需要的到某个物品的名字    // 
$wwpid=582;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖昆仑至尊〗/////////////////////////////////////////	
} elseif($bz ==23){
//////////////////////////////////////////////////〖名动天下〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖名动天下〗";//需要的到某个物品的名字    // 
$wwpid=583;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖名动天下〗/////////////////////////////////////////		
	
} elseif($bz ==24){
//////////////////////////////////////////////////〖万法不侵〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖万法不侵〗";//需要的到某个物品的名字    // 
$wwpid=584;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖万法不侵〗/////////////////////////////////////////		
		
} elseif($bz ==25){
//////////////////////////////////////////////////〖乾坤唯仙〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖乾坤唯仙〗";//需要的到某个物品的名字    // 
$wwpid=585;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖乾坤唯仙〗/////////////////////////////////////////			
	
} elseif($bz ==26){
//////////////////////////////////////////////////〖舞星仙姬〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖舞星仙姬〗";//需要的到某个物品的名字    // 
$wwpid=586;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖舞星仙姬〗/////////////////////////////////////////			
} elseif($bz ==27){
//////////////////////////////////////////////////〖情圣〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖情圣〗";//需要的到某个物品的名字    // 
$wwpid=639;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖情圣〗/////////////////////////////////////////			
} elseif($bz ==28){
//////////////////////////////////////////////////〖万人迷〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖万人迷〗";//需要的到某个物品的名字    // 
$wwpid=640;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖万人迷〗/////////////////////////////////////////		
	
} elseif($bz ==29){
//////////////////////////////////////////////////〖天作纸合〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖天作纸合〗";//需要的到某个物品的名字    // 
$wwpid=641;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖天作纸合〗/////////////////////////////////////////			
} elseif($bz ==30){
//////////////////////////////////////////////////〖爱你一万年〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖爱你一万年〗";//需要的到某个物品的名字    // 
$wwpid=642;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖爱你一万年〗/////////////////////////////////////////			
	
} elseif($bz ==31){
//////////////////////////////////////////////////〖真爱无敌〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖真爱无敌〗";//需要的到某个物品的名字    // 
$wwpid=643;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖真爱无敌〗/////////////////////////////////////////			
} elseif($bz ==32){
//////////////////////////////////////////////////〖绝世情圣〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖绝世情圣〗";//需要的到某个物品的名字    // 
$wwpid=644;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖绝世情圣〗/////////////////////////////////////////			
} elseif($bz ==33){
//////////////////////////////////////////////////〖天下最倾城〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖天下最倾城〗";//需要的到某个物品的名字    // 
$wwpid=645;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖天下最倾城〗/////////////////////////////////////////		
	
} elseif($bz ==34){
//////////////////////////////////////////////////〖天下最风流〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖天下最风流〗";//需要的到某个物品的名字    // 
$wwpid=646;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖天下最风流〗/////////////////////////////////////////		
} elseif($bz ==35){
	
//////////////////////////////////////////////////〖鹊桥仙子〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖鹊桥仙子〗";//需要的到某个物品的名字    // 
$wwpid=647;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖鹊桥仙子〗/////////////////////////////////////////		
} elseif($bz ==36){
//////////////////////////////////////////////////〖谦谦公子〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖谦谦公子〗";//需要的到某个物品的名字    // 
$wwpid=648;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖谦谦公子〗/////////////////////////////////////////		
} elseif($bz ==37){
	//////////////////////////////////////////////////〖娇美宠儿〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖娇美宠儿〗";//需要的到某个物品的名字    // 
$wwpid=649;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖娇美宠儿〗/////////////////////////////////////////		
} elseif($bz ==38){
		//////////////////////////////////////////////////〖柔情郎君〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖柔情郎君〗";//需要的到某个物品的名字    // 
$wwpid=650;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖柔情郎君〗/////////////////////////////////////////	
	
} elseif($bz ==39){
			//////////////////////////////////////////////////〖传世战神〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖传世战神〗";//需要的到某个物品的名字    // 
$wwpid=651;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖传世战神〗/////////////////////////////////////////	
	
} elseif($bz ==40){
			//////////////////////////////////////////////////〖天下第一〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖天下第一〗";//需要的到某个物品的名字    // 
$wwpid=652;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖天下第一〗/////////////////////////////////////////		
} elseif($bz ==41){
			//////////////////////////////////////////////////〖灿若星斗〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖灿若星斗〗";//需要的到某个物品的名字    // 
$wwpid=653;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖灿若星斗〗/////////////////////////////////////////			
} elseif($bz ==42){
			//////////////////////////////////////////////////〖富甲天下〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖富甲天下〗";//需要的到某个物品的名字    // 
$wwpid=654;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖富甲天下〗/////////////////////////////////////////			
} elseif($bz ==43){
//////////////////////////////////////////////////〖登峰造极〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖登峰造极〗";//需要的到某个物品的名字    // 
$wwpid=655;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖登峰造极〗/////////////////////////////////////////		
	
} elseif($bz ==44){
//////////////////////////////////////////////////〖西游新秀〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖西游新秀〗";//需要的到某个物品的名字    // 
$wwpid=666;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖西游新秀〗/////////////////////////////////////////			
} elseif($bz ==45){
//////////////////////////////////////////////////〖西游漫记〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖西游漫记〗";//需要的到某个物品的名字    // 
$wwpid=667;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖西游漫记〗/////////////////////////////////////////			
	
} elseif($bz ==46){
//////////////////////////////////////////////////〖玫瑰情人〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖玫瑰情人〗";//需要的到某个物品的名字    // 
$wwpid=668;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖玫瑰情人〗/////////////////////////////////////////			
} elseif($bz ==47){
	//////////////////////////////////////////////////〖科举答题〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖科举答题〗";//需要的到某个物品的名字    // 
$wwpid=669;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖科举答题〗/////////////////////////////////////////	
} elseif($bz ==48){
	
	//////////////////////////////////////////////////〖举人〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖举人〗";//需要的到某个物品的名字    // 
$wwpid=670;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖举人〗/////////////////////////////////////////		
} elseif($bz ==49){
	//////////////////////////////////////////////////〖榜眼〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖榜眼〗";//需要的到某个物品的名字    // 
$wwpid=671;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖榜眼〗/////////////////////////////////////////			

	
	
} elseif($bz ==50){
		//////////////////////////////////////////////////〖领跑西游〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖领跑西游〗";//需要的到某个物品的名字    // 
$wwpid=672;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖领跑西游〗/////////////////////////////////////////			

	
} elseif($bz ==51){
//////////////////////////////////////////////////〖超凡入圣〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖超凡入圣〗";//需要的到某个物品的名字    // 
$wwpid=673;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖超凡入圣〗/////////////////////////////////////////			
} elseif($bz ==52){
//////////////////////////////////////////////////〖震古烁今〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖震古烁今〗";//需要的到某个物品的名字    // 
$wwpid=674;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖震古烁今〗/////////////////////////////////////////			
} elseif($bz ==53){
//////////////////////////////////////////////////〖炉火纯青〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖炉火纯青〗";//需要的到某个物品的名字    // 
$wwpid=675;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖炉火纯青〗/////////////////////////////////////////			
	
} elseif($bz ==54){
//////////////////////////////////////////////////〖名扬四海〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖名扬四海〗";//需要的到某个物品的名字    // 
$wwpid=676;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖名扬四海〗/////////////////////////////////////////			
} elseif($bz ==55){
	//////////////////////////////////////////////////〖进击の一骑绝尘〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖进击の一骑绝尘〗";//需要的到某个物品的名字    // 
$wwpid=677;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖进击の一骑绝尘〗/////////////////////////////////////////		
	
} elseif($bz ==56){
		//////////////////////////////////////////////////〖进击の冠绝天下〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖进击の冠绝天下〗";//需要的到某个物品的名字    // 
$wwpid=678;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖进击の冠绝天下〗/////////////////////////////////////////		
} elseif($bz ==57){
		//////////////////////////////////////////////////〖进击の笑傲苍穹〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖进击の笑傲苍穹〗";//需要的到某个物品的名字    // 
$wwpid=679;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖进击の笑傲苍穹〗/////////////////////////////////////////			
} elseif($bz ==58){
			//////////////////////////////////////////////////〖BOSS杀手〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖BOSS杀手〗";//需要的到某个物品的名字    // 
$wwpid=696;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖BOSS杀手〗/////////////////////////////////////////		
	
} elseif($bz ==59){
				//////////////////////////////////////////////////〖猎魔之王〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖猎魔之王〗";//需要的到某个物品的名字    // 
$wwpid=697;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖猎魔之王〗/////////////////////////////////////////		
} elseif($bz ==60){
				//////////////////////////////////////////////////〖BOSS终结者〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖BOSS终结者〗";//需要的到某个物品的名字    // 
$wwpid=706;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖BOSS终结者〗/////////////////////////////////////////			
	
} elseif($bz ==61){
				//////////////////////////////////////////////////〖一骑当先〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖一骑当先〗";//需要的到某个物品的名字    // 
$wwpid=707;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖一骑当先〗/////////////////////////////////////////		
} elseif($bz ==62){
				//////////////////////////////////////////////////〖新妖之王〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖新妖之王〗";//需要的到某个物品的名字    // 
$wwpid=708;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖新妖之王〗/////////////////////////////////////////			
} elseif($bz ==63){
				//////////////////////////////////////////////////〖不差钱〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖不差钱〗";//需要的到某个物品的名字    // 
$wwpid=698;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖不差钱〗/////////////////////////////////////////			
	
} elseif($bz ==64){
					//////////////////////////////////////////////////〖我是大姐〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖我是大姐〗";//需要的到某个物品的名字    // 
$wwpid=699;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖我是大姐〗/////////////////////////////////////////		
} elseif($bz ==65){
					//////////////////////////////////////////////////〖我是二哥〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖我是二哥〗";//需要的到某个物品的名字    // 
$wwpid=700;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖我是二哥〗/////////////////////////////////////////			
	
} elseif($bz ==66){
//////////////////////////////////////////////////〖十大富豪〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖十大富豪〗";//需要的到某个物品的名字    // 
$wwpid=701;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖十大富豪〗/////////////////////////////////////////			
		
} elseif($bz ==67){
//////////////////////////////////////////////////〖威力无边〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖威力无边〗";//需要的到某个物品的名字    // 
$wwpid=702;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖威力无边〗/////////////////////////////////////////			
} elseif($bz ==68){
//////////////////////////////////////////////////〖装备榜第一〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖装备榜第一〗";//需要的到某个物品的名字    // 
$wwpid=703;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖装备榜第一〗/////////////////////////////////////////				
	
} elseif($bz ==69){
//////////////////////////////////////////////////〖等级榜第一〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖等级榜第一〗";//需要的到某个物品的名字    // 
$wwpid=704;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖等级榜第一〗/////////////////////////////////////////	

	
} elseif($bz ==70){

//////////////////////////////////////////////////〖三界战神〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖三界战神〗";//需要的到某个物品的名字    // 
$wwpid=705;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖三界战神〗/////////////////////////////////////////	


} elseif($bz ==71){

//////////////////////////////////////////////////〖BOSS终结者〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖BOSS终结者〗";//需要的到某个物品的名字    // 
$wwpid=706;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖BOSS终结者〗/////////////////////////////////////////	


} elseif($bz ==72){
//////////////////////////////////////////////////〖新妖之王〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖新妖之王〗";//需要的到某个物品的名字    // 
$wwpid=708;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖新妖之王〗/////////////////////////////////////////	

} elseif($bz ==73){
//////////////////////////////////////////////////〖豪无人性〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖豪无人性〗";//需要的到某个物品的名字    // 
$wwpid=709;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖豪无人性〗/////////////////////////////////////////	
} elseif($bz ==74){
//////////////////////////////////////////////////〖封神英雄〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖封神英雄〗";//需要的到某个物品的名字    // 
$wwpid=711;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖封神英雄〗/////////////////////////////////////////	
} elseif($bz ==75){
//////////////////////////////////////////////////〖天外飞仙征服者〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖天外飞仙征服者〗";//需要的到某个物品的名字    // 
$wwpid=712;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖天外飞仙征服者〗/////////////////////////////////////////	
} elseif($bz ==76){
//////////////////////////////////////////////////〖打遍天下无敌手〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖打遍天下无敌手〗";//需要的到某个物品的名字    // 
$wwpid=713;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖打遍天下无敌手〗/////////////////////////////////////////	
	
} elseif($bz ==77){
	//////////////////////////////////////////////////〖土豪就是任性〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖土豪就是任性〗";//需要的到某个物品的名字    // 
$wwpid=714;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖土豪就是任性〗/////////////////////////////////////////	
	
} elseif($bz ==78){
		//////////////////////////////////////////////////〖十大神翼〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖十大神翼〗";//需要的到某个物品的名字    // 
$wwpid=715;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖十大神翼〗/////////////////////////////////////////	
} elseif($bz ==79){
	
			//////////////////////////////////////////////////〖不屈白银〗/////////////////////////////////////////
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖不屈白银〗";//需要的到某个物品的名字    // 
$wwpid=716;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖不屈白银〗/////////////////////////////////////////	
	
	
	
	
	
	
	
	
	
	
	

} else{
echo "<font color=black>居然人品大爆发了居然是个空箱子</font>"."<br>";
} 		

	include("./ini/zt_ini.php");
$wjmz=($iniFile->getItem('玩家信息','玩家名字'));
$xtxx= "恭喜玩家".$wjmz."小心翼翼的打开了〖如意の称号宝箱〗获得了".$wwpmz."称号奖励！！";
include("./msg/msgg02.php");


//解锁当前使用的ini
include("./ini/jsini.php");
//解锁当前使用的ini



?>


