<?php



$manzu1="";
$kcrl="";
$wpdz1="";//初始
$wpdz2="";//初始
$wpdz3="";//初始
$wpdz4="";//初始
$wpdz5="";//初始




$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖探险符〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=579;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加

//随机
$bz= rand(1, 100);

if($bz >=1&&$bz <=10){
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖铁魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=308;//物品id
$wpdz4[]=50;//	量
$wpdz5[]=1;//	重量
//物品加
} elseif($bz >=11&&$bz <=20){ 
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖铜魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=309;//物品id
$wpdz4[]=50;//	量
$wpdz5[]=1;//	重量
//物品加

} elseif($bz >=21&&$bz <=30){ 
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖银魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=310;//物品id
$wpdz4[]=50;//	量
$wpdz5[]=1;//	重量
//物品加

} elseif($bz >=31&&$bz <=35){ 
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖铁星升星符〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=314;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加


} elseif($bz >=36&&$bz <=40){ 
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖铜星升星符〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=315;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加

} elseif($bz >=41&&$bz <=45){ 
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖银星升星符〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=316;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加



} elseif($bz >=46&&$bz <=50){ 
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖金星升星符〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=317;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加




} elseif($bz >=51&&$bz <=55){ 
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖荣誉宝石包〗（2个）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=494;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加


} elseif($bz >=56&&$bz <=60){ 
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加

} elseif($bz >=61&&$bz <=90){ 
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加

} elseif($bz >=91&&$bz <=100){ 
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加

} else {

}

//随机
$bz= rand(1, 300);

if($bz ==1){
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖诛仙令〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=593;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加
} else {

}

//随机
$bz= rand(1, 500);

if($bz <=20){
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖双倍掉宝符〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=454;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加
} else {

}


//随机
$bz= rand(1, 1000);

if($bz <=10){
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖四倍掉宝符〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=455;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加
} else {

}

//随机
$bz= rand(1, 1800);

if($bz <=5){
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖八倍掉宝符〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=456;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加
} else {

}






//随机
$bz= rand(1, 100);

if($bz <=5){
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加
} else {

}


//随机
$bz= rand(1, 250);

if($bz <=5){
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加
} else {

}


//随机
$bz= rand(1, 500);

if($bz <=5){
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖10亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=627;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加
} else {

}





//随机
$bz= rand(1, 900);

if($bz <=5){
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖王者宝石包〗（1个）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=587;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加
} else {

}

//随机
$bz= rand(1, 900);

if($bz <=5){
$uuu=$uuu+1;	
//物品加
$wpdz1[]="〖冠军宝石包〗（1个）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=566;//物品id
$wpdz4[]=1;//	量
$wpdz5[]=1;//	重量
//物品加
} else {

}





if($uuu >=1){

include("./rwmap/rwget.php");
} else {

}

?>


