<?php




$wpsy=2;//使用成功
$ysmz1="〖至尊皇族宝箱〗";
echo "<font color=black>恭喜你！打开了".$ysmz1."</font><br>";



//随机
$bz= rand(1, 100);
if($bz >=1&&$bz <=50){



//随机
$bz1= rand(1, 90);

if($bz >=1&&$bz <=10){
//////////////////////////////////////////////////红宝石三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="红宝石三";//需要的到某个物品的名字    // 
$wwpid=40;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////红宝石三/////////////////////////////////////////

} elseif($bz >=11&&$bz <=20){ 

//////////////////////////////////////////////////红水晶三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="红水晶三";//需要的到某个物品的名字    // 
$wwpid=41;                   //需要的到某个物品的id      //
$wwpsl=30;                      //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////红水晶三/////////////////////////////////////////

} elseif($bz >=21&&$bz <=30){ 

//////////////////////////////////////////////////蓝宝石三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="蓝宝石三";//需要的到某个物品的名字    // 
$wwpid=42;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////蓝宝石三/////////////////////////////////////////

} elseif($bz >=31&&$bz <=40){ 
//////////////////////////////////////////////////蓝水晶三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="蓝水晶三";//需要的到某个物品的名字    // 
$wwpid=43;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////蓝水晶三/////////////////////////////////////////
} elseif($bz >=41&&$bz <=50){ 
//////////////////////////////////////////////////黄宝石三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="黄宝石三";//需要的到某个物品的名字    // 
$wwpid=44;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////黄宝石三/////////////////////////////////////////

} elseif($bz >=51&&$bz <=60){ 

//////////////////////////////////////////////////黄水晶三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="黄水晶三";//需要的到某个物品的名字    // 
$wwpid=45;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////黄水晶三/////////////////////////////////////////
} elseif($bz >=61&&$bz <=70){ 
//////////////////////////////////////////////////金刚石三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="金刚石三";//需要的到某个物品的名字    // 
$wwpid=46;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////金刚石三/////////////////////////////////////////
} elseif($bz >=71&&$bz <=80){ 
//////////////////////////////////////////////////佛印石三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="佛印石三";//需要的到某个物品的名字    // 
$wwpid=47;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////佛印石三/////////////////////////////////////////
} elseif($bz >=81&&$bz <=90){ 


//////////////////////////////////////////////////玄武石三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="玄武石三";//需要的到某个物品的名字    // 
$wwpid=48;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////玄武石三/////////////////////////////////////////

} else{
//////////////////////////////////////////////////红宝石三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="红宝石三";//需要的到某个物品的名字    // 
$wwpid=40;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////红宝石三/////////////////////////////////////////
}















} elseif($bz >=51&&$bz <=80){ 

//随机
$bz1= rand(1, 90);

if($bz >=1&&$bz <=10){
//////////////////////////////////////////////////红宝石四/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="红宝石四";//需要的到某个物品的名字    // 
$wwpid=49;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////红宝石四/////////////////////////////////////////

} elseif($bz >=11&&$bz <=20){ 

//////////////////////////////////////////////////红水晶四/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="红水晶四";//需要的到某个物品的名字    // 
$wwpid=50;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////红水晶四/////////////////////////////////////////

} elseif($bz >=21&&$bz <=30){ 

//////////////////////////////////////////////////蓝宝石四/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="蓝宝石四";//需要的到某个物品的名字    // 
$wwpid=51;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////蓝宝石四/////////////////////////////////////////

} elseif($bz >=31&&$bz <=40){ 
//////////////////////////////////////////////////蓝水晶四/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="蓝水晶四";//需要的到某个物品的名字    // 
$wwpid=52;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////蓝水晶四/////////////////////////////////////////
} elseif($bz >=41&&$bz <=50){ 
//////////////////////////////////////////////////黄宝石四/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="黄宝石四";//需要的到某个物品的名字    // 
$wwpid=53;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////黄宝石四/////////////////////////////////////////

} elseif($bz >=51&&$bz <=60){ 

//////////////////////////////////////////////////黄水晶四/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="黄水晶四";//需要的到某个物品的名字    // 
$wwpid=54;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////黄水晶四/////////////////////////////////////////
} elseif($bz >=61&&$bz <=70){ 
//////////////////////////////////////////////////金刚石四/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="金刚石四";//需要的到某个物品的名字    // 
$wwpid=55;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////金刚石四/////////////////////////////////////////
} elseif($bz >=71&&$bz <=80){ 
//////////////////////////////////////////////////佛印石四/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="佛印石四";//需要的到某个物品的名字    // 
$wwpid=56;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////佛印石四/////////////////////////////////////////
} elseif($bz >=81&&$bz <=90){ 


//////////////////////////////////////////////////玄武石四/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="玄武石四";//需要的到某个物品的名字    // 
$wwpid=57;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////玄武石四/////////////////////////////////////////

} else{
//////////////////////////////////////////////////红宝石三/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="红宝石三";//需要的到某个物品的名字    // 
$wwpid=40;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////红宝石三/////////////////////////////////////////
}

} elseif($bz >=81&&$bz <=100){ 




//随机
$bz1= rand(1, 90);

if($bz >=1&&$bz <=10){
//////////////////////////////////////////////////红宝石五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="红宝石五";//需要的到某个物品的名字    // 
$wwpid=58;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////红宝石五/////////////////////////////////////////

} elseif($bz >=11&&$bz <=20){ 

//////////////////////////////////////////////////红水晶五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="红水晶五";//需要的到某个物品的名字    // 
$wwpid=59;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////红水晶五/////////////////////////////////////////

} elseif($bz >=21&&$bz <=30){ 

//////////////////////////////////////////////////蓝宝石五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="蓝宝石五";//需要的到某个物品的名字    // 
$wwpid=60;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////蓝宝石五/////////////////////////////////////////

} elseif($bz >=31&&$bz <=40){ 
//////////////////////////////////////////////////蓝水晶五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="蓝水晶五";//需要的到某个物品的名字    // 
$wwpid=61;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////蓝水晶五/////////////////////////////////////////
} elseif($bz >=41&&$bz <=50){ 
//////////////////////////////////////////////////黄宝石五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="黄宝石五";//需要的到某个物品的名字    // 
$wwpid=62;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////黄宝石五/////////////////////////////////////////

} elseif($bz >=51&&$bz <=60){ 

//////////////////////////////////////////////////黄水晶五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="黄水晶五";//需要的到某个物品的名字    // 
$wwpid=63;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////黄水晶五/////////////////////////////////////////
} elseif($bz >=61&&$bz <=70){ 
//////////////////////////////////////////////////金刚石五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="金刚石五";//需要的到某个物品的名字    // 
$wwpid=64;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////金刚石五/////////////////////////////////////////
} elseif($bz >=71&&$bz <=80){ 
//////////////////////////////////////////////////佛印石五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="佛印石五";//需要的到某个物品的名字    // 
$wwpid=65;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////佛印石五/////////////////////////////////////////
} elseif($bz >=81&&$bz <=90){ 


//////////////////////////////////////////////////玄武石五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="玄武石五";//需要的到某个物品的名字    // 
$wwpid=66;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////玄武石五/////////////////////////////////////////

} else{
//////////////////////////////////////////////////玄武石五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="玄武石五";//需要的到某个物品的名字    // 
$wwpid=66;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////玄武石五/////////////////////////////////////////
}











} else{
//////////////////////////////////////////////////玄武石五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="玄武石五";//需要的到某个物品的名字    // 
$wwpid=66;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////玄武石五/////////////////////////////////////////
}




//随机
$bz= rand(1, 130);

if($bz >=1&&$bz <=10){
	
//////////////////////////////////////////////////〖1千傲来国声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千傲来国声望卷〗";//需要的到某个物品的名字    // 
$wwpid=9;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千傲来国声望卷〗/////////////////////////////////////////
} elseif($bz >=11&&$bz <=20){ 
	//////////////////////////////////////////////////〖1千宝象国声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千宝象国声望卷〗";//需要的到某个物品的名字    // 
$wwpid=10;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千宝象国声望卷〗/////////////////////////////////////////
	} elseif($bz >=21&&$bz <=30){ 
	
	//////////////////////////////////////////////////〖1千宝象国声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千将军府声望卷〗";//需要的到某个物品的名字    // 
$wwpid=11;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千宝象国声望卷〗/////////////////////////////////////////
} elseif($bz >=31&&$bz <=40){ 
		//////////////////////////////////////////////////〖1千普陀山声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千普陀山声望卷〗";//需要的到某个物品的名字    // 
$wwpid=12;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千普陀山声望卷〗/////////////////////////////////////////

	} elseif($bz >=41&&$bz <=50){ 
			//////////////////////////////////////////////////〖1千龙宫声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千龙宫声望卷〗";//需要的到某个物品的名字    // 
$wwpid=13;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千龙宫声望卷〗/////////////////////////////////////////
} elseif($bz >=51&&$bz <=60){ 
			//////////////////////////////////////////////////〖1千月宫声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千月宫声望卷〗";//需要的到某个物品的名字    // 
$wwpid=14;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千月宫声望卷〗/////////////////////////////////////////
} elseif($bz >=61&&$bz <=70){ 
				//////////////////////////////////////////////////〖1千方寸山声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千方寸山声望卷〗";//需要的到某个物品的名字    // 
$wwpid=15;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千方寸山声望卷〗/////////////////////////////////////////
	} elseif($bz >=71&&$bz <=80){ 
	
					//////////////////////////////////////////////////〖1千天宫声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千天宫声望卷〗";//需要的到某个物品的名字    // 
$wwpid=16;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千天宫声望卷〗/////////////////////////////////////////
	} elseif($bz >=81&&$bz <=90){ 
						//////////////////////////////////////////////////〖1千地府声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千地府声望卷〗";//需要的到某个物品的名字    // 
$wwpid=17;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千地府声望卷〗/////////////////////////////////////////
	} elseif($bz >=91&&$bz <=100){ 
						//////////////////////////////////////////////////〖1千西游声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千西游声望卷〗";//需要的到某个物品的名字    // 
$wwpid=18;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千西游声望卷〗/////////////////////////////////////////
		} elseif($bz >=101&&$bz <=110){ 
							//////////////////////////////////////////////////〖1千乌鸡国声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千乌鸡国声望卷〗";//需要的到某个物品的名字    // 
$wwpid=19;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千乌鸡国声望卷〗/////////////////////////////////////////
		} elseif($bz >=111&&$bz <=120){ 
							//////////////////////////////////////////////////〖1千恶魔广场声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千恶魔广场声望卷〗";//需要的到某个物品的名字    // 
$wwpid=20;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千恶魔广场声望卷〗/////////////////////////////////////////
			} elseif($bz >=121&&$bz <=130){ 	
								//////////////////////////////////////////////////〖1千夫妻声望卷〗/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千夫妻声望卷〗";//需要的到某个物品的名字    // 
$wwpid=21;                   //需要的到某个物品的id      //
$wwpsl=3;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////〖1千夫妻声望卷〗/////////////////////////////////////////


} else{
//////////////////////////////////////////////////玄武石五/////////////////////////////////////////
//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="玄武石五";//需要的到某个物品的名字    // 
$wwpid=66;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置
//////////////////////////////////////////////////玄武石五/////////////////////////////////////////
}




//随机
$bz= rand(1, 200);

if($bz >=1&&$bz <=60){
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
$wwpsl=10000000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
} elseif($bz >=61&&$bz <=110){ 	
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
$wwpsl=20000000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
} elseif($bz >=111&&$bz <=150){ 	

//////////////////////////////////////////////////银两增加/////////////////////////////////////////
$wwpsl=30000000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
} elseif($bz >=151&&$bz <=170){ 	
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
$wwpsl=50000000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
} elseif($bz >=171&&$bz <=190){ 	
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
$wwpsl=60000000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
} elseif($bz >=191&&$bz <=200){ 	
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
$wwpsl=100000000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////

} else{

}






?>


