<?php
if($npcc ==1){
$wp1="回城卷";//物品名字
$wp2="使用后可以直接传送回长安十字街头";//描述
$wp3=1000;//买到价格
$wp20="1000两";//买到价格
$wp4=500;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=1;//分类
} elseif($npcc ==8){
$wp1="腾云符";//物品名字
$wp2="使用腾云需要消耗一张腾云符~";//描述
$wp3=1000;//买到价格
$wp20="1000两";//买到价格
$wp4=500;//卖出价格
$wp5=40;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=1;//分类
} elseif($npcc ==248){
$wp1="饭团";//物品名字
$wp2="使用后恢复MP80点";//描述
$wp3=1000;//买到价格
$wp20="1000两";//买到价格
$wp4=500;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类
} elseif($npcc ==247){

$wp1="清酒";//物品名字
$wp2="使用后恢复MP80点";//描述
$wp3=1000;//买到价格
$wp20="1000两";//买到价格
$wp4=500;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类


} elseif($npcc ==195){

$wp1="红烧狗肉";//物品名字
$wp2="使用可恢复HP220点！";//描述
$wp3=3000;//买到价格
$wp20="3000两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类
} elseif($npcc ==196){
$wp1="花雕酒";//物品名字
$wp2="使用可恢复MP110点！";//描述
$wp3=3000;//买到价格
$wp20="3000两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	
	

	
} elseif($npcc ==197){
	
$wp1="素菜包";//物品名字
$wp2="香喷喷的素菜包！使用可恢复HP250";//描述
$wp3=3500;//买到价格
$wp20="3500两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	
	
	
		
	
} elseif($npcc ==198){
	
$wp1="猪肉包";//物品名字
$wp2="香喷喷的猪肉包！使用可恢复HP370";//描述
$wp3=4000;//买到价格
$wp20="4000两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	
	
} elseif($npcc ==199){
	
$wp1="神仙汤";//物品名字
$wp2="使用可恢复HP500点！";//描述
$wp3=5000;//买到价格
$wp20="5000两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	

	
} elseif($npcc ==244){
	
$wp1="灵丹";//物品名字
$wp2="使用可恢复MP500点";//描述
$wp3=5000;//买到价格
$wp20="5000两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	


} elseif($npcc ==246){
	
$wp1="云南白药";//物品名字
$wp2="使用可恢复HP1000点";//描述
$wp3=10000;//买到价格
$wp20="1万两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	

} elseif($npcc ==194){
	
$wp1="云南白药(小捆)";//物品名字
$wp2="使用恢复2500体力！";//描述
$wp3=20000;//买到价格
$wp20="2万两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	
} elseif($npcc ==192){
	
$wp1="灵丹(小捆)";//物品名字
$wp2="使用恢复1000内力！";//描述
$wp3=8000;//买到价格
$wp20="8000两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	


} elseif($npcc ==191){
	
$wp1="云南白药(中捆)";//物品名字
$wp2="使用恢复5000体力！";//描述
$wp3=8000;//买到价格
$wp20="8000两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	

} elseif($npcc ==249){
	
$wp1="云南白药(大捆)";//物品名字
$wp2="使用恢复10000体力！";//描述
$wp3=40000;//买到价格
$wp20="4万两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	

} elseif($npcc ==250){
	
$wp1="云南白药(超大捆)";//物品名字
$wp2="使用恢复80000体力！";//描述
$wp3=60000;//买到价格
$wp20="6万两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	



} elseif($npcc ==193){
	
$wp1="冰糖葫芦";//物品名字
$wp2="使用恢复MP800点！";//描述
$wp3=4000;//买到价格
$wp20="4000两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	


} elseif($npcc ==245){
	
$wp1="猕猴桃干";//物品名字
$wp2="使用恢复3690体力！";//描述
$wp3=20000;//买到价格
$wp20="2万两";//买到价格
$wp4=1000;//卖出价格
$wp5=1;//等级
$wp6=1;//重量
$wp7=1;//绑定0为绑定1为不绑定
$wp10=5;//分类	








} else{

echo "<font color=red>物品描述信息有误，请联系gm进行纠正，错误ID：$npcc</font></a>"."<br>";

}
?>




