<?php


$max1=0;//血
$max2=0;//攻击
$max3=0;//防御
$max4=0;//魔攻


if($npcc ==147){

$wpmz="〖属性之王〗";//物品名字
$wpms="永久增加HP60000，攻击35000，防御40000，魔攻30000";//描述
$max1=60000;//血
$max2=35000;//攻击
$max3=40000;//防御
$max4=30000;//魔攻

} elseif($npcc ==148){
$wpmz="〖西游之星〗";//物品名字
$wpms="永久生命值88888点！";//描述
$max1=88888;//血
$max2=0;//攻击
$max3=0;//防御
$max4=0;//魔攻

} elseif($npcc ==151){
$wpmz="〖小富豪〗";//物品名字
$wpms="永久生命值58888点！";//描述
$max1=58888;//血
$max2=0;//攻击
$max3=0;//防御
$max4=0;//魔攻

} elseif($npcc ==152){
$wpmz="〖富豪〗";//物品名字
$wpms="永久生命值88888点！";//描述
$max1=88888;//血
$max2=0;//攻击
$max3=0;//防御
$max4=0;//魔攻



} elseif($npcc ==428){
$wpmz="〖风度偏偏〗";//物品名字
$wpms="永久增加HP24000，攻击45000，防御25000，魔攻45000";//描述
$max1=24000;//血
$max2=45000;//攻击
$max3=25000;//防御
$max4=45000;//魔攻
} elseif($npcc ==429){
$wpmz="〖至尊战神〗";//物品名字
$wpms="永久增加HP14000，攻击35000，防御15000，魔攻35000";//描述
$max1=14000;//血
$max2=35000;//攻击
$max3=15000;//防御
$max4=35000;//魔攻

} elseif($npcc ==430){
$wpmz="〖谁与争峰〗";//物品名字
$wpms="永久增加HP14000，攻击15000，防御15000，魔攻15000";//描述
$max1=14000;//血
$max2=15000;//攻击
$max3=15000;//防御
$max4=15000;//魔攻
} elseif($npcc ==431){
$wpmz="〖永不放弃〗";//物品名字
$wpms="永久增加HP24000，攻击25000，防御25000，魔攻25000";//描述
$max1=24000;//血
$max2=25000;//攻击
$max3=25000;//防御
$max4=25000;//魔攻
} elseif($npcc ==432){
$wpmz="〖威震幻影〗";//物品名字
$wpms="永久增加HP50000，攻击45000，防御45000，魔攻45000";//描述
$max1=50000;//血
$max2=45000;//攻击
$max3=45000;//防御
$max4=45000;//魔攻



} elseif($npcc ==507){
$wpmz="〖武文双全〗";//物品名字
$wpms="永久增加HP50000，攻击35000，防御35000，魔攻35000";//描述
$max1=50000;//血
$max2=35000;//攻击
$max3=35000;//防御
$max4=35000;//魔攻

} elseif($npcc ==508){
$wpmz="〖文状元〗";//物品名字
$wpms="永久增加HP40000，攻击25000，防御25000，魔攻25000";//描述
$max1=40000;//血
$max2=25000;//攻击
$max3=25000;//防御
$max4=25000;//魔攻

} elseif($npcc ==509){
$wpmz="〖三好学生〗";//物品名字
$wpms="永久增加HP30000，攻击10000，防御10000，魔攻10000";//描述
$max1=30000;//血
$max2=10000;//攻击
$max3=10000;//防御
$max4=10000;//魔攻



} elseif($npcc ==551){
$wpmz="〖女神之恋〗";//物品名字
$wpms="永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$max1=50000;//血
$max2=50000;//攻击
$max3=50000;//防御
$max4=50000;//魔攻

} elseif($npcc ==552){
$wpmz="〖全服公敌〗";//物品名字
$wpms="永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻

} elseif($npcc ==553){
$wpmz="〖至尊天圣〗";//物品名字
$wpms="永久增加HP60000，攻击60000，防御60000，魔攻60000";//描述"
$max1=60000;//血
$max2=60000;//攻击
$max3=60000;//防御
$max4=60000;//魔攻


} elseif($npcc ==554){
$wpmz="〖一掷千金〗";//物品名字
$wpms="永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻

} elseif($npcc ==555){
$wpmz="〖至尊红颜〗";//物品名字
$wpms="永久增加HP88888，攻击88888，防御88888，魔攻88888";//描述"
$max1=88888;//血
$max2=88888;//攻击
$max3=88888;//防御
$max4=88888;//魔攻

} elseif($npcc ==556){
$wpmz="〖望门贵族〗";//物品名字
$wpms="永久增加HP66666，攻击66666，防御66666，魔攻66666";//描述"
$max1=66666;//血
$max2=66666;//攻击
$max3=66666;//防御
$max4=66666;//魔攻

} elseif($npcc ==557){
$wpmz="〖倾城伊人〗";//物品名字
$wpms="永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$max1=50000;//血
$max2=50000;//攻击
$max3=50000;//防御
$max4=50000;//魔攻



} elseif($npcc ==580){
$wpmz="〖天下至尊〗";//物品名字
$wpms="永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述"
$max1=200000;//血
$max2=200000;//攻击
$max3=200000;//防御
$max4=200000;//魔攻

} elseif($npcc ==581){
$wpmz="〖蓬莱至尊〗";//物品名字
$wpms="永久增加HP150000，攻击150000，防御150000，魔攻150000";//描述"
$max1=150000;//血
$max2=150000;//攻击
$max3=150000;//防御
$max4=150000;//魔攻

} elseif($npcc ==582){
$wpmz="〖昆仑至尊〗";//物品名字
$wpms="永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻
} elseif($npcc ==583){
$wpmz="〖名动天下〗";//物品名字
$wpms="永久增加HP150000，攻击150000，防御150000，魔攻150000";//描述"
$max1=150000;//血
$max2=150000;//攻击
$max3=150000;//防御
$max4=150000;//魔攻

} elseif($npcc ==584){
$wpmz="〖万法不侵〗";//物品名字
$wpms="永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻

} elseif($npcc ==585){
$wpmz="〖乾坤唯仙〗";//物品名字
$wpms="永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻

} elseif($npcc ==586){
$wpmz="〖舞星仙姬〗";//物品名字
$wpms="永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻

} elseif($npcc ==639){
$wpmz="〖情圣〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$max1=50000;//血
$max2=50000;//攻击
$max3=50000;//防御
$max4=50000;//魔攻

} elseif($npcc ==640){
$wpmz="〖万人迷〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$max1=50000;//血
$max2=50000;//攻击
$max3=50000;//防御
$max4=50000;//魔攻



} elseif($npcc ==641){
$wpmz="〖天作纸合〗";//物品名字
$wpms="使用后可以永久增加HP80000，攻击80000，防御80000，魔攻80000";//描述"
$max1=80000;//血
$max2=80000;//攻击
$max3=80000;//防御
$max4=80000;//魔攻

} elseif($npcc ==642){
$wpmz="〖爱你一万年〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻

} elseif($npcc ==643){
$wpmz="〖真爱无敌〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻

} elseif($npcc ==644){
$wpmz="〖绝世情圣〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻
} elseif($npcc ==645){
$wpmz="〖天下最倾城〗";//物品名字
$wpms="使用后可以永久增加HP110000，攻击110000，防御110000，魔攻110000";//描述"
$max1=110000;//血
$max2=110000;//攻击
$max3=110000;//防御
$max4=110000;//魔攻
} elseif($npcc ==646){
$wpmz="〖天下最风流〗";//物品名字
$wpms="使用后可以永久增加HP110000，攻击110000，防御110000，魔攻110000";//描述"
$max1=110000;//血
$max2=110000;//攻击
$max3=110000;//防御
$max4=110000;//魔攻

} elseif($npcc ==647){
$wpmz="〖鹊桥仙子〗";//物品名字
$wpms="使用后可以永久增加HP66666，攻击66666，防御66666，魔攻66666";//描述"
$max1=66666;//血
$max2=66666;//攻击
$max3=66666;//防御
$max4=66666;//魔攻

} elseif($npcc ==648){
$wpmz="〖谦谦公子〗";//物品名字
$wpms="使用后可以永久增加HP66666，攻击66666，防御66666，魔攻66666";//描述"
$max1=66666;//血
$max2=66666;//攻击
$max3=66666;//防御
$max4=66666;//魔攻


} elseif($npcc ==649){
$wpmz="〖娇美宠儿〗";//物品名字
$wpms="使用后可以永久增加HP77777，攻击77777，防御77777，魔攻77777";//描述"
$max1=77777;//血
$max2=77777;//攻击
$max3=77777;//防御
$max4=77777;//魔攻


} elseif($npcc ==650){
$wpmz="〖柔情郎君〗";//物品名字
$wpms="使用后可以永久增加HP77777，攻击77777，防御77777，魔攻77777";//描述"
$max1=77777;//血
$max2=77777;//攻击
$max3=77777;//防御
$max4=77777;//魔攻

} elseif($npcc ==651){
$wpmz="〖传世战神〗";//物品名字
$wpms="使用后可以永久增加HP150000，攻击150000，防御150000，魔攻150000";//描述"
$max1=150000;//血
$max2=150000;//攻击
$max3=150000;//防御
$max4=150000;//魔攻


} elseif($npcc ==652){
$wpmz="〖天下第一〗";//物品名字
$wpms="使用后可以永久增加HP160000，攻击160000，防御160000，魔攻160000";//描述"
$max1=160000;//血
$max2=160000;//攻击
$max3=160000;//防御
$max4=160000;//魔攻


} elseif($npcc ==653){
$wpmz="〖灿若星斗〗";//物品名字
$wpms="使用后可以永久增加HP160000，攻击160000，防御160000，魔攻160000";//描述"
$max1=160000;//血
$max2=160000;//攻击
$max3=160000;//防御
$max4=160000;//魔攻

} elseif($npcc ==654){
$wpmz="〖富甲天下〗";//物品名字
$wpms="使用后可以永久增加HP180000，攻击180000，防御180000，魔攻180000";//描述"
$max1=180000;//血
$max2=180000;//攻击
$max3=180000;//防御
$max4=180000;//魔攻


} elseif($npcc ==655){
$wpmz="〖登峰造极〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述"
$max1=200000;//血
$max2=200000;//攻击
$max3=200000;//防御
$max4=200000;//魔攻


} elseif($npcc ==666){
$wpmz="〖西游新秀〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$max1=50000;//血
$max2=50000;//攻击
$max3=50000;//防御
$max4=50000;//魔攻

} elseif($npcc ==667){
$wpmz="〖西游漫记〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$max1=50000;//血
$max2=50000;//攻击
$max3=50000;//防御
$max4=50000;//魔攻

} elseif($npcc ==668){
$wpmz="〖玫瑰情人〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$max1=50000;//血
$max2=50000;//攻击
$max3=50000;//防御
$max4=50000;//魔攻



} elseif($npcc ==669){
$wpmz="〖科举答题〗";//物品名字
$wpms="使用后可以永久增加HP60000，攻击60000，防御60000，魔攻60000";//描述"
$max1=60000;//血
$max2=60000;//攻击
$max3=60000;//防御
$max4=60000;//魔攻



} elseif($npcc ==670){
$wpmz="〖举人〗";//物品名字
$wpms="使用后可以永久增加HP70000，攻击50000，防御50000，魔攻50000";//描述"
$max1=70000;//血
$max2=50000;//攻击
$max3=50000;//防御
$max4=50000;//魔攻



} elseif($npcc ==671){
$wpmz="〖榜眼〗";//物品名字
$wpms="使用后可以永久增加HP70000，攻击50000，防御50000，魔攻50000";//描述"
$max1=70000;//血
$max2=50000;//攻击
$max3=50000;//防御
$max4=50000;//魔攻

} elseif($npcc ==672){
$wpmz="〖领跑西游〗";//物品名字
$wpms="使用后可以永久增加HP70000，攻击70000，防御70000，魔攻70000";//描述"
$max1=70000;//血
$max2=70000;//攻击
$max3=70000;//防御
$max4=70000;//魔攻

} elseif($npcc ==673){
$wpmz="〖超凡入圣〗";//物品名字
$wpms="使用后可以永久增加HP150000，攻击100000，防御100000，魔攻100000";//描述"
$max1=150000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻


} elseif($npcc ==674){
$wpmz="〖震古烁今〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击120000，防御120000，魔攻120000";//描述"
$max1=200000;//血
$max2=120000;//攻击
$max3=120000;//防御
$max4=120000;//魔攻


} elseif($npcc ==675){
$wpmz="〖炉火纯青〗";//物品名字
$wpms="使用后可以永久增加HP250000，攻击120000，防御120000，魔攻120000";//描述"
$max1=250000;//血
$max2=120000;//攻击
$max3=120000;//防御
$max4=120000;//魔攻


} elseif($npcc ==676){
$wpmz="〖名扬四海〗";//物品名字
$wpms="使用后可以永久增加HP300000，攻击150000，防御150000，魔攻150000";//描述"
$max1=300000;//血
$max2=150000;//攻击
$max3=150000;//防御
$max4=150000;//魔攻

} elseif($npcc ==677){
$wpmz="〖进击の一骑绝尘〗";//物品名字
$wpms="使用后可以永久增加HP300000，攻击180000，防御180000，魔攻180000";//描述"
$max1=300000;//血
$max2=180000;//攻击
$max3=180000;//防御
$max4=180000;//魔攻

} elseif($npcc ==678){
$wpmz="〖进击の冠绝天下〗";//物品名字
$wpms="使用后可以永久增加HP350000，攻击200000，防御200000，魔攻200000";//描述"
$max1=350000;//血
$max2=200000;//攻击
$max3=200000;//防御
$max4=200000;//魔攻


} elseif($npcc ==679){
$wpmz="〖进击の笑傲苍穹〗";//物品名字
$wpms="使用后可以永久增加HP500000，攻击300000，防御300000，魔攻300000";//描述"
$max1=500000;//血
$max2=300000;//攻击
$max3=300000;//防御
$max4=300000;//魔攻


} elseif($npcc ==696){
$wpmz="〖BOSS杀手〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$max1=50000;//血
$max2=50000;//攻击
$max3=50000;//防御
$max4=50000;//魔攻


} elseif($npcc ==697){
$wpmz="〖猎魔之王〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻

} elseif($npcc ==698){
$wpmz="〖不差钱〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻



} elseif($npcc ==699){
$wpmz="〖我是大姐〗";//物品名字
$wpms="使用后可以永久增加HP120000，攻击120000，防御120000，魔攻120000";//描述"
$max1=120000;//血
$max2=120000;//攻击
$max3=120000;//防御
$max4=120000;//魔攻

} elseif($npcc ==700){
$wpmz="〖我是二哥〗";//物品名字
$wpms="使用后可以永久增加HP120000，攻击120000，防御120000，魔攻120000";//描述"
$max1=120000;//血
$max2=120000;//攻击
$max3=120000;//防御
$max4=120000;//魔攻


} elseif($npcc ==701){
$wpmz="〖十大富豪〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻


} elseif($npcc ==702){
$wpmz="〖威力无边〗";//物品名字
$wpms="使用后可以永久增加HP110000，攻击110000，防御110000，魔攻110000";//描述"
$max1=110000;//血
$max2=110000;//攻击
$max3=110000;//防御
$max4=110000;//魔攻

} elseif($npcc ==703){
$wpmz="〖装备榜第一〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述"
$max1=200000;//血
$max2=200000;//攻击
$max3=200000;//防御
$max4=200000;//魔攻


} elseif($npcc ==704){
$wpmz="〖等级榜第一〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述"
$max1=200000;//血
$max2=200000;//攻击
$max3=200000;//防御
$max4=200000;//魔攻

} elseif($npcc ==705){
$wpmz="〖三界战神〗";//物品名字
$wpms="使用后可以永久增加HP180000，攻击180000，防御180000，魔攻180000";//描述"
$max1=180000;//血
$max2=180000;//攻击
$max3=180000;//防御
$max4=180000;//魔攻

} elseif($npcc ==706){
$wpmz="〖BOSS终结者〗";//物品名字
$wpms="使用后可以永久增加HP180000，攻击180000，防御180000，魔攻180000";//描述"
$max1=180000;//血
$max2=180000;//攻击
$max3=180000;//防御
$max4=180000;//魔攻





} elseif($npcc ==707){
$wpmz="〖一骑当先〗";//物品名字
$wpms="使用后可以永久增加HP300000，攻击300000，防御300000，魔攻300000";//描述"
$max1=300000;//血
$max2=300000;//攻击
$max3=300000;//防御
$max4=300000;//魔攻


} elseif($npcc ==708){
$wpmz="〖新妖之王〗";//物品名字
$wpms="使用后可以永久增加HP400000，攻击400000，防御400000，魔攻400000";//描述"
$max1=400000;//血
$max2=400000;//攻击
$max3=400000;//防御
$max4=400000;//魔攻

} elseif($npcc ==709){
$wpmz="〖豪无人性〗";//物品名字
$wpms="使用后可以永久增加HP120000，攻击120000，防御120000，魔攻120000";//描述"
$max1=120000;//血
$max2=120000;//攻击
$max3=120000;//防御
$max4=120000;//魔攻

} elseif($npcc ==711){
$wpmz="〖封神英雄〗";//物品名字
$wpms="使用后可以永久增加HP130000，攻击130000，防御130000，魔攻130000";//描述"
$max1=130000;//血
$max2=130000;//攻击
$max3=130000;//防御
$max4=130000;//魔攻



} elseif($npcc ==712){
$wpmz="〖天外飞仙征服者〗";//物品名字
$wpms="使用后可以永久增加HP150000，攻击150000，防御150000，魔攻150000";//描述"
$max1=150000;//血
$max2=150000;//攻击
$max3=150000;//防御
$max4=150000;//魔攻



} elseif($npcc ==713){
$wpmz="〖打遍天下无敌手〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述"
$max1=200000;//血
$max2=200000;//攻击
$max3=200000;//防御
$max4=200000;//魔攻

} elseif($npcc ==714){
$wpmz="〖土豪就是任性〗";//物品名字
$wpms="使用后可以永久增加HP400000，攻击400000，防御400000，魔攻400000";//描述"
$max1=400000;//血
$max2=400000;//攻击
$max3=400000;//防御
$max4=400000;//魔攻

} elseif($npcc ==715){
$wpmz="〖十大神翼〗";//物品名字
$wpms="使用后可以永久增加HP180000，攻击180000，防御180000，魔攻180000";//描述"
$max1=180000;//血
$max2=180000;//攻击
$max3=180000;//防御
$max4=180000;//魔攻


} elseif($npcc ==716){
$wpmz="〖不屈白银〗";//物品名字
$wpms="使用后可以永久增加HP80000，攻击80000，防御80000，魔攻80000";//描述"
$max1=80000;//血
$max2=80000;//攻击
$max3=80000;//防御
$max4=80000;//魔攻

} elseif($npcc ==914){
$wpmz="〖绝世盟主〗（纪念版）";//物品名字
$wpms="〖绝世盟主〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP1000000，攻击1000000，防御1000000，魔攻1000000";//描述"
$max1=1000000;//血
$max2=1000000;//攻击
$max3=1000000;//防御
$max4=1000000;//魔攻
} elseif($npcc ==915){
$wpmz="〖绝世仙盟〗（纪念版）";//物品名字
$wpms="〖绝世仙盟〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP800000，攻击800000，防御800000，魔攻800000";//描述"
$max1=800000;//血
$max2=800000;//攻击
$max3=800000;//防御
$max4=800000;//魔攻
} elseif($npcc ==916){
$wpmz="〖君临王城の至尊王城〗（纪念版）";//物品名字
$wpms="〖君临王城の至尊王城〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP500000，攻击500000，防御500000，魔攻500000";//描述
$max1=500000;//血
$max2=500000;//攻击
$max3=500000;//防御
$max4=500000;//魔攻
} elseif($npcc ==917){
$wpmz="〖八荒雷动の傲视群雄〗（纪念版）";//物品名字
$wpms="〖八荒雷动の傲视群雄〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP500000，攻击500000，防御500000，魔攻500000";//描述
$max1=500000;//血
$max2=500000;//攻击
$max3=500000;//防御
$max4=500000;//魔攻
} elseif($npcc ==918){
$wpmz="〖天下无双の群雄霸主〗（纪念版）";//物品名字
$wpms="〖天下无双の群雄霸主〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP400000，攻击400000，防御400000，魔攻400000";//描述
$max1=400000;//血
$max2=400000;//攻击
$max3=400000;//防御
$max4=400000;//魔攻
} elseif($npcc ==919){
$wpmz="〖火树银花の名士风流〗（纪念版）";//物品名字
$wpms="〖火树银花の名士风流〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP300000，攻击300000，防御300000，魔攻300000";//描述
$max1=300000;//血
$max2=300000;//攻击
$max3=300000;//防御
$max4=300000;//魔攻
} elseif($npcc ==920){
$wpmz="〖万花迎春の国色天香〗（纪念版）";//物品名字
$wpms="〖万花迎春の国色天香〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述
$max1=200000;//血
$max2=200000;//攻击
$max3=200000;//防御
$max4=200000;//魔攻
} elseif($npcc ==921){
$wpmz="〖勇者之王〗（纪念版）";//物品名字
$wpms="〖勇者之王〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP500000，攻击200000，防御200000，魔攻200000";//描述
$max1=200000;//血
$max2=200000;//攻击
$max3=200000;//防御
$max4=200000;//魔攻



} elseif($npcc ==954){
$wpmz="〖绝代芳华〗";//物品名字
$wpms="〖绝代芳华〗使用后hp增加30万，攻击魔攻防御各20万";//描述
$max1=300000;//血
$max2=200000;//攻击
$max3=200000;//防御
$max4=200000;//魔攻

} elseif($npcc ==955){
$wpmz="〖君临天下の武道至尊〗";//物品名字
$wpms="〖君临天下の武道至尊〗使用后hp增加150万，攻击魔攻防御各100万";//描述
$max1=1500000;//血
$max2=1000000;//攻击
$max3=1000000;//防御
$max4=1000000;//魔攻

} elseif($npcc ==956){
$wpmz="〖倾城佳人の艳冠天下〗";//物品名字
$wpms="〖倾城佳人の艳冠天下〗使用后hp增加120万，攻击魔攻防御各80万";//描述
$max1=1200000;//血
$max2=800000;//攻击
$max3=800000;//防御
$max4=800000;//魔攻

} elseif($npcc ==957){
$wpmz="〖风流倜傥の百战无双〗";//物品名字
$wpms="〖风流倜傥の百战无双〗使用后hp增加100万，攻击魔攻防御各70万";//描述
$max1=1000000;//血
$max2=700000;//攻击
$max3=700000;//防御
$max4=700000;//魔攻

} elseif($npcc ==958){
$wpmz="〖天下无双の群雄霸主〗";//物品名字
$wpms="〖天下无双の群雄霸主〗使用后hp增加80万，攻击魔攻防御各50万";//描述
$max1=800000;//血
$max2=500000;//攻击
$max3=500000;//防御
$max4=500000;//魔攻

} elseif($npcc ==959){
$wpmz="〖君临王城の至尊皇者〗";//物品名字
$wpms="〖君临王城の至尊皇者〗使用后hp增加100万，攻击魔攻防御各70万";//描述
$max1=1000000;//血
$max2=700000;//攻击
$max3=700000;//防御
$max4=700000;//魔攻

} elseif($npcc ==960){
$wpmz="〖至尊无敌〗";//物品名字
$wpms="〖至尊无敌〗使用后hp增加80万，攻击魔攻防御各50万";//描述
$max1=800000;//血
$max2=500000;//攻击
$max3=500000;//防御
$max4=500000;//魔攻

} elseif($npcc ==961){
$wpmz="〖妖火天尊〗";//物品名字
$wpms="〖妖火天尊〗使用后hp增加50万，攻击魔攻防御各30万";//描述
$max1=500000;//血
$max2=300000;//攻击
$max3=300000;//防御
$max4=300000;//魔攻

} elseif($npcc ==962){
$wpmz="〖神乎其技〗";//物品名字
$wpms="〖神乎其技〗使用后hp增加30万，攻击魔攻防御各15万";//描述
$max1=300000;//血
$max2=150000;//攻击
$max3=150000;//防御
$max4=150000;//魔攻


} elseif($npcc ==963){
$wpmz="〖灵机百变〗";//物品名字
$wpms="〖灵机百变〗使用后hp增加30万，攻击魔攻防御各15万";//描述
$max1=300000;//血
$max2=150000;//攻击
$max3=150000;//防御
$max4=150000;//魔攻


} elseif($npcc ==964){
$wpmz="〖姐是白富美〗";//物品名字
$wpms="〖灵机百变〗使用后hp增加30万，攻击魔攻防御各15万";//描述
$max1=300000;//血
$max2=150000;//攻击
$max3=150000;//防御
$max4=150000;//魔攻

} elseif($npcc ==1034){
$wpmz="〖千秋万载〗";//物品名字
$wpms="使用后可提升属性HP+200万，攻击+200万，魔攻+200万，防御+200万！";//描述
$max1=2000000;//血
$max2=2000000;//攻击
$max3=2000000;//防御
$max4=2000000;//魔攻

} elseif($npcc ==1035){
$wpmz="〖纵横三界づ王者风云〗";//物品名字
$wpms="使用后可提升属性HP+140万，攻击+140万，魔攻+140万，防御+140万！";//描述
$max1=1400000;//血
$max2=1400000;//攻击
$max3=1400000;//防御
$max4=1400000;//魔攻


} elseif($npcc ==1036){
$wpmz="〖天下第一盟〗";//物品名字
$wpms="使用后可提升属性HP+100万，攻击+100万，魔攻+100万，防御+100万！";//描述
$max1=1000000;//血
$max2=1000000;//攻击
$max3=1000000;//防御
$max4=1000000;//魔攻

} elseif($npcc ==1037){
$wpmz="〖天下第一盟主〗";//物品名字
$wpms="使用后可提升属性HP+80万，攻击+80万，魔攻+80万，防御+80万！";//描述
$max1=800000;//血
$max2=800000;//攻击
$max3=800000;//防御
$max4=800000;//魔攻

} elseif($npcc ==1038){
$wpmz="〖富甲一方〗";//物品名字
$wpms="使用后可提升属性HP+80万，攻击+80万，魔攻+80万，防御+80万！";//描述
$max1=800000;//血
$max2=800000;//攻击
$max3=800000;//防御
$max4=800000;//魔攻

} elseif($npcc ==1039){
$wpmz="〖至高无上〗";//物品名字
$wpms="使用后可提升属性HP+50万，攻击+50万，魔攻+50万，防御+50万！";//描述
$max1=500000;//血
$max2=500000;//攻击
$max3=500000;//防御
$max4=500000;//魔攻

} elseif($npcc ==1040){
$wpmz="〖哥是高富帅〗";//物品名字
$wpms="使用后可提升属性HP+30万，攻击+30万，魔攻+30万，防御+30万！";//描述
$max1=300000;//血
$max2=300000;//攻击
$max3=300000;//防御
$max4=300000;//魔攻

} elseif($npcc ==1041){
$wpmz="〖探宝之神〗";//物品名字
$wpms="使用后可提升属性HP+30万，攻击+30万，魔攻+30万，防御+30万！";//描述
$max1=300000;//血
$max2=300000;//攻击
$max3=300000;//防御
$max4=300000;//魔攻

} elseif($npcc ==1042){
$wpmz="〖仙境状元〗";//物品名字
$wpms="使用后可提升属性HP+20万，攻击+20万，魔攻+20万，防御+20万！";//描述
$max1=200000;//血
$max2=200000;//攻击
$max3=200000;//防御
$max4=200000;//魔攻

} elseif($npcc ==1043){
$wpmz="〖制胜斗者〗";//物品名字
$wpms="使用后可提升属性HP+15万，攻击+15万，魔攻+15万，防御+15万！";//描述
$max1=150000;//血
$max2=150000;//攻击
$max3=150000;//防御
$max4=150000;//魔攻


} elseif($npcc ==1044){
$wpmz="〖诛魔大神〗";//物品名字
$wpms="使用后可提升属性HP+10万，攻击+10万，魔攻+10万，防御+10万！";//描述
$max1=100000;//血
$max2=100000;//攻击
$max3=100000;//防御
$max4=100000;//魔攻

} elseif($npcc ==1045){
$wpmz="〖珠光宝气〗";//物品名字
$wpms="使用后可提升属性HP+50万，攻击+50万，魔攻+50万，防御+50万！";//描述
$max1=500000;//血
$max2=500000;//攻击
$max3=500000;//防御
$max4=500000;//魔攻


} else{

}





















	

?>




