<?php






if($npcc ==129){//【新手礼包】（1级）
	

//////////////////////////////////////////////////【新手礼包】（10级）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【新手礼包】（10级）";//需要的到某个物品的名字    // 
$wwpid=130;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【新手礼包】（10级）/////////////////////////////////////////


//////////////////////////////////////////////////【小蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【小蟠桃】";//需要的到某个物品的名字    // 
$wwpid=236;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【小蟠桃】/////////////////////////////////////////

//////////////////////////////////////////////////〖玄冰套装〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖玄冰套装〗";//需要的到某个物品的名字    // 
$wwpid=325;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖玄冰套装〗/////////////////////////////////////////

//////////////////////////////////////////////////打猎心得/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="打猎心得";//需要的到某个物品的名字    // 
$wwpid=2;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////打猎心得/////////////////////////////////////////


//////////////////////////////////////////////////宠物指南/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="宠物指南";//需要的到某个物品的名字    // 
$wwpid=3;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////宠物指南/////////////////////////////////////////

//////////////////////////////////////////////////无名仙法/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="无名仙法";//需要的到某个物品的名字    // 
$wwpid=4;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////无名仙法/////////////////////////////////////////


//////////////////////////////////////////////////清酒/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="清酒";//需要的到某个物品的名字    // 
$wwpid=247;                   //需要的到某个物品的id      //
$wwpsl=40;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////清酒/////////////////////////////////////////

//////////////////////////////////////////////////饭团/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="饭团";//需要的到某个物品的名字    // 
$wwpid=248;                   //需要的到某个物品的id      //
$wwpsl=40;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////饭团/////////////////////////////////////////



//////////////////////////////////////////////////银两增加/////////////////////////////////////////


$wwpsl=10000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////




}elseif($npcc ==130){//【新手礼包】（30级）

//////////////////////////////////////////////////【新手礼包】（30级）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【新手礼包】（30级）";//需要的到某个物品的名字    // 
$wwpid=131;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【新手礼包】（30级）/////////////////////////////////////////


//////////////////////////////////////////////////【小蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【小蟠桃】";//需要的到某个物品的名字    // 
$wwpid=236;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【小蟠桃】/////////////////////////////////////////

//////////////////////////////////////////////////【蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【蟠桃】";//需要的到某个物品的名字    // 
$wwpid=237;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【蟠桃】/////////////////////////////////////////


//////////////////////////////////////////////////【VIP练级卷】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【VIP练级卷】";//需要的到某个物品的名字    // 
$wwpid=5;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【VIP练级卷】/////////////////////////////////////////

//////////////////////////////////////////////////灵丹/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="灵丹";//需要的到某个物品的名字    // 
$wwpid=244;                   //需要的到某个物品的id      //
$wwpsl=40;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////灵丹/////////////////////////////////////////

//////////////////////////////////////////////////猕猴桃干/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="猕猴桃干";//需要的到某个物品的名字    // 
$wwpid=245;                   //需要的到某个物品的id      //
$wwpsl=30;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////猕猴桃干/////////////////////////////////////////



//////////////////////////////////////////////////银两增加/////////////////////////////////////////


$wwpsl=50000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////

}elseif($npcc ==131){//【新手礼包】（50级）

//////////////////////////////////////////////////【新手礼包】（50级）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【新手礼包】（50级）";//需要的到某个物品的名字    // 
$wwpid=132;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【新手礼包】（50级）/////////////////////////////////////////



//////////////////////////////////////////////////【三千年蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【三千年蟠桃】";//需要的到某个物品的名字    // 
$wwpid=238;                   //需要的到某个物品的id      //
$wwpsl=5;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【三千年蟠桃】/////////////////////////////////////////


//////////////////////////////////////////////////【蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【蟠桃】";//需要的到某个物品的名字    // 
$wwpid=237;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【蟠桃】/////////////////////////////////////////

//////////////////////////////////////////////////【小蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【小蟠桃】";//需要的到某个物品的名字    // 
$wwpid=236;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【小蟠桃】/////////////////////////////////////////


//////////////////////////////////////////////////灵丹/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="灵丹";//需要的到某个物品的名字    // 
$wwpid=244;                   //需要的到某个物品的id      //
$wwpsl=40;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////灵丹/////////////////////////////////////////

//////////////////////////////////////////////////云南白药/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="云南白药";//需要的到某个物品的名字    // 
$wwpid=246;                   //需要的到某个物品的id      //
$wwpsl=40;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////云南白药/////////////////////////////////////////


//////////////////////////////////////////////////银两增加/////////////////////////////////////////


$wwpsl=150000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////

} elseif ($npcc==132) {
	
	//////////////////////////////////////////////////【新手礼包】（70级）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【新手礼包】（70级）";//需要的到某个物品的名字    // 
$wwpid=133;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【新手礼包】（70级）/////////////////////////////////////////
	
	
	
		//////////////////////////////////////////////////【三千年蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【三千年蟠桃】";//需要的到某个物品的名字    // 
$wwpid=238;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【三千年蟠桃】/////////////////////////////////////////
	
	
	//////////////////////////////////////////////////【蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【蟠桃】";//需要的到某个物品的名字    // 
$wwpid=237;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【蟠桃】/////////////////////////////////////////
	
		
	
		//////////////////////////////////////////////////【小蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【小蟠桃】";//需要的到某个物品的名字    // 
$wwpid=236;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【小蟠桃】/////////////////////////////////////////
	
		
		
		//////////////////////////////////////////////////【六千年蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【六千年蟠桃】";//需要的到某个物品的名字    // 
$wwpid=239;                   //需要的到某个物品的id      //
$wwpsl=5;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【六千年蟠桃】/////////////////////////////////////////
	
				//////////////////////////////////////////////////云南白药（小捆）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="云南白药（小捆）";//需要的到某个物品的名字    // 
$wwpid=194;                   //需要的到某个物品的id      //
$wwpsl=40;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////云南白药（小捆）/////////////////////////////////////////
	
	
	
	
					//////////////////////////////////////////////////灵丹（小捆）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="灵丹（小捆）";//需要的到某个物品的名字    // 
$wwpid=192;                   //需要的到某个物品的id      //
$wwpsl=40;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////灵丹（小捆）/////////////////////////////////////////
	
	
	
	//////////////////////////////////////////////////银两增加/////////////////////////////////////////


$wwpsl=200000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
	
	
	
	} elseif ($npcc==133) {
	
	
	
//////////////////////////////////////////////////【新手礼包】（90级）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【新手礼包】（90级）";//需要的到某个物品的名字    // 
$wwpid=134;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【新手礼包】（90级）/////////////////////////////////////////

	
	
	//////////////////////////////////////////////////【三千年蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【三千年蟠桃】";//需要的到某个物品的名字    // 
$wwpid=238;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【三千年蟠桃】/////////////////////////////////////////

	
	
		
	//////////////////////////////////////////////////【蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【蟠桃】";//需要的到某个物品的名字    // 
$wwpid=237;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【蟠桃】/////////////////////////////////////////

	
	
	
		//////////////////////////////////////////////////【小蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【小蟠桃】";//需要的到某个物品的名字    // 
$wwpid=236;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【小蟠桃】/////////////////////////////////////////

	
	
		//////////////////////////////////////////////////【六千年蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【六千年蟠桃】";//需要的到某个物品的名字    // 
$wwpid=239;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【六千年蟠桃】/////////////////////////////////////////

		
	
	
		//////////////////////////////////////////////////【九千年蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【九千年蟠桃】";//需要的到某个物品的名字    // 
$wwpid=240;                   //需要的到某个物品的id      //
$wwpsl=5;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【九千年蟠桃】/////////////////////////////////////////

			//////////////////////////////////////////////////云南白药（中捆）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="云南白药（中捆）";//需要的到某个物品的名字    // 
$wwpid=191;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////云南白药（中捆）/////////////////////////////////////////
		
	//////////////////////////////////////////////////【九千年蟠桃】/////////////////////////////////////////

			//////////////////////////////////////////////////灵丹（中捆）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="灵丹（中捆）";//需要的到某个物品的名字    // 
$wwpid=192;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////灵丹（中捆）/////////////////////////////////////////
		
	
	
	
	
	
	//////////////////////////////////////////////////银两增加/////////////////////////////////////////


$wwpsl=200000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
	
	
	} elseif ($npcc==134) {
			//////////////////////////////////////////////////【人参果】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【人参果】";//需要的到某个物品的名字    // 
$wwpid=137;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【人参果】/////////////////////////////////////////
		
	
				//////////////////////////////////////////////////【三千年蟠桃礼包】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【三千年蟠桃礼包】";//需要的到某个物品的名字    // 
$wwpid=159;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【三千年蟠桃礼包】/////////////////////////////////////////
		
					//////////////////////////////////////////////////【六千年蟠桃礼包】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【六千年蟠桃礼包】";//需要的到某个物品的名字    // 
$wwpid=160;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【六千年蟠桃礼包】/////////////////////////////////////////
	
						//////////////////////////////////////////////////【九千年蟠桃礼包】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【九千年蟠桃礼包】";//需要的到某个物品的名字    // 
$wwpid=161;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【九千年蟠桃礼包】/////////////////////////////////////////



						//////////////////////////////////////////////////〖铁魂〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖铁魂〗";//需要的到某个物品的名字    // 
$wwpid=308;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖铁魂〗/////////////////////////////////////////


						//////////////////////////////////////////////////〖铜魂〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖铜魂〗";//需要的到某个物品的名字    // 
$wwpid=309;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=2;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖铜魂〗/////////////////////////////////////////

//////////////////////////////////////////////////【万能果】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【万能果】";//需要的到某个物品的名字    // 
$wwpid=128;                   //需要的到某个物品的id      //
$wwpsl=25;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【万能果】/////////////////////////////////////////

						//////////////////////////////////////////////////云南白药（大捆）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="云南白药（大捆）";//需要的到某个物品的名字    // 
$wwpid=249;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////云南白药（大捆）/////////////////////////////////////////


						//////////////////////////////////////////////////灵丹（大捆）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="灵丹（大捆）";//需要的到某个物品的名字    // 
$wwpid=192;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////灵丹（大捆）/////////////////////////////////////////






	
	//////////////////////////////////////////////////银两增加/////////////////////////////////////////


$wwpsl=1000000; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////


} elseif ($npcc==136) {//〖如意毫毛〗
$wwpmz="〖如意毫毛〗";//需要的到某个物品的名字    //
$zfsj1=2592000;//祝福时间秒数
include("./pz/ini_pz09.php");//调用ini缓存位置
} elseif ($npcc==137) {//【人参果】
$wwpmz="【人参果】";//需要的到某个物品的名字    //
$zfsj1=1296000;//祝福时间秒数
include("./pz/ini_pz09.php");//调用ini缓存位置
} elseif ($npcc==138) {//【神秘人参果】
$wwpmz="【神秘人参果】";//需要的到某个物品的名字    //
$zfsj1=2592000;//祝福时间秒数
include("./pz/ini_pz09.php");//调用ini缓存位置


} elseif($npcc ==147){//〖属性之王〗
include("./pz/ini_pz10.php");//调用ini缓存位置


} elseif($npcc ==148){//〖西游之星〗
include("./pz/ini_pz10.php");//调用ini缓存位置


} elseif($npcc ==151){//〖小富豪〗
include("./pz/ini_pz10.php");//调用ini缓存位置
} elseif($npcc ==152){//〖富豪〗
include("./pz/ini_pz10.php");//调用ini缓存位置








	
} elseif ($npcc==155) {//〖三千年蟠桃礼包〗
	
							//////////////////////////////////////////////////〖三千年蟠桃〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖三千年蟠桃〗";//需要的到某个物品的名字    // 
$wwpid=241;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖三千年蟠桃〗/////////////////////////////////////////
	

	} elseif ($npcc==156) {//〖六千年蟠桃礼包〗
	
							//////////////////////////////////////////////////〖六千年蟠桃〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖六千年蟠桃〗";//需要的到某个物品的名字    // 
$wwpid=242;                   //需要的到某个物品的id      //
$wwpsl=8;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖六千年蟠桃〗/////////////////////////////////////////
	

	
	} elseif ($npcc==157) {//〖九千年蟠桃礼包〗
	
							//////////////////////////////////////////////////〖九千年蟠桃〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖九千年蟠桃〗";//需要的到某个物品的名字    // 
$wwpid=243;                   //需要的到某个物品的id      //
$wwpsl=5;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖九千年蟠桃〗/////////////////////////////////////////
	
	
	
	
	
} elseif ($npcc==159) {//【三千年蟠桃礼包】
	
							//////////////////////////////////////////////////【三千年蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【三千年蟠桃】";//需要的到某个物品的名字    // 
$wwpid=238;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【三千年蟠桃】/////////////////////////////////////////
	

	} elseif ($npcc==160) {//【六千年蟠桃礼包】
	
							//////////////////////////////////////////////////【六千年蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【六千年蟠桃】";//需要的到某个物品的名字    // 
$wwpid=239;                   //需要的到某个物品的id      //
$wwpsl=8;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【六千年蟠桃】/////////////////////////////////////////
	

	
	} elseif ($npcc==161) {//【九千年蟠桃礼包】
	
							//////////////////////////////////////////////////【九千年蟠桃】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【九千年蟠桃】";//需要的到某个物品的名字    // 
$wwpid=240;                   //需要的到某个物品的id      //
$wwpsl=5;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【九千年蟠桃】/////////////////////////////////////////
	
		} elseif ($npcc==162) {//〖师门声望礼包〗
	
	
//调用zt.ini是否存在
   
include("./ini/zt_ini.php");
//ini文件名字
$inina="zt.ini";
//路径
$path='ache/'.$wjid;
//判断ini文件是否存在	
$ininame = $path."/".$inina;	
# 实例化ini文件操作类，并载入 .ini文件
$iniFile = new iniFile($ininame);
# 获取一个分类下某个子项的值
$mpp1=($iniFile->getItem('玩家信息','门派'));



	if($mpp1==1){
//////////////////////////////////////////////////〖1千将军府声望卷〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千将军府声望卷〗";//需要的到某个物品的名字    // 
$wwpid=11;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//

//////////////////////////////////////////////////〖1千将军府声望卷〗/////////////////////////////////////////

} elseif($mpp1==2){
//////////////////////////////////////////////////〖1千龙宫声望卷〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千龙宫声望卷〗";//需要的到某个物品的名字    // 
$wwpid=13;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//

//////////////////////////////////////////////////〖1千龙宫声望卷〗/////////////////////////////////////////

} elseif($mpp1==3){

//////////////////////////////////////////////////〖1千月宫声望卷〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千月宫声望卷〗";//需要的到某个物品的名字    // 
$wwpid=14;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//

//////////////////////////////////////////////////〖1千月宫声望卷〗/////////////////////////////////////////

} elseif($mpp1==4){
//////////////////////////////////////////////////〖1千普陀山声望卷〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千方寸山声望卷〗";//需要的到某个物品的名字    // 
$wwpid=15;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//

//////////////////////////////////////////////////〖1千普陀山声望卷〗/////////////////////////////////////////

} elseif($mpp1==5){

//////////////////////////////////////////////////〖1千普陀山声望卷〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千普陀山声望卷〗";//需要的到某个物品的名字    // 
$wwpid=12;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//

//////////////////////////////////////////////////〖1千普陀山声望卷〗/////////////////////////////////////////



} else{

//////////////////////////////////////////////////〖1千普陀山声望卷〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千普陀山声望卷〗";//需要的到某个物品的名字    // 
$wwpid=12;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//

//////////////////////////////////////////////////〖1千普陀山声望卷〗/////////////////////////////////////////



}
	


include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖师门声望礼包〗/////////////////////////////////////////
	
	
	
		
	} elseif ($npcc==163) {//〖宝象国声望礼包〗
	
							//////////////////////////////////////////////////〖1千宝象国声望卷〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千宝象国声望卷〗";//需要的到某个物品的名字    // 
$wwpid=10;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖1千宝象国声望卷〗/////////////////////////////////////////
	
	
		} elseif ($npcc==164) {//〖天宫声望礼包〗
	
							//////////////////////////////////////////////////〖1千天宫声望卷〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千天宫声望卷〗";//需要的到某个物品的名字    // 
$wwpid=16;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖1千天宫声望卷〗/////////////////////////////////////////
	
	
			} elseif ($npcc==168) {//〖地府声望礼包〗
	
							//////////////////////////////////////////////////〖1千地府声望卷〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千地府声望卷〗";//需要的到某个物品的名字    // 
$wwpid=17;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖1千地府声望卷〗/////////////////////////////////////////
	
				} elseif ($npcc==169) {//〖傲来国声望礼包〗
	
							//////////////////////////////////////////////////〖1千傲来国声望卷〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖1千傲来国声望卷〗";//需要的到某个物品的名字    // 
$wwpid=9;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖1千傲来国声望卷〗/////////////////////////////////////////
	
	
					} elseif ($npcc==170) {//〖傲来国声望礼包〗
	
							//////////////////////////////////////////////////〖1千乌鸡国声望卷〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖乌鸡国声望礼包〗";//需要的到某个物品的名字    // 
$wwpid=19;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖1千乌鸡国声望卷〗/////////////////////////////////////////
	
} elseif ($npcc==175) {//〖仓库扩容卷〗

//---------------------------------------------------------//
$wwpmz="〖仓库扩容卷〗";//需要的到某个物品的名字    // 
$ckkr=1000;
$wpzz1="玩家信息";
$wpzz2="仓库容量";
$ccc="ckrl";
  //
//---------------------------------------------------------//
include("./pz/ini_pz06.php");//调用ini缓存位置

} elseif ($npcc==191) {//云南白药（中捆）

include("./wj/dyxx.php");
include("./pz/ini_pz07.php");//调用ini缓存位置

} elseif ($npcc==192) {//灵丹（小捆）

include("./wj/dyxx.php");
include("./pz/ini_pz07.php");//调用ini缓存位置


} elseif ($npcc==193) {//冰糖葫芦

include("./wj/dyxx.php");
include("./pz/ini_pz07.php");//调用ini缓存位置


} elseif ($npcc==194) {//云南白药（小捆）

include("./wj/dyxx.php");
include("./pz/ini_pz07.php");//调用ini缓存位置
} elseif($npcc ==195){//红烧狗肉
include("./wj/dyxx.php");
include("./pz/ini_pz07.php");//调用ini缓存位置

} elseif($npcc ==196){//花雕酒
include("./wj/dyxx.php");
include("./pz/ini_pz07.php");//调用ini缓存位置

} elseif($npcc ==197){//素菜包
include("./wj/dyxx.php");
include("./pz/ini_pz07.php");//调用ini缓存位置


} elseif($npcc ==198){//猪肉包
include("./wj/dyxx.php");
include("./pz/ini_pz07.php");//调用ini缓存位置


} elseif($npcc ==199){//神仙汤
include("./wj/dyxx.php");
include("./pz/ini_pz07.php");//调用ini缓存位置

} elseif($npcc ==200){//【保命丸】
include("./wj/dyxx.php");
include("./pz/ini_pz07.php");//调用ini缓存位置





	
	
} else{
$wpsy=1;//使用失败
include("wpsyts.php");
}















	

?>




