<?php


if($npcc ==999){//〖背包扩容卷〗



} elseif($npcc ==320){//【幻想武器包】
$wpsy=2;//使用成功



//调用zt.ini是否存在
   
include("./ini/zt_ini.php");
//ini文件名字
$inina="zt.ini";
//路径
$path='ache/'.$wjid;
//判断ini文件是否存在	
$ininame = $path."/".$inina;	
# 实例化ini文件操作类，并载入 .ini文件
$iniFile = new iniFile($ininame);
# 获取一个分类下某个子项的值
$mpp1=($iniFile->getItem('玩家信息','门派'));


	if($mpp1==1){
//---------------------------------------------------
$zbid=14;//得到装备的id//【幻想抢】
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

} elseif($mpp1==2){
//---------------------------------------------------
$zbid=28;//得到装备的id//【幻想叉】
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
} elseif($mpp1==3){

//---------------------------------------------------
$zbid=70;//得到装备的id//【幻想剑】
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

} elseif($mpp1==4){
//---------------------------------------------------
$zbid=42;//得到装备的id//【幻想棍】
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
} elseif($mpp1==5){
//---------------------------------------------------
$zbid=56;//得到装备的id//【幻想杖】
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------


} else{
//---------------------------------------------------
$zbid=14;//得到装备的id//幻想叉
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------


}

} elseif($npcc ==321){//【幻想防具包】
$wpsy=2;//使用成功

//---------------------------------------------------
$zbid=101;//得到装备的id//【幻想战甲】
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

//---------------------------------------------------
$zbid=133;//得到装备的id//【幻想战盔】
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

//---------------------------------------------------
$zbid=165;//得到装备的id//【幻想战靴】
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------



} elseif($npcc ==322){//【幻想首饰包】
$wpsy=2;//使用成功
//---------------------------------------------------
$zbid=196;//得到装备的id//【幻想项链】
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
//---------------------------------------------------
$zbid=234;//得到装备的id//【幻想手镯】
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

} elseif($npcc ==323){//〖雷皇套装〗
$wpsy=2;//使用成功


//调用zt.ini是否存在
   
include("./ini/zt_ini.php");
//ini文件名字
$inina="zt.ini";
//路径
$path='ache/'.$wjid;
//判断ini文件是否存在	
$ininame = $path."/".$inina;	
# 实例化ini文件操作类，并载入 .ini文件
$iniFile = new iniFile($ininame);
# 获取一个分类下某个子项的值
$mpp1=($iniFile->getItem('玩家信息','门派'));


	if($mpp1==1){
//---------------------------------------------------
$zbid=13;//得到装备的id//〖雷皇枪〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

} elseif($mpp1==2){
//---------------------------------------------------
$zbid=27;//得到装备的id//〖雷皇叉〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
} elseif($mpp1==3){

//---------------------------------------------------
$zbid=69;//得到装备的id//〖雷皇剑〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

} elseif($mpp1==4){
//---------------------------------------------------
$zbid=41;//得到装备的id//〖雷皇棍〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
} elseif($mpp1==5){
//---------------------------------------------------
$zbid=55;//得到装备的id//〖雷皇杖〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------


} else{
//---------------------------------------------------
$zbid=55;//得到装备的id//〖雷皇杖〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------


}
//---------------------------------------------------
$zbid=100;//得到装备的id//〖雷皇战衣〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------


//---------------------------------------------------
$zbid=164;//得到装备的id//〖雷皇战靴〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
//---------------------------------------------------
$zbid=132;//得到装备的id//〖雷皇战盔〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

//---------------------------------------------------
$zbid=233;//得到装备的id//〖雷皇守护〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

//---------------------------------------------------
$zbid=195;//得到装备的id//〖雷皇之怒〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

} elseif($npcc ==324){//〖小巨灵套装〗
//---------------------------------------------------
$zbid=98;//得到装备的id//〖刑天铁甲〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
//---------------------------------------------------
$zbid=129;//得到装备的id//〖旱魃鬼面〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
//---------------------------------------------------
$zbid=161;//得到装备的id//〖神皇之靴〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

//---------------------------------------------------
$zbid=224;//得到装备的id//〖祝融戒指〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
//---------------------------------------------------
$zbid=235;//得到装备的id//〖共工护符〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

} elseif($npcc ==325){//〖玄冰套装〗
$wpsy=2;//使用成功


//调用zt.ini是否存在
   
include("./ini/zt_ini.php");
//ini文件名字
$inina="zt.ini";
//路径
$path='ache/'.$wjid;
//判断ini文件是否存在	
$ininame = $path."/".$inina;	
# 实例化ini文件操作类，并载入 .ini文件
$iniFile = new iniFile($ininame);
# 获取一个分类下某个子项的值
$mpp1=($iniFile->getItem('玩家信息','门派'));


	if($mpp1==1){
//---------------------------------------------------
$zbid=1;//得到装备的id//〖玄冰枪〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

} elseif($mpp1==2){
//---------------------------------------------------
$zbid=15;//得到装备的id//〖玄冰叉〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
} elseif($mpp1==3){

//---------------------------------------------------
$zbid=57;//得到装备的id//〖玄冰剑〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

} elseif($mpp1==4){
//---------------------------------------------------
$zbid=29;//得到装备的id//〖玄冰棍〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
} elseif($mpp1==5){
//---------------------------------------------------
$zbid=43;//得到装备的id//〖玄冰杖〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------


} else{


}
//---------------------------------------------------
$zbid=71;//得到装备的id//〖玄冰战甲〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------


//---------------------------------------------------
$zbid=134;//得到装备的id//〖玄冰战靴〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
//---------------------------------------------------
$zbid=102;//得到装备的id//〖玄冰头盔〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

//---------------------------------------------------
$zbid=197;//得到装备的id//〖玄冰手镯〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

//---------------------------------------------------
$zbid=166;//得到装备的id//〖玄冰项链〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------



} elseif($npcc ==326){//〖仙魂套装〗
$wpsy=2;//使用成功


//调用zt.ini是否存在
   
include("./ini/zt_ini.php");
//ini文件名字
$inina="zt.ini";
//路径
$path='ache/'.$wjid;
//判断ini文件是否存在	
$ininame = $path."/".$inina;	
# 实例化ini文件操作类，并载入 .ini文件
$iniFile = new iniFile($ininame);
# 获取一个分类下某个子项的值
$mpp1=($iniFile->getItem('玩家信息','门派'));


	if($mpp1==1){
//---------------------------------------------------
$zbid=2;//得到装备的id//〖仙魂枪〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

} elseif($mpp1==2){
//---------------------------------------------------
$zbid=16;//得到装备的id//〖仙魂叉〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
} elseif($mpp1==3){

//---------------------------------------------------
$zbid=58;//得到装备的id//〖仙魂剑〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

} elseif($mpp1==4){
//---------------------------------------------------
$zbid=30;//得到装备的id//〖仙魂棍〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
} elseif($mpp1==5){
//---------------------------------------------------
$zbid=44;//得到装备的id//〖仙魂仗〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------


} else{


}
//---------------------------------------------------
$zbid=72;//得到装备的id//〖仙魂战甲〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------


//---------------------------------------------------
$zbid=135;//得到装备的id//〖仙魂战靴〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------
//---------------------------------------------------
$zbid=103;//得到装备的id//〖仙魂头盔〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

//---------------------------------------------------
$zbid=198;//得到装备的id//〖仙魂守护〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------

//---------------------------------------------------
$zbid=167;//得到装备的id//〖仙魂之怒〗
include("./pz/ini_pz11.php");//调用ini缓存位置
//---------------------------------------------------









} elseif ($npcc==398) {//〖小智慧果〗
$wwpmz="〖小智慧果〗";//需要的到某个物品的名字    //
$zfsj1=3600;//祝福时间秒数
include("./pz/ini_pz09.php");//调用ini缓存位置

} elseif ($npcc==399) {//〖大智慧果〗
$wwpmz="〖大智慧果〗";//需要的到某个物品的名字    //
$zfsj1=3600;//祝福时间秒数
include("./pz/ini_pz09.php");//调用ini缓存位置




} elseif ($npcc==400) {//〖背包扩容卷〗
//---------------------------------------------------------//
$wwpmz="〖背包扩容卷〗";//需要的到某个物品的名字    // 
$ckkr=1000;
$wpzz1="玩家信息";
$wpzz2="背包容量";
$ccc="bbrl";
  //
//---------------------------------------------------
include("./pz/ini_pz06.php");//调用ini缓存位置





} else{
$wpsy=1;//使用失败
include("wpsyts.php");

}















	

?>




