<?php


if($npcc ==999){


} elseif($npcc ==701){//〖十大富豪〗
include("./pz/ini_pz10.php");//调用ini缓存位置
} elseif($npcc ==702){//〖威力无边〗
include("./pz/ini_pz10.php");//调用ini缓存位置

} elseif($npcc ==703){//〖装备榜第一〗
include("./pz/ini_pz10.php");//调用ini缓存位置


} elseif($npcc ==704){//〖等级榜第一〗
include("./pz/ini_pz10.php");//调用ini缓存位置

} elseif($npcc ==705){//〖三界战神〗
include("./pz/ini_pz10.php");//调用ini缓存位置

} elseif($npcc ==706){//〖BOSS终结者〗
include("./pz/ini_pz10.php");//调用ini缓存位置

} elseif($npcc ==707){//〖一骑当先〗
include("./pz/ini_pz10.php");//调用ini缓存位置

} elseif($npcc ==708){//〖新妖之王〗
include("./pz/ini_pz10.php");//调用ini缓存位置



} elseif($npcc ==709){//〖豪无人性〗
include("./pz/ini_pz10.php");//调用ini缓存位置



} elseif($npcc ==711){//〖封神英雄〗
include("./pz/ini_pz10.php");//调用ini缓存位置


} elseif($npcc ==712){//〖天外飞仙征服者〗
include("./pz/ini_pz10.php");//调用ini缓存位置

} elseif($npcc ==713){//〖打遍天下无敌手〗
include("./pz/ini_pz10.php");//调用ini缓存位置


} elseif($npcc ==714){//〖土豪就是任性〗
include("./pz/ini_pz10.php");//调用ini缓存位置




} elseif($npcc ==715){//〖十大神翼〗
include("./pz/ini_pz10.php");//调用ini缓存位置


} elseif($npcc ==716){//〖不屈白银〗
include("./pz/ini_pz10.php");//调用ini缓存位置


} elseif($npcc ==739){//【秘宝宝箱】
include("./box/mbbx.php");//调用箱子使用代码






} elseif($npcc ==739){//【秘宝宝箱】
include("./box/mbbx.php");//调用箱子使用代码


} elseif($npcc >=745&&$npcc <=770){//中秋月饼
include("./wj/dysx.php");
include("./pz/ini_pz08.php");//调用ini缓存位置




} elseif($npcc ==772){//〖风花月饼礼盒〗
include("./box/fhbx.php");//调用箱子使用代码
} elseif($npcc ==773){//〖雪月月饼礼盒〗
include("./box/xybx.php");//调用箱子使用代码
} elseif($npcc ==774){//〖金秋月饼礼盒〗
include("./box/jqbx.php");//调用箱子使用代码
} elseif($npcc ==775){//〖嫦娥月饼礼盒〗
include("./box/hfbx.php");//调用箱子使用代码
} elseif($npcc ==776){//〖鸿福月饼礼盒〗
include("./box/cebx.php");//调用箱子使用代码

} elseif($npcc ==777){//【10元充值卡】
$wpsy=2;//使用成功
$ppwpsl=100;//最终充值所得
$vipjf=10;
$ppwpsl1=1;//赠送背包卷
$ppwpsl2=1;//赠送仓库卷
include("./pz/ini_pzz042.php");//调用ini缓存位置

} elseif($npcc ==778){//【20元充值卡】
$wpsy=2;//使用成功
$ppwpsl=200;//最终充值所得
$vipjf=20;
$ppwpsl1=1;//赠送背包卷
$ppwpsl2=1;//赠送仓库卷
include("./pz/ini_pzz042.php");//调用ini缓存位置



} elseif($npcc ==779){//【50元充值卡】
$wpsy=2;//使用成功
$ppwpsl=500;//最终充值所得
$vipjf=50;
$ppwpsl1=2;//赠送背包卷
$ppwpsl2=2;//赠送仓库卷
include("./pz/ini_pzz042.php");//调用ini缓存位置
} elseif($npcc ==780){//【100元充值卡】
$wpsy=2;//使用成功
$ppwpsl=1000;//最终充值所得
$vipjf=100;
$ppwpsl1=5;//赠送背包卷
$ppwpsl2=5;//赠送仓库卷
include("./pz/ini_pzz042.php");//调用ini缓存位置

} elseif($npcc ==781){//【200元充值卡】
$wpsy=2;//使用成功
$ppwpsl=2000;//最终充值所得
$vipjf=200;
$ppwpsl1=10;//赠送背包卷
$ppwpsl2=10;//赠送仓库卷
include("./pz/ini_pzz042.php");//调用ini缓存位置

} elseif($npcc ==782){//【500元充值卡】
$wpsy=2;//使用成功
$ppwpsl=5000;//最终充值所得
$vipjf=500;
$ppwpsl1=30;//赠送背包卷
$ppwpsl2=30;//赠送仓库卷
include("./pz/ini_pzz042.php");//调用ini缓存位置

} elseif($npcc ==783){//【1000元充值卡】
$wpsy=2;//使用成功
$ppwpsl=10000;//最终充值所得
$vipjf=1000;
$ppwpsl1=70;//赠送背包卷
$ppwpsl2=70;//赠送仓库卷
include("./pz/ini_pzz042.php");//调用ini缓存位置

} elseif($npcc ==784){//【2000元充值卡】
$wpsy=2;//使用成功
$ppwpsl=20000;//最终充值所得
$vipjf=2000;
$ppwpsl1=200;//赠送背包卷
$ppwpsl2=200;//赠送仓库卷
include("./pz/ini_pzz042.php");//调用ini缓存位置

} elseif($npcc ==785){//【150级升级卡】
$wpsy=2;//使用成功
$lvl=150;
include("./pz/ini_pzz043.php");//调用ini缓存位置

} elseif($npcc ==786){//【1亿修炼经验丹】

$wpsy=2;
$jy=100000000;          //设置限制使用得到的经验                  //
//---------------------------------------------------------//
include("./pz/ini_pzz040.php");//调用ini缓存位置

} elseif($npcc ==787){//【5亿修炼经验丹】

$wpsy=2;
$jy=500000000;          //设置限制使用得到的经验                  //
//---------------------------------------------------------//
include("./pz/ini_pzz040.php");//调用ini缓存位置

} elseif($npcc ==788){//【10亿修炼经验丹】

$wpsy=2;
$jy=1000000000;          //设置限制使用得到的经验                  //
//---------------------------------------------------------//
include("./pz/ini_pzz040.php");//调用ini缓存位置




} elseif($npcc ==789){//【二区花果山助力包】




//////////////////////////////////////////////////【200元充值卡】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【200元充值卡】";//需要的到某个物品的名字    // 
$wwpid=781;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【200元充值卡】/////////////////////////////////////////




//////////////////////////////////////////////////〖诛仙武器令〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖诛仙武器令〗";//需要的到某个物品的名字    // 
$wwpid=594;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖诛仙武器令〗/////////////////////////////////////////





//////////////////////////////////////////////////〖诛仙盔甲令〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖诛仙盔甲令〗";//需要的到某个物品的名字    // 
$wwpid=595;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖诛仙盔甲令〗/////////////////////////////////////////


//////////////////////////////////////////////////〖诛仙头盔令〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖诛仙头盔令〗";//需要的到某个物品的名字    // 
$wwpid=596;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖诛仙头盔令〗/////////////////////////////////////////



//////////////////////////////////////////////////〖诛仙鞋子令〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖诛仙鞋子令〗";//需要的到某个物品的名字    // 
$wwpid=597;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖诛仙鞋子令〗/////////////////////////////////////////


//////////////////////////////////////////////////〖诛仙项链令〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖诛仙项链令〗";//需要的到某个物品的名字    // 
$wwpid=598;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖诛仙项链令〗/////////////////////////////////////////



//////////////////////////////////////////////////〖诛仙手镯令〗/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖诛仙手镯令〗";//需要的到某个物品的名字    // 
$wwpid=599;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖诛仙手镯令〗/////////////////////////////////////////



//////////////////////////////////////////////////【150级升级卡】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【150级升级卡】";//需要的到某个物品的名字    // 
$wwpid=785;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【150级升级卡】/////////////////////////////////////////

//////////////////////////////////////////////////【vip练级卷】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【vip练级卷】";//需要的到某个物品的名字    // 
$wwpid=5;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【vip练级卷】/////////////////////////////////////////

//////////////////////////////////////////////////【10亿修炼经验丹】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【10亿修炼经验丹】";//需要的到某个物品的名字    // 
$wwpid=788;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【10亿修炼经验丹】/////////////////////////////////////////

//////////////////////////////////////////////////【万能果】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【万能果】";//需要的到某个物品的名字    // 
$wwpid=128;                   //需要的到某个物品的id      //
$wwpsl=100;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【万能果】/////////////////////////////////////////

//////////////////////////////////////////////////【1万西游声望卷轴】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【1万西游声望卷轴】";//需要的到某个物品的名字    // 
$wwpid=564;                   //需要的到某个物品的id      //
$wwpsl=100;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【1万西游声望卷轴】/////////////////////////////////////////


//////////////////////////////////////////////////【1万法宝经验卷轴】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【1万法宝经验卷轴】";//需要的到某个物品的名字    // 
$wwpid=565;                   //需要的到某个物品的id      //
$wwpsl=100;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【1万法宝经验卷轴】/////////////////////////////////////////

//////////////////////////////////////////////////〖瞌睡虫〗（典藏版）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖瞌睡虫〗（典藏版）";//需要的到某个物品的名字    // 
$wwpid=493;                   //需要的到某个物品的id      //
$wwpsl=5;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖瞌睡虫〗（典藏版）/////////////////////////////////////////






} elseif($npcc ==790){//【三区水帘洞助力包】





//////////////////////////////////////////////////【幻想武器包】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【幻想武器包】";//需要的到某个物品的名字    // 
$wwpid=320;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【幻想武器包】/////////////////////////////////////////





//////////////////////////////////////////////////【幻想防具包】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【幻想防具包】";//需要的到某个物品的名字    // 
$wwpid=321;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【幻想防具包】/////////////////////////////////////////


//////////////////////////////////////////////////【幻想首饰包】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【幻想首饰包】";//需要的到某个物品的名字    // 
$wwpid=322;                   //需要的到某个物品的id      //
$wwpsl=1;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【幻想首饰包】/////////////////////////////////////////




//////////////////////////////////////////////////【vip练级卷】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【vip练级卷】";//需要的到某个物品的名字    // 
$wwpid=5;                   //需要的到某个物品的id      //
$wwpsl=20;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【vip练级卷】/////////////////////////////////////////

//////////////////////////////////////////////////【10亿修炼经验丹】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【10亿修炼经验丹】";//需要的到某个物品的名字    // 
$wwpid=788;                   //需要的到某个物品的id      //
$wwpsl=10;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=5;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【10亿修炼经验丹】/////////////////////////////////////////

//////////////////////////////////////////////////【万能果】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【万能果】";//需要的到某个物品的名字    // 
$wwpid=128;                   //需要的到某个物品的id      //
$wwpsl=100;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【万能果】/////////////////////////////////////////

//////////////////////////////////////////////////【1万西游声望卷轴】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【1万西游声望卷轴】";//需要的到某个物品的名字    // 
$wwpid=564;                   //需要的到某个物品的id      //
$wwpsl=100;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【1万西游声望卷轴】/////////////////////////////////////////


//////////////////////////////////////////////////【1万法宝经验卷轴】/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="【1万法宝经验卷轴】";//需要的到某个物品的名字    // 
$wwpid=565;                   //需要的到某个物品的id      //
$wwpsl=100;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=1;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////【1万法宝经验卷轴】/////////////////////////////////////////

//////////////////////////////////////////////////〖瞌睡虫〗（典藏版）/////////////////////////////////////////

//---------------------------------------------------------//
$q2="wp".$wjid;                //数据库位置               //
$wwpmz="〖瞌睡虫〗（典藏版）";//需要的到某个物品的名字    // 
$wwpid=493;                   //需要的到某个物品的id      //
$wwpsl=5;                     //需要的到某个物品的数量    //这里是新增物品必改值
$wwpfl=4;                     //需要的到某个物品的是分类   //
//---------------------------------------------------------//
include("./pz/ini_pz01.php");//调用ini缓存位置
$wpsy=2;//使用成功
include("./pz/ini_pz02.php");//调用ini缓存位置
include("./pz/ini_pz01.php");//调用ini缓存位置


//////////////////////////////////////////////////〖瞌睡虫〗（典藏版）/////////////////////////////////////////





} elseif($npcc ==791){//〖圣贤宝石〗1个
$bsid1=29;//宝石id
$jjmz="〖圣贤宝石〗";
$bssl1=1;//宝石数量
$bszl1=1;//	需要扣物品的重量
$fzsl=$bssl1;//得到多个需更改负重变量
$fzzl=$bssl1;//得到多个需更改负重变量
include("./sql/mysql.php");//调用数据库连接 
//背包容量变更
include("./pz/ini_pzz05.php");
//这里是得到宝石代码
$kcrl="";
$bsid=$bsid1;//宝石id
$bssl=$bssl1;//宝石数量
$wpzl=$bszl1;//	需要扣物品的重量
include("./pz/ini_pzz08.php");//得到宝石
//背包容量变更加
$kcrl=$bssl*$wpzl+$kcrl;
//这里是得到宝石代码
include("./pz/ini_pzz09.php");
echo "<font color=black>恭喜你！获得了".$jjmz."x".$bssl."</font>"."<br>";
$wpsy=2;//使用成功



} elseif($npcc ==792){//〖圣贤宝石〗3个
$bsid1=29;//宝石id
$jjmz="〖圣贤宝石〗";
$bssl1=3;//宝石数量
$bszl1=1;//	需要扣物品的重量
$fzsl=$bssl1;//得到多个需更改负重变量
$fzzl=$bssl1;//得到多个需更改负重变量
include("./sql/mysql.php");//调用数据库连接 
//背包容量变更
include("./pz/ini_pzz05.php");
//这里是得到宝石代码
$kcrl="";
$bsid=$bsid1;//宝石id
$bssl=$bssl1;//宝石数量
$wpzl=$bszl1;//	需要扣物品的重量
include("./pz/ini_pzz08.php");//得到宝石
//背包容量变更加
$kcrl=$bssl*$wpzl+$kcrl;
//这里是得到宝石代码
include("./pz/ini_pzz09.php");
echo "<font color=black>恭喜你！获得了".$jjmz."x".$bssl."</font>"."<br>";
$wpsy=2;//使用成功




} elseif($npcc ==793){//〖圣贤宝石〗8个
$bsid1=29;//宝石id
$jjmz="〖圣贤宝石〗";
$bssl1=8;//宝石数量
$bszl1=1;//	需要扣物品的重量
$fzsl=$bssl1;//得到多个需更改负重变量
$fzzl=$bssl1;//得到多个需更改负重变量
include("./sql/mysql.php");//调用数据库连接 
//背包容量变更
include("./pz/ini_pzz05.php");
//这里是得到宝石代码
$kcrl="";
$bsid=$bsid1;//宝石id
$bssl=$bssl1;//宝石数量
$wpzl=$bszl1;//	需要扣物品的重量
include("./pz/ini_pzz08.php");//得到宝石
//背包容量变更加
$kcrl=$bssl*$wpzl+$kcrl;
//这里是得到宝石代码
include("./pz/ini_pzz09.php");
echo "<font color=black>恭喜你！获得了".$jjmz."x".$bssl."</font>"."<br>";
$wpsy=2;//使用成功



} elseif($npcc ==794){//〖圣贤宝石〗30个
$bsid1=29;//宝石id
$jjmz="〖圣贤宝石〗";
$bssl1=30;//宝石数量
$bszl1=1;//	需要扣物品的重量
$fzsl=$bssl1;//得到多个需更改负重变量
$fzzl=$bssl1;//得到多个需更改负重变量
include("./sql/mysql.php");//调用数据库连接 
//背包容量变更
include("./pz/ini_pzz05.php");
//这里是得到宝石代码
$kcrl="";
$bsid=$bsid1;//宝石id
$bssl=$bssl1;//宝石数量
$wpzl=$bszl1;//	需要扣物品的重量
include("./pz/ini_pzz08.php");//得到宝石
//背包容量变更加
$kcrl=$bssl*$wpzl+$kcrl;
//这里是得到宝石代码
include("./pz/ini_pzz09.php");
echo "<font color=black>恭喜你！获得了".$jjmz."x".$bssl."</font>"."<br>";
$wpsy=2;//使用成功



} elseif ($npcc==795) {//【极品7位ID号（1111111）】
$lh=1111111;//靓号id
include("./pz/ini_pz12.php");//调用ini缓存位置

} elseif ($npcc==796) {//【极品7位ID号（2222222）】
$lh=2222222;//靓号id
include("./pz/ini_pz12.php");//调用ini缓存位置

} elseif ($npcc==797) {//【极品7位ID号（3333333）】
$lh=3333333;//靓号id
include("./pz/ini_pz12.php");//调用ini缓存位置

} elseif ($npcc==798) {//【极品7位ID号（4444444）】
$lh=4444444;//靓号id
include("./pz/ini_pz12.php");//调用ini缓存位置

} elseif ($npcc==799) {//【极品7位ID号（5555555）】
$lh=5555555;//靓号id
include("./pz/ini_pz12.php");//调用ini缓存位置

} elseif ($npcc==800) {//【极品7位ID号（6666666）】
$lh=6666666;//靓号id
include("./pz/ini_pz12.php");//调用ini缓存位置















} else{
$wpsy=1;//使用失败
include("wpsyts.php");

}











	

?>




