<?php



if($npcc ==1001){
$wpmz="〖鸿蒙天圣石〗";//物品名字
$wpms="〖鸿蒙圣佑石〗升级人物仙90级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==1002){
$wpmz="〖鸿蒙天圣砂〗";//物品名字
$wpms="〖鸿蒙天圣砂〗升级人物仙90级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==1003){
$wpmz="〖鸿蒙天圣魂〗";//物品名字
$wpms="〖鸿蒙天圣魂〗升级人物仙90级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==1004){
$wpmz="【万】";//物品名字
$wpms="【万】万圣节节日多动字体";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==1005){
$wpmz="【圣】";//物品名字
$wpms="【圣】万圣节节日多动字体";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==1006){
$wpmz="【节】";//物品名字
$wpms="【节】万圣节节日多动字体";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==1007){
$wpmz="【快】";//物品名字
$wpms="【快】万圣节节日多动字体";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==1008){
$wpmz="【乐】";//物品名字
$wpms="【乐】万圣节节日多动字体";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==1009){
$wpmz="〖万圣节万能字〗";//物品名字
$wpms="〖万圣节万能字〗任意兑换活动字体";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类




} elseif($npcc ==1010){
$wpmz="〖神の陨魂〗";//物品名字
$wpms="仙陨的装备升星材料！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==1011){
$wpmz="〖神の陨升星符〗";//物品名字
$wpms="拥有这强大的力量的符咒，可将百分之百将仙陨的装备升星成功！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==1012){
$wpmz="〖棒棒糖〗";//物品名字
$wpms="使用后HP上限增加500！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==1013){
$wpmz="〖杏仁糖〗";//物品名字
$wpms="使用后HP上限增加800！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1014){
$wpmz="〖米花糖〗";//物品名字
$wpms="使用后HP上限增加1000！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1015){
$wpmz="〖水果糖〗";//物品名字
$wpms="使用后HP上限增加1300！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1016){
$wpmz="〖棉花糖〗";//物品名字
$wpms="使用后攻击增加500！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1017){
$wpmz="〖牛皮糖〗";//物品名字
$wpms="使用后攻击增加700！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1018){
$wpmz="〖咖啡糖〗";//物品名字
$wpms="使用后攻击增加900！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==1019){
$wpmz="〖可乐糖〗";//物品名字
$wpms="使用后攻击增加1200！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==1020){
$wpmz="〖太妃糖〗";//物品名字
$wpms="使用后魔攻增加500！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1021){
$wpmz="〖胡桃糖〗";//物品名字
$wpms="使用后魔攻增加700！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1022){
$wpmz="〖南瓜糖〗";//物品名字
$wpms="使用后魔攻增加900！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==1023){
$wpmz="〖榴莲糖〗";//物品名字
$wpms="使用后魔攻增加1200！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类




} elseif($npcc ==1024){
$wpmz="〖狮子糖〗";//物品名字
$wpms="使用后防御增加500！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1025){
$wpmz="〖绵羊糖〗";//物品名字
$wpms="使用后防御增加700！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1026){
$wpmz="〖大象糖〗";//物品名字
$wpms="使用后防御增加900！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==1027){
$wpmz="〖老虎塘〗";//物品名字
$wpms="使用后防御增加1200！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



















} elseif($npcc ==1028){
$wpmz="〖甜蜜梅心棒〗";//物品名字
$wpms="使用后HP增加5000！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1029){
$wpmz="〖云朵棉花糖〗";//物品名字
$wpms="使用后攻击增加5000！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1030){
$wpmz="〖浪漫酒心糖〗";//物品名字
$wpms="使用后魔攻增加5000！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==1031){
$wpmz="〖大白兔奶糖〗";//物品名字
$wpms="使用后防御增加5000！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==1032){
$wpmz="〖万圣节精品糖果箱〗";//物品名字
$wpms="能够开出万圣节各种活动糖果！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==1033){
$wpmz="〖万圣节极品糖果箱〗";//物品名字
$wpms="能够开出万圣节各种活动糖果+限定糖果！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==1034){
$wpmz="〖千秋万载〗";//物品名字
$wpms="使用后可提升属性HP+200万，攻击+200万，魔攻+200万，防御+200万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1035){
$wpmz="〖纵横三界づ王者风云〗";//物品名字
$wpms="使用后可提升属性HP+140万，攻击+140万，魔攻+140万，防御+140万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1036){
$wpmz="〖天下第一盟〗";//物品名字
$wpms="使用后可提升属性HP+100万，攻击+100万，魔攻+100万，防御+100万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1037){
$wpmz="〖天下第一盟主〗";//物品名字
$wpms="使用后可提升属性HP+80万，攻击+80万，魔攻+80万，防御+80万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类




} elseif($npcc ==1038){
$wpmz="〖富甲一方〗";//物品名字
$wpms="使用后可提升属性HP+80万，攻击+80万，魔攻+80万，防御+80万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==1039){
$wpmz="〖至高无上〗";//物品名字
$wpms="使用后可提升属性HP+50万，攻击+50万，魔攻+50万，防御+50万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1040){
$wpmz="〖哥是高富帅〗";//物品名字
$wpms="使用后可提升属性HP+30万，攻击+30万，魔攻+30万，防御+30万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1041){
$wpmz="〖探宝之神〗";//物品名字
$wpms="使用后可提升属性HP+30万，攻击+30万，魔攻+30万，防御+30万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==1042){
$wpmz="〖仙境状元〗";//物品名字
$wpms="使用后可提升属性HP+20万，攻击+20万，魔攻+20万，防御+20万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1043){
$wpmz="〖制胜斗者〗";//物品名字
$wpms="使用后可提升属性HP+15万，攻击+15万，魔攻+15万，防御+15万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1044){
$wpmz="〖诛魔大神〗";//物品名字
$wpms="使用后可提升属性HP+10万，攻击+10万，魔攻+10万，防御+10万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1045){
$wpmz="〖珠光宝气〗";//物品名字
$wpms="使用后可提升属性HP+50万，攻击+50万，魔攻+50万，防御+50万！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==1046){
$wpmz="【万圣节捣蛋劵】";//物品名字
$wpms="用于万圣节称号兑换";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==1047){
$wpmz="〖南瓜宝箱〗";//物品名字
$wpms="〖南瓜宝箱〗能开出价值不菲的物品";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==1048){
$wpmz="【177级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1049){
$wpmz="【155级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1050){
$wpmz="【160级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==1051){
$wpmz="【165级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1052){
$wpmz="【170级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1053){
$wpmz="【175级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1054){
$wpmz="【180级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1055){
$wpmz="【185级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1056){
$wpmz="【190级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1057){
$wpmz="【195级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1058){
$wpmz="【199级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==1059){
$wpmz="【烤火鸡】";
$wpms="感恩节活动掉落【烤火鸡】";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==1060){
$wpmz="【南瓜饼】";
$wpms="感恩节活动掉落【南瓜饼】";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类
} elseif($npcc ==1061){
$wpmz="【红莓酱】";
$wpms="感恩节活动掉落【红莓酱】";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类
} elseif($npcc ==1062){
$wpmz="【甜山芋】";
$wpms="感恩节活动掉落【甜山芋】";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类
} elseif($npcc ==1063){
$wpmz="【玉蜀黎】";
$wpms="感恩节活动掉落【玉蜀黎】";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类
} elseif($npcc ==1064){
$wpmz="〖感恩票〗";
$wpms="〖感恩票〗兑换任意感恩节活动材料";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==1065){
$wpmz="〖良品烤火鸡〗（血）";//物品名字
$wpms="使用后HP上限增加500！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==1066){
$wpmz="〖上品烤火鸡〗（血）";//物品名字
$wpms="使用后HP上限增加800！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1067){
$wpmz="〖精品烤火鸡〗（血）";//物品名字
$wpms="使用后HP上限增加1000！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1068){
$wpmz="〖极品烤火鸡〗（血）";//物品名字
$wpms="使用后HP上限增加1300！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==1069){
$wpmz="〖良品烤火鸡〗（攻）";//物品名字
$wpms="使用后攻击增加500！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==1070){
$wpmz="〖上品烤火鸡〗（攻）";//物品名字
$wpms="使用后攻击增加800！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1071){
$wpmz="〖精品烤火鸡〗（攻）";//物品名字
$wpms="使用后攻击增加1000！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1072){
$wpmz="〖极品烤火鸡〗（攻）";//物品名字
$wpms="使用后攻击增加1300！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==1073){
$wpmz="〖良品烤火鸡〗（魔）";//物品名字
$wpms="使用后魔攻增加500！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==1074){
$wpmz="〖上品烤火鸡〗（魔）";//物品名字
$wpms="使用后魔攻增加800！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1075){
$wpmz="〖精品烤火鸡〗（魔）";//物品名字
$wpms="使用后魔攻增加1000！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1076){
$wpmz="〖极品烤火鸡〗（魔）";//物品名字
$wpms="使用后魔攻增加1300！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1077){
$wpmz="〖良品烤火鸡〗（防）";//物品名字
$wpms="使用后御增增加500！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==1078){
$wpmz="〖上品烤火鸡〗（防）";//物品名字
$wpms="使用后御增增加800！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1079){
$wpmz="〖精品烤火鸡〗（防）";//物品名字
$wpms="使用后御增增加1000！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1080){
$wpmz="〖极品烤火鸡〗（防）";//物品名字
$wpms="使用后防御增加1300！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==1081){
$wpmz="〖极品烤全羊〗（血）";//物品名字
$wpms="使用后hp上限增加10000！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1082){
$wpmz="〖极品烤全羊〗（攻）";//物品名字
$wpms="使用后攻击增加8888！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1083){
$wpmz="〖极品烤全羊〗（魔）";//物品名字
$wpms="使用后魔攻增加8888！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1084){
$wpmz="〖极品烤全羊〗（防）";//物品名字
$wpms="使用后防御增加8888！";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==1085){
$wpmz="〖感恩小羊礼包〗";//物品名字
$wpms="打开后可烤火鸡和烤全羊！！美味~~";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==1086){
$wpmz="〖感恩火鸡礼包〗";//物品名字
$wpms="打开后可烤火鸡！！美味~~";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==1087){
$wpmz="〖10至500元现金红包〗";//物品名字
$wpms="打开可随机得到10元至500元不等的现金红包";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1088){
$wpmz="〖10至200元现金红包〗";//物品名字
$wpms="打开可随机得到10元至200元不等的现金红包";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1089){
$wpmz="〖10至50元现金红包〗";//物品名字
$wpms="打开可随机得到10元至50元不等的现金红包";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1090){
$wpmz="〖10元红包〗";//物品名字
$wpms="赠送给游戏ID为10000001的小轩GM兑换现金";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==1091){
$wpmz="〖20元红包〗";//物品名字
$wpms="赠送给游戏ID为10000001的小轩GM兑换现金";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1092){
$wpmz="〖50元红包〗";//物品名字
$wpms="赠送给游戏ID为10000001的小轩GM兑换现金";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1093){
$wpmz="〖100元红包〗";//物品名字
$wpms="赠送给游戏ID为10000001的小轩GM兑换现金";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1094){
$wpmz="〖200元红包〗";//物品名字
$wpms="赠送给游戏ID为10000001的小轩GM兑换现金";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1095){
$wpmz="〖300元红包〗";//物品名字
$wpms="赠送给游戏ID为10000001的小轩GM兑换现金";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1096){
$wpmz="〖400元红包〗";//物品名字
$wpms="赠送给游戏ID为10000001的小轩GM兑换现金";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1097){
$wpmz="〖500元红包〗";//物品名字
$wpms="赠送给游戏ID为10000001的小轩GM兑换现金";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1098){
$wpmz="〖点石成金劵〗";//物品名字
$wpms="〖点石成金劵〗可在玄武大街点石成金员传送进入矿山，遇到各路神仙能够获得更多的金矿石";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1099){
$wpmz="〖金矿石〗";//物品名字
$wpms="〖金矿石〗可在玄武大街点石成金员换购金劵";//描述
$wpjd=9999;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} else{





}

?>




