<?php

if($npcc ==1){
$wpmz="回城卷";//物品名字
$wpms="使用可回到长安十字街头";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类
$gmjg=5000;
} elseif($npcc ==2){
$wpmz="打猎心得";//物品名字
$wpms="上面记载着打猎的秘籍";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类
} elseif($npcc ==3){
$wpmz="宠物指南";//物品名字
$wpms="使用学会技能捕捉术！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类

} elseif($npcc ==4){
$wpmz="无名仙法";//物品名字
$wpms="使用可学习对应门派的技能";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类



} elseif($npcc ==5){
$wpmz="【VIP练级卷】";//物品名字
$wpms="使用可获得30分钟VIP练级祝福时间，拥有VIP练级祝福时间就可以进入刷级通道了！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=1;//分类
$wpwng=1;//万能果价格
} elseif($npcc ==8){
$wpmz="腾云符";//物品名字
$wpms="使用此符可飞到你想去的地方简直是飞机中的战斗机！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类
$gmjg=5000;//购买价格




} elseif($npcc ==9){
$wpmz="〖1千傲来国声望卷〗";//物品名字
$wpms="使用可获得1000傲来国声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类
} elseif($npcc ==10){
$wpmz="〖1千宝象国声望卷〗";//物品名字
$wpms="使用可获得1000宝象国声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类

} elseif($npcc ==11){

$wpmz="〖1千将军府声望卷〗";//物品名字
$wpms="使用可获得1000将军府声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类



} elseif($npcc ==12){

$wpmz="〖1千普陀山声望卷〗";//物品名字
$wpms="使用可获得1000普陀山声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类



} elseif($npcc ==13){

$wpmz="〖1千龙宫声望卷〗";//物品名字
$wpms="使用可获得1000龙宫声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类

} elseif($npcc ==14){

$wpmz="〖1千月宫声望卷〗";//物品名字
$wpms="使用可获得1000月宫声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类


} elseif($npcc ==15){

$wpmz="〖1千方寸山声望卷〗";//物品名字
$wpms="使用可获得1000方寸山声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类


} elseif($npcc ==16){

$wpmz="〖1千天宫声望卷〗";//物品名字
$wpms="使用可获得1000天宫声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类

} elseif($npcc ==17){

$wpmz="〖1千地府声望卷〗";//物品名字
$wpms="使用可获得1000地府声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类

} elseif($npcc ==18){

$wpmz="〖1千西游声望卷〗";//物品名字
$wpms="使用可获得1000西游声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类

} elseif($npcc ==19){

$wpmz="〖1千乌鸡国声望卷〗";//物品名字
$wpms="使用可获得1000乌鸡国声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类

} elseif($npcc ==20){

$wpmz="〖1千恶魔广场声望卷〗";//物品名字
$wpms="使用可获得1000恶魔声望！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类
} elseif($npcc ==21){

$wpmz="〖1千夫妻声望卷〗";//物品名字
$wpms="使用可获得1000夫妻声望！";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=60;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类




} elseif($npcc ==22){
$wpmz="红宝石一";//物品名字
$wpms="稀少难得的红宝石一，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==23){
$wpmz="红水晶一";//物品名字
$wpms="稀少难得的红水晶一，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==24){
$wpmz="蓝宝石一";//物品名字
$wpms="稀少难得的蓝宝石一，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==25){
$wpmz="蓝水晶一";//物品名字
$wpms="稀少难得的蓝水晶一，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==26){
$wpmz="黄宝石一";//物品名字
$wpms="稀少难得的黄宝石一，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==27){
$wpmz="黄水晶一";//物品名字
$wpms="稀少难得的黄水晶一，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==28){
$wpmz="金刚石一";//物品名字
$wpms="稀少难得的金刚石一，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==29){
$wpmz="佛印石一";//物品名字
$wpms="稀少难得的佛印石一，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==30){
$wpmz="玄武石一";//物品名字
$wpms="稀少难得的玄武石一，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==31){
$wpmz="红宝石二";//物品名字
$wpms="稀少难得的红宝石二，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==32){
$wpmz="红水晶二";//物品名字
$wpms="稀少难得的红水晶二，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==33){
$wpmz="蓝宝石二";//物品名字
$wpms="稀少难得的蓝宝石二，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==34){
$wpmz="蓝水晶二";//物品名字
$wpms="稀少难得的蓝水晶二，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==35){
$wpmz="黄宝石二";//物品名字
$wpms="稀少难得的黄宝石二，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==36){
$wpmz="黄水晶二";//物品名字
$wpms="稀少难得的黄水晶二，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==37){
$wpmz="金刚石二";//物品名字
$wpms="稀少难得的金刚石二，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==38){
$wpmz="佛印石二";//物品名字
$wpms="稀少难得的佛印石二，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==39){
$wpmz="玄武石二";//物品名字
$wpms="稀少难得的玄武石二，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==40){
$wpmz="红宝石三";//物品名字
$wpms="稀少难得的红宝石三，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==41){
$wpmz="红水晶三";//物品名字
$wpms="稀少难得的红水晶三，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==42){
$wpmz="蓝宝石三";//物品名字
$wpms="稀少难得的蓝宝石三，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==43){
$wpmz="蓝水晶三";//物品名字
$wpms="稀少难得的蓝水晶三，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==44){
$wpmz="黄宝石三";//物品名字
$wpms="稀少难得的黄宝石三，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==45){
$wpmz="黄水晶三";//物品名字
$wpms="稀少难得的黄水晶三，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==46){
$wpmz="金刚石三";//物品名字
$wpms="稀少难得的金刚石三，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==47){
$wpmz="佛印石三";//物品名字
$wpms="稀少难得的佛印石三，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==48){
$wpmz="玄武石三";//物品名字
$wpms="稀少难得的玄武石三，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==49){
$wpmz="红宝石四";//物品名字
$wpms="稀少难得的红宝石四，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==50){
$wpmz="红水晶四";//物品名字
$wpms="稀少难得的红水晶四，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==51){
$wpmz="蓝宝石四";//物品名字
$wpms="稀少难得的蓝宝石四，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==52){
$wpmz="蓝水晶四";//物品名字
$wpms="稀少难得的蓝水晶四，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==53){
$wpmz="黄宝石四";//物品名字
$wpms="稀少难得的黄宝石四，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==54){
$wpmz="黄水晶四";//物品名字
$wpms="稀少难得的黄水晶四，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==55){
$wpmz="金刚石四";//物品名字
$wpms="稀少难得的金刚石四，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==56){
$wpmz="佛印石四";//物品名字
$wpms="稀少难得的佛印石四，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==57){
$wpmz="玄武石四";//物品名字
$wpms="稀少难得的玄武石四，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==58){
$wpmz="红宝石五";//物品名字
$wpms="稀少难得的红宝石五，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==59){
$wpmz="红水晶五";//物品名字
$wpms="稀少难得的红水晶五，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==60){
$wpmz="蓝宝石五";//物品名字
$wpms="稀少难得的蓝宝石五，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==61){
$wpmz="蓝水晶五";//物品名字
$wpms="稀少难得的蓝水晶五，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==62){
$wpmz="黄宝石五";//物品名字
$wpms="稀少难得的黄宝石五，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==63){
$wpmz="黄水晶五";//物品名字
$wpms="稀少难得的黄水晶五，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==64){
$wpmz="金刚石五";//物品名字
$wpms="稀少难得的金刚石五，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==65){
$wpmz="佛印石五";//物品名字
$wpms="稀少难得的佛印石五，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==66){
$wpmz="玄武石五";//物品名字
$wpms="稀少难得的玄武石五，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类






} elseif($npcc ==67){
$wpmz="红宝石六";//物品名字
$wpms="稀少难得的红宝石六，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==68){
$wpmz="红水晶六";//物品名字
$wpms="稀少难得的红水晶六，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==69){
$wpmz="蓝宝石六";//物品名字
$wpms="稀少难得的蓝宝石六，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==70){
$wpmz="蓝水晶六";//物品名字
$wpms="稀少难得的蓝水晶六，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==71){
$wpmz="黄宝石六";//物品名字
$wpms="稀少难得的黄宝石六，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==72){
$wpmz="黄水晶六";//物品名字
$wpms="稀少难得的黄水晶六，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==73){
$wpmz="金刚石六";//物品名字
$wpms="稀少难得的金刚石六，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==74){
$wpmz="佛印石六";//物品名字
$wpms="稀少难得的佛印石六，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==75){
$wpmz="玄武石六";//物品名字
$wpms="稀少难得的玄武石六，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类













} elseif($npcc ==76){
$wpmz="【冰晶】";//物品名字
$wpms="稀少难得的【冰晶】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==77){
$wpmz="【雷晶】";//物品名字
$wpms="稀少难得的【雷晶】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==78){
$wpmz="【白骨靴】";//物品名字
$wpms="稀少难得的【白骨靴】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==79){
$wpmz="【食尸鬼之皮】";//物品名字
$wpms="稀少难得的【食尸鬼之皮】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==80){
$wpmz="【祭祀之帽】";//物品名字
$wpms="稀少难得的【祭祀之帽】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==81){
$wpmz="【剥皮鬼之皮】";//物品名字
$wpms="稀少难得的【剥皮鬼之皮】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==82){
$wpmz="【白骨项链】";//物品名字
$wpms="稀少难得的【白骨项链】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==83){
$wpmz="【炼尸宝石】";//物品名字
$wpms="稀少难得的【炼尸宝石】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==84){
$wpmz="【黄袍武器】";//物品名字
$wpms="稀少难得的【黄袍武器】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==85){
$wpmz="【锻造图】";//物品名字
$wpms="稀少难得的【锻造图】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==86){
$wpmz="【黑熊宝石】";//物品名字
$wpms="稀少难得的【黑熊宝石】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==87){
$wpmz="【鹿角手镯】";//物品名字
$wpms="稀少难得的【鹿角手镯】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==88){
$wpmz="【妖将合金】";//物品名字
$wpms="稀少难得的【妖将合金】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==89){
$wpmz="【野熊铠甲】";//物品名字
$wpms="稀少难得的【野熊铠甲】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==90){
$wpmz="【火红毛皮】";//物品名字
$wpms="稀少难得的【火红毛皮】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==91){
$wpmz="【玉衣片】";//物品名字
$wpms="稀少难得的【玉衣片】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==92){
$wpmz="【淡黄狐尾】";//物品名字
$wpms="稀少难得的【淡黄狐尾】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==93){
$wpmz="【猩红石】";//物品名字
$wpms="稀少难得的【猩红石】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==94){
$wpmz="【拔地鼠筋】";//物品名字
$wpms="稀少难得的【拔地鼠筋】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==95){
$wpmz="【天香碧玉竹】";//物品名字
$wpms="稀少难得的【天香碧玉竹】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==96){
$wpmz="【骷髅头】";//物品名字
$wpms="稀少难得的【骷髅头】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==97){
$wpmz="【银犀角】";//物品名字
$wpms="稀少难得的【银犀角】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==98){
$wpmz="【玄铁手镯】";//物品名字
$wpms="稀少难得的【玄铁手镯】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==99){
$wpmz="【黑晶】";//物品名字
$wpms="稀少难得的【黑晶】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==100){
$wpmz="【金精】";//物品名字
$wpms="稀少难得的【金精】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

	
	
	
	
	
	
	









} else{





}


?>




