<?php

if($npcc ==101){
	
	
	
	
$wpmz="【金犀角】";//物品名字
$wpms="稀少难得的【金犀角】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==102){
$wpmz="【烈焰火羽】";//物品名字
$wpms="稀少难得的【烈焰火羽】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==103){
$wpmz="【冰凌石】";//物品名字
$wpms="稀少难得的【冰凌石】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==104){
$wpmz="【逆鳞】";//物品名字
$wpms="稀少难得的【逆鳞】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==105){
$wpmz="【紫金】";//物品名字
$wpms="稀少难得的【紫金】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==106){
$wpmz="【琉璃】";//物品名字
$wpms="稀少难得的【琉璃】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==107){
$wpmz="【灵晶】";//物品名字
$wpms="稀少难得的【灵晶】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==108){
$wpmz="【引魄】";//物品名字
$wpms="稀少难得的【引魄】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==109){
$wpmz="【勾魂】";//物品名字
$wpms="稀少难得的【勾魂】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==110){
$wpmz="【东海神铁】";//物品名字
$wpms="稀少难得的【东海神铁】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==111){
$wpmz="【千年寒冰】";//物品名字
$wpms="稀少难得的【千年寒冰】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==112){
$wpmz="〖黑曜石〗";//物品名字
$wpms="稀少难得的〖黑曜石〗，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==113){
$wpmz="【玉鼎黄色碎片】";//物品名字
$wpms="稀少难得的【玉鼎黄色碎片】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==114){
$wpmz="【玉鼎红色碎片】";//物品名字
$wpms="稀少难得的【玉鼎红色碎片】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==115){
$wpmz="【玉鼎绿色碎片】";//物品名字
$wpms="稀少难得的【玉鼎绿色碎片】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==116){
$wpmz="【玉鼎橙色碎片】";//物品名字
$wpms="稀少难得的【玉鼎橙色碎片】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类




} elseif($npcc ==117){
$wpmz="〖苍白内丹〗";//物品名字
$wpms="稀少难得的〖苍白内丹〗，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==118){
$wpmz="〖黄澄内丹〗";//物品名字
$wpms="稀少难得的〖黄澄内丹〗，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==119){
$wpmz="【千年冰魄】";//物品名字
$wpms="稀少难得的【千年冰魄】，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==120){
$wpmz="黑龙之牙";//物品名字
$wpms="稀少难得的黑龙之牙，升级装备的必须品！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==121){
$wpmz="〖妖魔内丹〗";//物品名字
$wpms="妖怪们修炼得内丹！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==122){
$wpmz="【英雄牌】";//物品名字
$wpms="英雄的象征，完成各大副本可以获得！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==123){
$wpmz="〖石块〗";//物品名字
$wpms="国家建设资源！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==124){
$wpmz="〖木头〗";//物品名字
$wpms="国家建设资源！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==125){
$wpmz="〖硫磺〗";//物品名字
$wpms="国家建设资源！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==126){
$wpmz="小幸运草";//物品名字
$wpms="稀少难得的小幸运草，升级装备的必须品！（直接在身上装备升级消耗）";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==127){
$wpmz="〖金豆〗";//物品名字
$wpms="人人都喜欢的金豆子！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类




} elseif($npcc ==128){
$wpmz="【万能果】";//物品名字
$wpms="据说这是无所不能的果子~~";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==129){
$wpmz="【新手礼包】（1级）";//物品名字
$wpms="精心为新手准备的礼包，打开可获得大量物品～";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类
	
	



} elseif($npcc ==130){
$wpmz="【新手礼包】（10级）";//物品名字
$wpms="精心为新手准备的礼包，打开可获得大量物品～";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=10;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==131){
$wpmz="【新手礼包】（30级）";//物品名字
$wpms="精心为新手准备的礼包，打开可获得大量物品～";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=30;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类
	
	} elseif($npcc ==132){
$wpmz="【新手礼包】（50级）";//物品名字
$wpms="精心为新手准备的礼包，打开可获得大量物品～";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=50;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类
	
	} elseif($npcc ==133){
$wpmz="【新手礼包】（70级）";//物品名字
$wpms="精心为新手准备的礼包，打开可获得大量物品～";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=70;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类
	} elseif($npcc ==134){
$wpmz="【新手礼包】（90级）";//物品名字
$wpms="精心为新手准备的礼包，打开可获得大量物品～";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=90;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==136){

$wpmz="〖如意毫毛〗";//物品名字
$wpms="使用可获得1个月的vip服务，生命增加10000点，防御永久增加7000点，攻击永久增加6000点，魔攻永久增加6000点";//描述
$wpjd=30;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==137){
$wpmz="【人参果】";//物品名字
$wpms="使用可获得半个月的vip服务，生命增加5000点，防御永久增加3500点，攻击永久增加3000点，魔攻永久增加3000点";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==138){
$wpmz="【神秘人参果】";//物品名字
$wpms="使用可获得1个月的vip服务，生命增加10000点，防御永久增加7000点，攻击永久增加6000点，魔攻永久增加6000点";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类




} elseif($npcc ==147){
$wpmz="〖属性之王〗";//物品名字
$wpms="使用后可以永久增加HP60000，攻击35000，防御40000，魔攻30000";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
	
} elseif($npcc ==148){
$wpmz="〖西游之星〗";//物品名字
$wpms="使用可获得西游之星称号！附带永久生命值88888点！限用一次！";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类	
	
	} elseif($npcc ==151){
$wpmz="〖小富豪〗";//物品名字
$wpms="使用可获得小富豪称号，生命永久增加58888！";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类	

} elseif($npcc ==152){
$wpmz="〖富豪〗";//物品名字
$wpms="使用可获得富豪称号！生命永久增加88888！";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类	

} elseif($npcc ==155){
$wpmz="〖三千年蟠桃礼包〗";//物品名字
$wpms="使用可获得20个〖三千年蟠桃〗！";//描述
$wpjd=6;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==156){
$wpmz="〖六千年蟠桃礼包〗";//物品名字
$wpms="使用可获得8个〖六千年蟠桃〗！";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==157){
$wpmz="〖九千年蟠桃礼包〗";//物品名字
$wpms="使用可获得5个〖九千年蟠桃〗！";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==158){
$wpmz="〖仙魂套装〗";//物品名字
$wpms="打开可获得仙魂装备一套！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==159){
$wpmz="【三千年蟠桃礼包】";//物品名字
$wpms="打开可获得20个【三千年蟠桃】！";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==160){
$wpmz="【六千年蟠桃礼包】";//物品名字
$wpms="打开可获得8【六千年蟠桃】！";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==161){
$wpmz="【九千年蟠桃礼包】";//物品名字
$wpms="打开可获得5个【九千年蟠桃】！";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==162){
$wpmz="〖师门声望礼包〗";//物品名字
$wpms="打开可获得20张相应师门的声望卷！";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==163){
$wpmz="〖宝象国声望礼包〗";//物品名字
$wpms="打开可获得20张〖宝象国声望卷〗！";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==164){
$wpmz="〖天宫声望礼包〗";//物品名字
$wpms="打开可获得20张〖天宫声望卷〗！";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==168){
$wpmz="〖地府声望礼包〗";//物品名字
$wpms="打开可获得20张〖地府声望卷〗！";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==169){
$wpmz="〖傲来国声望礼包〗";//物品名字
$wpms="打开可获得20张〖傲来国声望卷〗！";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==170){
$wpmz="〖乌鸡国声望礼包〗";//物品名字
$wpms="打开可获得20张〖乌鸡国声望卷〗！";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==175){
$wpmz="〖仓库扩容卷〗";//物品名字
$wpms="使用后增加仓库容量加1000";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


	
	} elseif($npcc ==191){

$wpmz="云南白药（中捆）";//物品名字
$wpms="使用可恢复5000体力！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=40000;

} elseif($npcc ==192){
$wpmz="灵丹（小捆）";//物品名字
$wpms="使用恢复1000内力！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=8000;


} elseif($npcc ==193){
$wpmz="冰糖葫芦";//物品名字
$wpms="使用恢复MP800点！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=4000;

} elseif($npcc ==194){
$wpmz="云南白药（小捆）";//物品名字
$wpms="使用恢复2500体力！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=2000;

} elseif($npcc ==195){
$wpmz="红烧狗肉";//物品名字
$wpms="使用可恢复HP220点！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=3000;
} elseif($npcc ==196){
$wpmz="花雕酒";//物品名字
$wpms="使用可恢复MP110点！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=3000;
} elseif($npcc ==197){
$wpmz="素菜包";//物品名字
$wpms="香喷喷的素菜包！使用可恢复HP250";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=3500;
} elseif($npcc ==198){
$wpmz="猪肉包";//物品名字
$wpms="香喷喷的猪肉包！使用可恢复HP370";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=4000;
} elseif($npcc ==199){
$wpmz="神仙汤";//物品名字
$wpms="使用可恢复HP500点！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=5000;


} elseif($npcc ==200){
	
	

$wpmz="【保命丸】";//物品名字
$wpms="使用可恢复150000体力!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类







} else{





}
?>




