<?php


if($npcc ==701){
$wpmz="〖十大富豪〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==702){
$wpmz="〖威力无边〗";//物品名字
$wpms="使用后可以永久增加HP110000，攻击110000，防御110000，魔攻110000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==703){

$wpmz="〖装备榜第一〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==704){

$wpmz="〖等级榜第一〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==705){

$wpmz="〖三界战神〗";//物品名字
$wpms="使用后可以永久增加HP180000，攻击180000，防御180000，魔攻180000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==706){

$wpmz="〖BOSS终结者〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==707){

$wpmz="〖一骑当先〗";//物品名字
$wpms="使用后可以永久增加HP300000，攻击300000，防御300000，魔攻300000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==708){

$wpmz="〖新妖之王〗";//物品名字
$wpms="使用后可以永久增加HP400000，攻击400000，防御400000，魔攻400000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==709){

$wpmz="〖豪无人性〗";//物品名字
$wpms="使用后可以永久增加HP120000，攻击120000，防御120000，魔攻120000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类







} elseif($npcc ==711){

$wpmz="〖封神英雄〗";//物品名字
$wpms="使用后可以永久增加HP130000，攻击130000，防御130000，魔攻130000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==712){

$wpmz="〖天外飞仙征服者〗";//物品名字
$wpms="使用后可以永久增加HP150000，攻击150000，防御150000，魔攻150000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==713){

$wpmz="〖打遍天下无敌手〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==714){

$wpmz="〖土豪就是任性〗";//物品名字
$wpms="使用后可以永久增加HP400000，攻击400000，防御400000，魔攻400000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==715){

$wpmz="〖十大神翼〗";//物品名字
$wpms="使用后可以永久增加HP180000，攻击180000，防御180000，魔攻180000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==716){

$wpmz="〖不屈白银〗";//物品名字
$wpms="使用后可以永久增加HP80000，攻击80000，防御80000，魔攻80000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==717){
$wpmz="【坚毅之星】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后HP提升200000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==718){
$wpmz="【守护之星】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后防御提升100000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==719){
$wpmz="【盛怒之星】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后攻击提升100000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==720){
$wpmz="【镇静之星】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后魔攻提升100000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类







} elseif($npcc ==721){
$wpmz="【复苏之星】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后HP提升300000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==722){
$wpmz="【潮汐之星】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后防御提升200000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==723){
$wpmz="【寂灭之星】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后攻击提升200000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==724){
$wpmz="【风暴之星】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后魔攻提升200000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类




} elseif($npcc ==725){
$wpmz="【神星の永生】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后HP提升500000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==726){
$wpmz="【神星の混沌】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后防御提升400000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==727){
$wpmz="【神星の秩序】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后攻击提升400000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==728){
$wpmz="【神星の圣恩】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后魔攻提升400000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==729){
$wpmz="【小宇宙】";//物品名字
$wpms="凑齐足够的可用于各类占星兑换";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==730){
$wpmz="【占星秘典】";//物品名字
$wpms="可用于〖高级占星〗〖极品占星〗消耗";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类




} elseif($npcc ==731){
$wpmz="【智慧之星】（攻）";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后冰火雷攻+5";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==732){
$wpmz="【智慧之星】（防）";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后冰火雷防+5";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==733){
$wpmz="【元素之星】（攻）";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后冰火雷攻+10";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==734){
$wpmz="【元素之星】（防）";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后冰火雷防+10";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==735){
$wpmz="【神星の元素之王】（攻）";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后冰火雷攻+20";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==736){
$wpmz="【神星の元素之王】（防）";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后冰火雷防+20";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==737){
$wpmz="【秘宝钥匙】";
$wpms="用于开启秘宝宝箱的钥匙";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==738){
$wpmz="【秘宝碎片】";
$wpms="用于合成秘宝宝箱或者钥匙的碎片";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==739){
$wpmz="【秘宝宝箱】";
$wpms="开启秘宝宝箱需要【秘宝钥匙】";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==740){
$wpmz="【桂花糕】";
$wpms="中秋节获得获取";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==741){
$wpmz="【糯米粉】";
$wpms="中秋节活动掉落";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==742){
$wpmz="〖香甜桂花〗";
$wpms="中秋节活动掉落";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==743){
$wpmz="〖玉兔蜜糖〗";
$wpms="中秋节活动掉落";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==744){
$wpmz="【金秋的思念】";
$wpms="中秋节活动各类礼盒开出（用于时装兑换）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类
} elseif($npcc ==745){
$wpmz="〖凤梨月饼〗";
$wpms="使用后永久增加HP1000（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==746){
$wpmz="〖玫瑰月饼〗";
$wpms="使用后永久增加HP1200（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==747){
$wpmz="〖莲蓉月饼〗";
$wpms="使用后永久增加HP1400（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==748){
$wpmz="〖椰蓉月饼〗";
$wpms="使用后永久增加HP1500（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==749){
$wpmz="〖蓝莓月饼〗";
$wpms="使用后永久增加HP1600（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==750){
$wpmz="〖桂花月饼〗";
$wpms="使用后永久增加HP1800（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==751){
$wpmz="〖葡萄月饼〗";
$wpms="使用后永久增加HP2000（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==752){
$wpmz="〖五仁月饼〗";
$wpms="使用后永久增加攻击500（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==753){
$wpmz="〖双黄月饼〗";
$wpms="使用后永久增加攻击700（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==754){
$wpmz="〖冰皮月饼〗";
$wpms="使用后永久增加攻击900（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==755){
$wpmz="〖水果月饼〗";
$wpms="使用后永久增加攻击1100（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==756){
$wpmz="〖红豆沙月饼〗";
$wpms="使用后永久增加攻击1500（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==757){
$wpmz="〖黄金月饼〗";
$wpms="使用后永久增加魔攻500（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==758){
$wpmz="〖云腿月饼〗";
$wpms="使用后永久增加魔攻700（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==759){
$wpmz="〖水蜜桃月饼〗";
$wpms="使用后永久增加魔攻900（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==760){
$wpmz="〖哈密瓜月饼〗";
$wpms="使用后永久增加魔攻1100（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==761){
$wpmz="〖草莓月饼〗";
$wpms="使用后永久增加魔攻1500（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类







} elseif($npcc ==762){
$wpmz="〖鲜花月饼〗";
$wpms="使用后永久增加防御500（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==763){
$wpmz="〖七彩月饼〗";
$wpms="使用后永久增加防御700（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==764){
$wpmz="〖榄仁烧鸡月饼〗";
$wpms="使用后永久增加防御900（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==765){
$wpmz="〖奶油椰丝月饼〗";
$wpms="使用后永久增加防御1100（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==766){
$wpmz="〖叉烧腊肠月饼〗";
$wpms="使用后永久增加防御1500（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==767){
$wpmz="〖嫦娥月饼〗（血）";
$wpms="使用后永久增加HP6000（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==768){
$wpmz="〖嫦娥月饼〗（攻）";
$wpms="使用后永久增加攻击4000（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==769){
$wpmz="〖嫦娥月饼〗（魔）";
$wpms="使用后永久增加魔攻4000（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==770){
$wpmz="〖嫦娥月饼〗（防）";
$wpms="使用后永久增加防御3000（中秋节活动获得）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==771){
$wpmz="〖玉兔月饼〗";
$wpms="将此月饼赠送给嫦娥将获得中秋积分（中秋节抢榜特供）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==772){
$wpmz="〖风花月饼礼盒〗";
$wpms="能开出各种好吃的月饼";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==773){
$wpmz="〖雪月月饼礼盒〗";
$wpms="能开出各种好吃的月饼";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==774){
$wpmz="〖金秋月饼礼盒〗";
$wpms="能开出各种好吃的月饼";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==775){
$wpmz="〖鸿福月饼礼盒〗";
$wpms="能开出各种好吃的月饼";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类



} elseif($npcc ==776){
$wpmz="〖嫦娥月饼礼盒〗";
$wpms="能开出各种好吃的月饼";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类



} elseif($npcc ==777){
$wpmz="【10元充值卡】";
$wpms="使用后可获得10元现金充值1:10的金豆和对等的vip积分（使用此充值卡不参与充值排名）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==778){
$wpmz="【20元充值卡】";
$wpms="使用后可获得20元现金充值1:10的金豆和对等的vip积分（使用此充值卡不参与充值排名）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==779){
$wpmz="【50元充值卡】";
$wpms="使用后可获得50元现金充值1:10的金豆和对等的vip积分（使用此充值卡不参与充值排名）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==780){
$wpmz="【100元充值卡】";
$wpms="使用后可获得100元现金充值1:10的金豆和对等的vip积分（使用此充值卡不参与充值排名）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==781){
$wpmz="【200元充值卡】";
$wpms="使用后可获得200元现金充值1:10的金豆和对等的vip积分（使用此充值卡不参与充值排名）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==782){
$wpmz="【500元充值卡】";
$wpms="使用后可获得500元现金充值1:10的金豆和对等的vip积分（使用此充值卡不参与充值排名）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==783){
$wpmz="【1000元充值卡】";
$wpms="使用后可获得1000元现金充值1:10的金豆和对等的vip积分（使用此充值卡不参与充值排名）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==784){
$wpmz="【2000元充值卡】";
$wpms="使用后可获得2000元现金充值1:10的金豆和对等的vip积分（使用此充值卡不参与充值排名）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==785){
$wpmz="【150级升级卡】";
$wpms="使用后可获将等级变更为150级（注意请勿大于150等级使用否则也会变为150级）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==786){
$wpmz="【1亿修炼经验丹】";//物品名字
$wpms="使用后获得一亿修炼经验";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==787){
$wpmz="【5亿修炼经验丹】";//物品名字
$wpms="使用后获得五亿修炼经验";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==788){
$wpmz="【10亿修炼经验丹】";//物品名字
$wpms="使用后获得十亿修炼经验";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==789){
$wpmz="【二区花果山助力包】";//物品名字
$wpms="打开后可获得【200充值卡】x1【诛仙套装】【150级升级卡】x1，【vip练级卷】x20，【10亿修炼经验丹】x10，【万能果】x100，【1万西游声望卷轴】x100，【1万法宝经验卷轴】x100，〖瞌睡虫〗（典藏版）x5（仅为一区老玩家提供）";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==790){
$wpmz="【三区水帘洞助力包】";//物品名字
$wpms="打开后可获得【幻想套装】【vip练级卷】x20，【10亿修炼经验丹】x10，【万能果】x100，【1万西游声望卷轴】x100，【1万法宝经验卷轴】x100，〖瞌睡虫〗（典藏版）x5（全服赠送）";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类





} elseif($npcc ==791){
$wpmz="〖圣贤宝石包〗（1个）";//物品名字
$wpms="打开后获得〖圣贤宝石〗x1";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==792){
$wpmz="〖圣贤宝石包〗（3个）";//物品名字
$wpms="打开后获得〖圣贤宝石〗x3";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==793){
$wpmz="〖圣贤宝石包〗（8个）";//物品名字
$wpms="打开后获得〖圣贤宝石〗x8";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==794){
$wpmz="〖圣贤宝石包〗（30个）";//物品名字
$wpms="打开后获得〖圣贤宝石〗x30";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==795){
$wpmz="〖极品7位ID号（11111111）靓号卡〗";//物品名字
$wpms="使用后ID变更为11111111，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==796){
$wpmz="〖极品7位ID号（2222222）靓号卡〗";//物品名字
$wpms="使用后ID变更为2222222，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==797){
$wpmz="〖极品7位ID号（3333333）靓号卡〗";//物品名字
$wpms="使用后ID变更为3333333，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==798){
$wpmz="〖极品7位ID号（4444444）靓号卡〗";//物品名字
$wpms="使用后ID变更为4444444，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==799){
$wpmz="〖极品7位ID号（5555555）靓号卡〗";//物品名字
$wpms="使用后ID变更为5555555，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==800){
$wpmz="〖极品7位ID号（6666666）靓号卡〗";//物品名字
$wpms="使用后ID变更为6666666，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类













} else{





}

?>




