<?php



if($npcc ==201){
$wpmz="〖小生命丹〗";//物品名字
$wpms="1级丹药，使用增加100HP，每人限用100个。住宅炼丹房炼制；金豆超市购买获得！";//描述
$wpjd=30;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类










} elseif($npcc ==203){
$wpmz="〖中生命丹〗";//物品名字
$wpms="3级丹药，使用增加500HP，每人限用100个。住宅炼丹房炼制；金豆超市购买获得！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==204){
$wpmz="〖大生命丹〗";//物品名字
$wpms="4级丹药，使用增加5000HP，每人限用100个。住宅炼丹房炼制；金豆超市购买获得！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类





} elseif($npcc ==205){
$wpmz="〖小积分丹〗";//物品名字
$wpms="使用增加200HP， 每人限用100颗。消费积分奖励！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类




} elseif($npcc ==206){
$wpmz="〖积分体力丹〗";//物品名字
$wpms="使用增加200HP， 每人限用100颗。消费积分奖励！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==207){
$wpmz="〖积分中生命丹〗";//物品名字
$wpms="使用增加300HP， 每人限用100颗。消费积分奖励！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类





} elseif($npcc ==208){
$wpmz="〖积分大生命丹〗";//物品名字
$wpms="使用增加500HP， 每人限用100颗。消费积分奖励！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==209){
$wpmz="〖积分超级体力丹〗";//物品名字
$wpms="使用增加1000HP， 每人限用100颗。消费积分奖励！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==210){
$wpmz="〖神秘体力丹〗";//物品名字
$wpms="使用增加200HP，每人限用100个。金豆超市购买获得！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==211){
$wpmz="〖冰火丹〗";//物品名字
$wpms="使用增加100HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==212){
$wpmz="〖鬼面丹〗";//物品名字
$wpms="使用增加100HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类





} elseif($npcc ==213){
$wpmz="〖混世丹〗";//物品名字
$wpms="使用增加100HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==214){
$wpmz="〖金银丹〗";//物品名字
$wpms="使用增加200HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==215){
$wpmz="〖金兜丹〗";//物品名字
$wpms="使用增加200HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==216){
$wpmz="〖魔牛丹〗";//物品名字
$wpms="使用增加200HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==217){
$wpmz="〖凤仙丸〗";//物品名字
$wpms="使用增加300HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类





} elseif($npcc ==218){
$wpmz="〖麒麟丹〗";//物品名字
$wpms="使用增加100HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==219){
$wpmz="〖玉华丸〗";//物品名字
$wpms="使用增加300HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==220){
$wpmz="〖金平丸〗";//物品名字
$wpms="使用增加300HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==221){
$wpmz="〖龙虎豹胎丸〗";//物品名字
$wpms="使用增加100HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==222){
$wpmz="〖血河丹〗";//物品名字
$wpms="使用增加200HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==223){
$wpmz="〖白巫丹〗";//物品名字
$wpms="使用增加200HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==224){
$wpmz="〖玲珑丹〗";//物品名字
$wpms="使用增加500HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==225){
$wpmz="〖朱紫丸〗";//物品名字
$wpms="使用增加300HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==226){
$wpmz="〖比丘丸〗";//物品名字
$wpms="使用增加100HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==227){
$wpmz="〖比丘丹〗";//物品名字
$wpms="使用增加200HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==228){
$wpmz="〖天法丸〗";//物品名字
$wpms="使用增加200HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==229){
$wpmz="〖天竺丸〗";//物品名字
$wpms="使用增加500HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==230){
$wpmz="【公测生命丹】";//物品名字
$wpms="使用增加300HP，每人限用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==231){
$wpmz="【公测攻击丹】";//物品名字
$wpms="使用永久增加攻击120点！最多可使用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==232){
$wpmz="【公测防御丹】";//物品名字
$wpms="使用永久增加防御250点！最多可使用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==233){
$wpmz="【公测魔攻丹】";//物品名字
$wpms="使用永久增加魔攻120点！最多可使用100颗！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==234){
$wpmz="【99级解封丹】";//物品名字
$wpms="使用后可解封99级继续升级到109级！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==235){
$wpmz="〖经验丹〗";//物品名字
$wpms="使用可获得300万经验(每日限制10次)";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==236){
$wpmz="【小蟠桃】";//物品名字
$wpms="天宫蟠桃园的蟠桃，使用后可获得35万经验。（每日限用10次）";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==237){
$wpmz="【蟠桃】";//物品名字
$wpms="天宫蟠桃园的蟠桃，使用后可获得80万经验。（每日限用10次）";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==238){
$wpmz="【三千年蟠桃】";//物品名字
$wpms="王母娘娘蟠桃大会上用的蟠桃，使用可增加300万经验！（每日限用10次）";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$wpwng=1;//万能果价格
} elseif($npcc ==239){
$wpmz="【六千年蟠桃】";//物品名字
$wpms="王母娘娘蟠桃大会上用的蟠桃，使用可增加700万经验！（每日限用10次）";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$wpwng=2;//万能果价格


} elseif($npcc ==240){
$wpmz="【九千年蟠桃】";//物品名字
$wpms="王母娘娘蟠桃大会上用的蟠桃，使用可增加1500万经验！（每日限用10次）";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$wpwng=5;//万能果价格

} elseif($npcc ==241){
$wpmz="〖三千年蟠桃〗";//物品名字
$wpms="王母娘娘蟠桃大会上用的蟠桃，使用可增加300万经验！（每日限用10次）";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
	} elseif($npcc ==242){
$wpmz="〖六千年蟠桃〗";//物品名字
$wpms="王母娘娘蟠桃大会上用的蟠桃，使用可增加700万经验！（每日限用10次）";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

	} elseif($npcc ==243){
$wpmz="〖九千年蟠桃〗";//物品名字
$wpms="王母娘娘蟠桃大会上用的蟠桃，使用可增加1500万经验！（每日限用10次）";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类







	


} elseif($npcc ==244){
$wpmz="灵丹";//物品名字
$wpms="使用可恢复MP500点";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=5000;


} elseif($npcc ==245){
$wpmz="猕猴桃干";//物品名字
$wpms="使用恢复HP3690点！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=20000;

} elseif($npcc ==246){
$wpmz="云南白药";//物品名字
$wpms="使用恢复HP1000点！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=1000;

} elseif($npcc ==247){
$wpmz="清酒";//物品名字
$wpms="使用后恢复MP80点";//描述
$wpjd=2;//金豆价格
$wpjg=500;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=1000;

} elseif($npcc ==248){
$wpmz="饭团";//物品名字
$wpms="使用后可恢复HP100点";//描述
$wpjd=2;//金豆价格
$wpjg=500;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=1000;
} elseif($npcc ==249){
$wpmz="云南白药（大捆）";//物品名字
$wpms="使用可恢复10000体力！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=8000;
} elseif($npcc ==250){
$wpmz="云南白药（超大捆）";//物品名字
$wpms="使用可恢复80000体力！";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=50000;

} elseif($npcc ==252){
$wpmz="船票";//物品名字
$wpms="任务物品村长赠予的船票";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类
} elseif($npcc ==253){
$wpmz="桂花酒";//物品名字
$wpms="任务物品桂花酒";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类
} elseif($npcc ==256){
$wpmz="村长的信";//物品名字
$wpms="村长的介绍信";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

	} elseif($npcc ==257){
$wpmz="动物碎齿";//物品名字
$wpms="动物碎齿!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
	
} elseif($npcc ==258){
$wpmz="仙露";//物品名字
$wpms="任务物品请勿丢弃!";//描述
$wpjd=2;//金豆价格
$wpjg=1;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类	
} elseif($npcc ==260){
$wpmz="鹿茸（药引）";//物品名字
$wpms="任务物品请勿丢弃!";//描述
$wpjd=2;//金豆价格
$wpjg=1;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类	
} elseif($npcc ==262){
$wpmz="活鲤鱼";//物品名字
$wpms="任务物品请勿丢弃!";//描述
$wpjd=2;//金豆价格
$wpjg=1;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类	
} elseif($npcc ==263){
$wpmz="包袱";//物品名字
$wpms="任务物品请勿丢弃!";//描述
$wpjd=2;//金豆价格
$wpjg=1;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类	
} elseif($npcc ==264){
$wpmz="耳坠珠子";//物品名字
$wpms="任务物品请勿丢弃!";//描述
$wpjd=2;//金豆价格
$wpjg=1;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类	
} elseif($npcc ==265){
$wpmz="闪光磷粉";//物品名字
$wpms="任务物品请勿丢弃!";//描述
$wpjd=2;//金豆价格
$wpjg=1;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类	





	
} elseif($npcc ==266){
$wpmz="〖玄铁令〗";//物品名字
$wpms="用于建立国家的重要信物";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==276){
$wpmz="〖铁宝箱〗";//物品名字
$wpms="打开箱子可随机获得物品（需要万能钥匙开启）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类




} elseif($npcc ==278){
$wpmz="〖银宝箱〗";//物品名字
$wpms="打开箱子可随机获得物品（需要万能钥匙开启）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类
	
	
	









} else{





}


?>




