<?php


if($npcc ==601){

$wpmz="〖玄天残叶〗";//物品名字
$wpms="〖玄天残叶〗升级139坐骑仙兽必备材料";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==602){
$wpmz="〖神兽仙魄〗";//物品名字
$wpms="〖神兽仙魄〗升级139坐骑必备材料";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==603){
$wpmz="〖祥云残片〗";//物品名字
$wpms="〖祥云残片〗升级159坐骑仙兽必备材料";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==604){
$wpmz="〖大圣仙魄〗";//物品名字
$wpms="〖大圣仙魄〗升级159坐骑仙兽必备材料";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==605){
$wpmz="〖灵匣宝盒〗";//物品名字
$wpms="〖灵匣宝盒〗能开出许多意外的惊喜哟";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==606){
$wpmz="〖神匣宝盒〗";//物品名字
$wpms="〖神匣宝盒〗能开出许多意外的惊喜哟";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==607){
$wpmz="〖月光宝盒〗";//物品名字
$wpms="〖月光宝盒〗穿梭未来和过去，受到紫霞仙子的青睐后方才可开启";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类
} elseif($npcc ==608){
$wpmz="〖宝盒钥匙〗";//物品名字
$wpms="〖宝盒钥匙〗可以用来开启〖灵匣盒子〗和〖神匣盒子〗的钥匙";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==609){
$wpmz="〖金甲圣衣〗";//物品名字
$wpms="〖金甲圣衣〗可帮助紫霞仙找到至尊宝";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==610){
$wpmz="〖七彩祥云〗";//物品名字
$wpms="〖七彩祥云〗可帮助紫霞仙找到至尊宝";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==611){
$wpmz="〖紫霞眼泪〗";//物品名字
$wpms="〖紫霞眼泪〗可帮助紫霞仙找到至尊宝";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==612){
$wpmz="〖紧箍咒〗";//物品名字
$wpms="〖紧箍咒〗可帮助紫霞仙找到至尊宝";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==613){
$wpmz="〖至尊宝密令〗";//物品名字
$wpms="〖至尊宝密令〗可用于开启〖月光宝盒〗";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类




} elseif($npcc ==614){
$wpmz="〖麒麟圣祖〗（宠物蛋）";//物品名字
$wpms="〖麒麟圣祖〗绝版宠物（至尊宝紫霞仙子活动充值获得）";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==615){
$wpmz="〖麒麟圣祖〗（宠物蛋-万里挑一）";//物品名字
$wpms="被小轩GM调教好了的宠物，必出五级变异圣品〖麒麟圣祖〗绝版宠物（至尊宝紫霞仙子活动充值获得）";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==616){
$wpmz="〖齐天大圣〗（宠物蛋-万里挑一）";//物品名字
$wpms="被小轩GM调教好了的宠物，必出五级变异圣品〖齐天大圣〗绝版宠物（至尊宝紫霞仙子活动充值获得）";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==617){
$wpmz="〖练星符〗（白）";//物品名字
$wpms="宠物1至20星升星材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==618){
$wpmz="〖练星符〗（绿）";//物品名字
$wpms="宠物21至40星升星材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==619){
$wpmz="〖练星符〗（蓝）";//物品名字
$wpms="宠物41至60星升星材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==620){
$wpmz="〖练星符〗（紫）";//物品名字
$wpms="宠物61至80星升星材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==621){
$wpmz="〖练星符〗（完美の紫）";//物品名字
$wpms="宠物81至100星升星材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==622){
$wpmz="〖练星符〗（橙）";//物品名字
$wpms="宠物101至120星升星材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==623){
$wpmz="〖练星符〗（完美の橙）";//物品名字
$wpms="宠物121至150星升星材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==624){
$wpmz="〖许愿符〗";//物品名字
$wpms="每次许愿后必得用于许愿落空后兑换";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==625){
$wpmz="〖1亿修炼经验丹〗";//物品名字
$wpms="使用后获得一亿修炼经验";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=160;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==626){
$wpmz="〖5亿修炼经验丹〗";//物品名字
$wpms="使用后获得五亿修炼经验";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=160;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==627){
$wpmz="〖10亿修炼经验丹〗";//物品名字
$wpms="使用后获得十亿修炼经验";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=160;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==628){
$wpmz="〖金宝箱〗";//物品名字
$wpms="打开箱子可随机获得物品（需要万能钥匙开启）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==629){
$wpmz="〖七夕宝箱〗";//物品名字
$wpms="七夕节日获得可开出大量宝贝";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==630){
$wpmz="【甜】";//物品名字
$wpms="传说集齐甜蜜七夕四字可获取七夕宝箱";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类



} elseif($npcc ==631){
$wpmz="【蜜】";//物品名字
$wpms="传说集齐甜蜜七夕四字可获取七夕宝箱";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==632){
$wpmz="【七】";//物品名字
$wpms="传说集齐甜蜜七夕四字可获取七夕宝箱";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==633){
$wpmz="【夕】";//物品名字
$wpms="传说集齐甜蜜七夕四字可获取七夕宝箱";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类




} elseif($npcc ==634){
$wpmz="〖鸳鸯帕〗";//物品名字
$wpms="〖鸳鸯帕〗可用于兑换典藏婚饰品";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==635){
$wpmz="〖姻缘草〗";//物品名字
$wpms="〖姻缘草〗可用于兑换典藏婚饰品";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==636){
$wpmz="〖银心铃〗";//物品名字
$wpms="〖姻缘草〗可用于兑换典藏婚饰品";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==637){
$wpmz="〖噬魂锻造图纸〗";//物品名字
$wpms="用于打造噬魂装备的图纸";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==638){
$wpmz="【七夕令】";//物品名字
$wpms="用于179典藏升级到199典藏";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==639){
$wpmz="〖情圣〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==640){
$wpmz="〖万人迷〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==641){
$wpmz="〖天作之合〗";//物品名字
$wpms="使用后可以永久增加HP80000，攻击80000，防御80000，魔攻80000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==642){
$wpmz="〖爱你一万年〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==643){
$wpmz="〖真爱无敌〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==644){
$wpmz="〖绝世情圣〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==645){
$wpmz="〖天下最倾城〗";//物品名字
$wpms="使用后可以永久增加HP110000，攻击110000，防御110000，魔攻110000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==646){
$wpmz="〖天下最风流〗";//物品名字
$wpms="使用后可以永久增加HP110000，攻击110000，防御110000，魔攻110000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==647){
$wpmz="〖鹊桥仙子〗";//物品名字
$wpms="使用后可以永久增加HP66666，攻击66666，防御66666，魔攻66666";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==648){
$wpmz="〖谦谦公子〗";//物品名字
$wpms="使用后可以永久增加HP66666，攻击66666，防御66666，魔攻66666";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==649){
$wpmz="〖娇美宠儿〗";//物品名字
$wpms="使用后可以永久增加HP77777，攻击77777，防御77777，魔攻77777";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==650){
$wpmz="〖柔情郎君〗";//物品名字
$wpms="使用后可以永久增加HP77777，攻击77777，防御77777，魔攻77777";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==651){
$wpmz="〖传世战神〗";//物品名字
$wpms="使用后可以永久增加HP150000，攻击150000，防御150000，魔攻150000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==652){
$wpmz="〖天下第一〗";//物品名字
$wpms="使用后可以永久增加HP160000，攻击160000，防御160000，魔攻160000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==653){
$wpmz="〖灿若星斗〗";//物品名字
$wpms="使用后可以永久增加HP160000，攻击160000，防御160000，魔攻160000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==654){
$wpmz="〖富甲天下〗";//物品名字
$wpms="使用后可以永久增加HP180000，攻击180000，防御180000，魔攻180000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==655){
$wpmz="〖登峰造极〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==656){
$wpmz="【鹊翎】";//物品名字
$wpms="【鹊翎】每日七夕天衣阁学徒苏语迟获取凑齐十个可兑换称号一个";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==657){
$wpmz="〖七夕万能字〗";//物品名字
$wpms="〖七夕万能字〗用于兑换各种七夕字体";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==658){
$wpmz="〖超级七夕宝箱〗";//物品名字
$wpms="能够开出〖七夕宝箱〗所得之物的10倍";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类




} elseif($npcc ==659){
$wpmz="〖碎银块〗";//物品名字
$wpms="价值连城的碎银块（可兑换1亿银两）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==660){
$wpmz="〖银块〗";//物品名字
$wpms="价值连城的银块（可兑换5亿银两）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==661){
$wpmz="〖银锭〗";//物品名字
$wpms="价值连城的银锭（可兑换10亿银两）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==662){
$wpmz="〖金块〗";//物品名字
$wpms="价值连城的金块（可兑换50亿银两）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==663){
$wpmz="〖金锭〗";//物品名字
$wpms="价值连城的金锭（可兑换100亿银两）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==664){
$wpmz="【善果】";//物品名字
$wpms="将【善果】交给天牢牢头可以助你减轻的罪孽（天牢牢头购买获得）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==665){
$wpmz="〖免罪金牌〗";//物品名字
$wpms="将〖免罪金牌〗交给天牢牢头可以助你减轻的罪孽（天牢牢头购买获得）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==666){
$wpmz="〖西游新秀〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==667){
$wpmz="〖西游漫记〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==668){
$wpmz="〖玫瑰情人〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==669){
$wpmz="【科举答题】";//物品名字
$wpms="使用后可以永久增加HP60000，攻击60000，防御60000，魔攻60000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==670){
$wpmz="【举人】";//物品名字
$wpms="使用后可以永久增加HP70000，攻击50000，防御50000，魔攻50000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==671){
$wpmz="【榜眼】";//物品名字
$wpms="使用后可以永久增加HP70000，攻击50000，防御50000，魔攻50000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==672){
$wpmz="〖领跑西游〗";//物品名字
$wpms="使用后可以永久增加HP70000，攻击70000，防御70000，魔攻70000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==673){
$wpmz="〖超凡入圣〗";//物品名字
$wpms="使用后可以永久增加HP150000，攻击100000，防御100000，魔攻100000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==674){
$wpmz="〖震古烁今〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击120000，防御120000，魔攻120000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==675){
$wpmz="〖炉火纯青〗";//物品名字
$wpms="使用后可以永久增加HP250000，攻击120000，防御120000，魔攻120000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==676){
$wpmz="〖名扬四海〗";//物品名字
$wpms="使用后可以永久增加HP300000，攻击150000，防御150000，魔攻150000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==677){
$wpmz="〖进击の一骑绝尘〗";//物品名字
$wpms="使用后可以永久增加HP300000，攻击180000，防御180000，魔攻180000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==678){
$wpmz="〖进击の冠绝天下〗";//物品名字
$wpms="使用后可以永久增加HP350000，攻击200000，防御200000，魔攻200000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==679){
$wpmz="〖进击の笑傲苍穹〗";//物品名字
$wpms="使用后可以永久增加HP500000，攻击300000，防御300000，魔攻300000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==680){
$wpmz="【铅球】";//物品名字
$wpms="体育老师的【铅球】开学活动获得";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==681){
$wpmz="【奖状】";//物品名字
$wpms="〖活动〗脑筋急转弯老师开学活动获得";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==682){
$wpmz="〖开学礼包〗";//物品名字
$wpms="〖开学礼包〗有小概率的范围开出称号〖西游漫记〗〖玫瑰情人〗〖领跑西游〗";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==683){
$wpmz="〖开学大礼包〗";//物品名字
$wpms="〖开学大礼包〗有较高概率的范围开出称号〖西游漫记〗〖玫瑰情人〗〖领跑西游〗";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==684){
$wpmz="【粉笔】";//物品名字
$wpms="开学活动获得（用于兑换各类物品）";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类



} elseif($npcc ==685){
$wpmz="【橡皮擦】";//物品名字
$wpms="开学活动获得（用于兑换各类物品）";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类



} elseif($npcc ==686){
$wpmz="【铅笔】";//物品名字
$wpms="开学活动获得（用于兑换各类物品）";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==687){
$wpmz="【墨水】";//物品名字
$wpms="开学活动获得（用于兑换各类物品）";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==688){
$wpmz="〖女神同桌〗";//物品名字
$wpms="开学活动获得（用于兑换各类物品）";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==689){
$wpmz="〖课本〗";//物品名字
$wpms="开学活动获得（可交给找校长获取学分）";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==690){
$wpmz="〖帝王之心〗";//物品名字
$wpms="王者风范帝王专属（打造帝王套装材料）";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==691){
$wpmz="〖帝王之血〗";//物品名字
$wpms="王者风范帝王专属（打造帝王套装材料）";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==692){
$wpmz="〖帝王之魂〗";//物品名字
$wpms="王者风范帝王专属（打造帝王套装材料）";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==693){
$wpmz="【九转仙丹】";//物品名字
$wpms="服用后可解封199等级";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==694){
$wpmz="〖神仙果〗";//物品名字
$wpms="通天层飞仙层或者堕魔层掉落（可在天蓬元帅处兑换金豆）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==695){
$wpmz="〖BOSS如意令〗";//物品名字
$wpms="凑齐相对应的〖BOSS如意令〗可兑换称号";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==696){
$wpmz="〖BOSS杀手〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==697){
$wpmz="〖猎魔之王〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==698){
$wpmz="〖不差钱〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==699){
$wpmz="〖我是大姐〗";//物品名字
$wpms="使用后可以永久增加HP120000，攻击120000，防御120000，魔攻120000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==700){
$wpmz="〖我是二哥〗";//物品名字
$wpms="使用后可以永久增加HP120000，攻击120000，防御120000，魔攻120000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类





} else{





}

?>




