<?php

if($npcc ==302){
$wpmz="〖打孔器〗";//物品名字
$wpms="此物品可为装备打造第一个孔（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=1;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==303){
$wpmz="〖普通打孔器〗";//物品名字
$wpms="此物品可为装备打造第二个孔（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==304){
$wpmz="〖高级打孔器〗";//物品名字
$wpms="此物品可为装备打造第三个孔（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=3;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==305){
$wpmz="〖强化打孔器〗";//物品名字
$wpms="此物品可为装备打造第四个孔（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=5;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==306){
$wpmz="〖究极打孔器〗";//物品名字
$wpms="此物品可为装备打造第五个孔（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=10;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类




} elseif($npcc ==307){
$wpmz="大幸运草";//物品名字
$wpms="可以为装备打孔或者装备升星提示10%的成功率，锻造装备必备！（直接在身上装备升级消耗）";//描述
$wpjd=3;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==308){
$wpmz="〖铁魂〗";//物品名字
$wpms="升星装备的材料之铁魂（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==309){
$wpmz="〖铜魂〗";//物品名字
$wpms="升星装备的材料之铜魂（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==310){
$wpmz="〖银魂〗";//物品名字
$wpms="升星装备的材料之银魂（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==311){
$wpmz="〖金魂〗";//物品名字
$wpms="升星装备的材料之铁魂（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==312){
$wpmz="〖钻魂〗";//物品名字
$wpms="升星装备的材料之钻魂（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==313){
$wpmz="〖陨魂〗";//物品名字
$wpms="升星装备的材料之铁魂（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==314){
$wpmz="〖铁星升星符〗";//物品名字
$wpms="拥有这强大的力量的符咒，可将百分之百将铁星的装备升星成功！（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==315){
$wpmz="〖铜星升星符〗";//物品名字
$wpms="拥有这强大的力量的符咒，可将百分之百将铜星的装备升星成功！（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=5;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==316){
$wpmz="〖银星升星符〗";//物品名字
$wpms="拥有这强大的力量的符咒，可将百分之百将银星的装备升星成功！（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=10;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==317){
$wpmz="〖金星升星符〗";//物品名字
$wpms="拥有这强大的力量的符咒，可将百分之百将金星的装备升星成功！（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=20;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==318){
$wpmz="〖钻星升星符〗";//物品名字
$wpms="拥有这强大的力量的符咒，可将百分之百将钻星的装备升星成功！（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=60;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==319){
$wpmz="〖陨星升星符〗";//物品名字
$wpms="拥有这强大的力量的符咒，可将百分之百将陨星的装备升星成功！（可在长安城兵器铺找装备锻造商进行使用）";//描述
$wpjd=200;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==320){
$wpmz="【幻想武器包】";//物品名字
$wpms="打开可获得相应职业绝版武器一把！";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==321){
$wpmz="【幻想防具包】";//物品名字
$wpms="打开可获得相应职业绝版衣服头盔鞋子！";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==322){
$wpmz="【幻想首饰包】";//物品名字
$wpms="打开可获得相应职业绝版项链和手镯！";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==323){
$wpmz="〖雷皇套装〗";//物品名字
$wpms="打开可获得雷皇装备一套";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==324){
$wpmz="〖小巨灵套装〗";//物品名字
$wpms="打开可获得小巨灵装备一套";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==325){
$wpmz="〖玄冰套装〗";//物品名字
$wpms="打开可获得玄冰装备一套";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==326){
$wpmz="〖仙魂套装〗";//物品名字
$wpms="打开可获得仙魂装备一套";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

	
	} elseif($npcc ==331){
$wpmz="〖百年魔珠〗";//物品名字
$wpms="妖魔修炼百年的魔珠";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

		} elseif($npcc ==327){
	
	$wpmz="螃蟹肉";//物品名字
$wpms="美味可口的螃蟹肉";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==328){
$wpmz="海贼头巾";//物品名字
$wpms="看上去有点破旧的头巾";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==329){
$wpmz="鳅鱼皮";//物品名字
$wpms="鳅鱼精身上的皮甲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==330){
$wpmz="赤背虾皮";//物品名字
$wpms="赤背虾精身上的皮甲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==331){
$wpmz="〖百年魔珠〗";//物品名字
$wpms="妖魔修炼百年的魔珠";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==332){
$wpmz="皮皮虾";//物品名字
$wpms="虾兵身上的宝贝";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==333){
$wpmz="大炸蟹";//物品名字
$wpms="看上去美味可口";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==334){
$wpmz="巨鳌肉";//物品名字
$wpms="看上去美味可口";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==335){
$wpmz="鲨鱼肉";//物品名字
$wpms="看上去美味可口";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==336){
$wpmz="桂花枝";//物品名字
$wpms="桂花树上的树枝";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==337){
$wpmz="杏花果";//物品名字
$wpms="杏花树上的果实";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==338){
$wpmz="狼皮";//物品名字
$wpms="老狼的皮毛";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==339){
$wpmz="西瓜籽";//物品名字
$wpms="西瓜精掉落的西瓜籽";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==340){
$wpmz="竹子";//物品名字
$wpms="细细长长的竹子";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==341){
$wpmz="蛇胆";//物品名字
$wpms="青蛇怪的蛇胆";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==342){
$wpmz="黄雀羽毛";//物品名字
$wpms="黄雀的羽毛";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==343){
$wpmz="磷粉";//物品名字
$wpms="闪闪发光的磷粉";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==344){
$wpmz="兔毛";//物品名字
$wpms="野兔的毛";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==345){
$wpmz="兔皮";//物品名字
$wpms="野兔的皮";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==346){
$wpmz="野狼肉";//物品名字
$wpms="野狼的肉";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==347){
$wpmz="山猪皮";//物品名字
$wpms="山猪的皮甲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==348){
$wpmz="灯芯";//物品名字
$wpms="快要熄灭的灯芯";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==349){
$wpmz="扫帚";//物品名字
$wpms="仿佛能看的它过去的凶残";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==350){
$wpmz="灯笼";//物品名字
$wpms="红红的大灯笼";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==351){
$wpmz="蜡烛";//物品名字
$wpms="好像快要熄灭了";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==352){
$wpmz="马刀兵俑泥人";//物品名字
$wpms="马刀兵俑的原型";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==353){
$wpmz="长矛兵俑泥人";//物品名字
$wpms="长矛兵俑的原型";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==354){
$wpmz="宣纸";//物品名字
$wpms="普普通通的宣纸";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==355){
$wpmz="油墨";//物品名字
$wpms="黑死的油墨";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==356){
$wpmz="银色星辰";//物品名字
$wpms="天兵银色星辰";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==357){
$wpmz="金色星辰";//物品名字
$wpms="天将银色星辰";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==358){
$wpmz="花粉";//物品名字
$wpms="仙灵蝴蝶的花粉";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==359){
$wpmz="游荡魂魄";//物品名字
$wpms="游荡妖魂最后的一丝魂魄";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==360){
$wpmz="蟠璃";//物品名字
$wpms="蟠璃材料";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==361){
$wpmz="蟠龙";//物品名字
$wpms="蟠龙材料";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==362){
$wpmz="花斑虎皮";//物品名字
$wpms="花斑虎的皮甲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==363){
$wpmz="鹿皮";//物品名字
$wpms="野鹿的皮甲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==364){
$wpmz="鹿角";//物品名字
$wpms="野鹿的角";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==365){
$wpmz="熊胆";//物品名字
$wpms="野熊的熊胆";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==366){
$wpmz="熊掌";//物品名字
$wpms="野熊的熊掌";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==367){
$wpmz="山妖皮";//物品名字
$wpms="野山妖皮";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类




} elseif($npcc ==368){
$wpmz="大头骨";//物品名字
$wpms="骷髅怪的头颅";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==369){
$wpmz="腐尸皮";//物品名字
$wpms="腐尸怪的皮甲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==370){
$wpmz="僵尸皮";//物品名字
$wpms="僵尸怪的皮甲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==371){
$wpmz="豹皮";//物品名字
$wpms="豹妖的皮甲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==372){
$wpmz="猫皮";//物品名字
$wpms="猫妖的皮甲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==373){
$wpmz="羚羊角";//物品名字
$wpms="羚羊怪的角";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==374){
$wpmz="花鹿角";//物品名字
$wpms="花鹿怪的角";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==375){
$wpmz="狐狸皮";//物品名字
$wpms="狐狸精的皮甲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==376){
$wpmz="野獾皮";//物品名字
$wpms="野獾精的皮甲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==378){
$wpmz="桃皮";//物品名字
$wpms="桃妖的树皮";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==379){
$wpmz="雪球";//物品名字
$wpms="圆圆的雪球";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==380){
$wpmz="雪莲";//物品名字
$wpms="雪莲精的雪莲";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==381){
$wpmz="雪豹肉";//物品名字
$wpms="雪豹的肉";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==382){
$wpmz="雪狼肉";//物品名字
$wpms="雪狼的肉";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==383){
$wpmz="紫竹根";//物品名字
$wpms="紫竹战士的根";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==384){
$wpmz="孤魂魄";//物品名字
$wpms="孤魂的魂魄";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==385){
$wpmz="厉鬼魂";//物品名字
$wpms="厉鬼的魂魄";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==386){
$wpmz="佛珠";//物品名字
$wpms="冰晶塔掉落的佛珠";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==387){
$wpmz="牛角";//物品名字
$wpms="一个普通的牛角";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==389){
$wpmz="芭蕉";//物品名字
$wpms="芭蕉怪身上的芭蕉";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==390){
$wpmz="蜘蛛网";//物品名字
$wpms="人面蛛妖的蜘蛛网";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==391){
$wpmz="麒麟肉";//物品名字
$wpms="麒麟的肉";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==392){
$wpmz="惨白树皮";//物品名字
$wpms="惨白树精的皮";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==393){
$wpmz="疯狂树皮";//物品名字
$wpms="疯狂树精的皮";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==394){
$wpmz="【英雄牌】";//物品名字
$wpms="通过完成各大副本所得的奖励，可在长安城英雄大厅兑换奖励";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==395){
$wpmz="〖储物袋〗";//物品名字
$wpms="大小遗迹储物容量增加5,最多扩容15,在遗迹内使用";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==396){
$wpmz="〖豪宅优惠券〗";//物品名字
$wpms="使用金豆在开封广场购买房子时会获得一定的优惠";//描述
$wpjd=2;//金
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==397){

$wpmz="〖求婚玫瑰〗";//物品名字
$wpms="赠人玫瑰收留余香，在月老处使用，可向自己心仪的玩家进行求婚";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==398){

$wpmz="〖小智慧果〗";//物品名字
$wpms="使用后可获得60分钟的杀怪双倍经验";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==399){

$wpmz="〖大智慧果〗";//物品名字
$wpms="使用后可获得60分钟的杀怪四倍经验";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==400){

$wpmz="〖背包扩容卷〗";//物品名字
$wpms="使用后可增加背包容量1000";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

	
	









} else{





}

?>




