<?php


if($npcc ==401){

$wpmz="〖万能钥匙〗";//物品名字
$wpms="用于开启铜铁银金宝箱的钥匙";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类




} elseif($npcc ==402){

$wpmz="【内测福利】";//物品名字
$wpms="GM精心为大家准备的的小小礼物";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==403){

$wpmz="〖元旦宝箱〗";//物品名字
$wpms="元旦节日宝箱(传说能开出各种宝贝绝对超值)";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==404){

$wpmz="【元】";//物品名字
$wpms="元旦节日-【元】字(凑齐元旦快乐可以在元旦大使那里兑换〖元旦宝箱〗哦)";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==405){

$wpmz="【旦】";//物品名字
$wpms="元旦节日-【旦】字(凑齐元旦快乐可以在元旦大使那里兑换〖元旦宝箱〗哦)";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==406){
$wpmz="【快】";//物品名字
$wpms="元旦节日-【快】字(凑齐元旦快乐可以在元旦大使那里兑换〖元旦宝箱〗哦)";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==407){
$wpmz="【乐】";//物品名字
$wpms="元旦节日-【乐】字(凑齐元旦快乐可以在元旦大使那里兑换〖元旦宝箱〗哦)";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==408){
$wpmz="〖元旦节日勋章〗";//物品名字
$wpms="〖元旦节日勋章〗(可以在元旦大使那里兑换【元】【旦】【快】【乐】任意一个)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==409){
$wpmz="【副本重置令】";//物品名字
$wpms="vip每日的专属令牌用于各大副本重置无须再等待";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类




} elseif($npcc ==410){
$wpmz="【GM的小内裤】";//物品名字
$wpms="【GM的小内裤】(WHAT!?我没有看错吧?这居然GM的内裤到被爆出来了,GM太没节操了,暖冬活动限定可用于兑换积分,当然也可留做当纪念)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==411){
$wpmz="〖暖〗";//物品名字
$wpms="暖冬活动限定-〖暖〗字(凑齐-暖冬祝福每样五个可兑换暖冬积分参与暖冬大比拼)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==412){
$wpmz="〖冬〗";//物品名字
$wpms="暖冬活动限定-〖冬〗字(凑齐-暖冬祝福每样五个可兑换暖冬积分参与暖冬大比拼)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==413){
$wpmz="〖祝〗";//物品名字
$wpms="暖冬活动限定-〖祝〗字(凑齐-暖冬祝福每样五个可兑换暖冬积分参与暖冬大比拼)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==414){
$wpmz="〖福〗";//物品名字
$wpms="暖冬活动限定-〖福〗字(凑齐-暖冬祝福每样五个可兑换暖冬积分参与暖冬大比拼)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==415){
$wpmz="【五角碎片】";//物品名字
$wpms="【五角碎片】(GM每个月总有那么一次的大放血还不死的神奇生物凑齐20个可以兑换【五角兑换卷】也可以兑换成暖冬积分)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==416){
$wpmz="【一元碎片】";//物品名字
$wpms="【一元碎片】(GM每个月总有那么一次的大放血还不死的神奇生物凑齐20个可以兑换【一元兑换卷】也可以兑换成暖冬积分)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==417){
$wpmz="【两元碎片】";//物品名字
$wpms="【两元碎片】(GM每个月总有那么一次的大放血还不死的神奇生物凑齐20个可以兑换【两元兑换卷】也可以兑换成暖冬积分)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==418){
$wpmz="【五角兑换卷】";//物品名字
$wpms="【五角兑换卷】(GM每个月总有那么一次的大放血还不死的神奇生物快去放GM的血吧)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==419){
$wpmz="【一元兑换卷】";//物品名字
$wpms="【一元兑换卷】(GM每个月总有那么一次的大放血还不死的神奇生物快去放GM的血吧)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==420){
$wpmz="【两元兑换卷】";//物品名字
$wpms="【两元兑换卷】(GM每个月总有那么一次的大放血还不死的神奇生物快去放GM的血吧)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==421){
$wpmz="〖暖冬宝箱〗";//物品名字
$wpms="〖暖冬宝箱〗(在寒冷的冬季不再冷,为大家送上暖冬宝箱)";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类



} elseif($npcc ==422){
$wpmz="〖1千法宝经验卷轴〗";//物品名字
$wpms="使用后可获得1000法宝经验";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=40;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类
$wpwng=5;//万能果价格

} elseif($npcc ==423){
$wpmz="〖1万法宝经验卷轴〗";//物品名字
$wpms="使用后可获得1万法宝经验";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=40;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类
$wpwng=5;//万能果价格
} elseif($npcc ==424){
$wpmz="〖10万法宝经验卷轴〗";//物品名字
$wpms="使用后可获得10万法宝经验";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=40;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类
$wpwng=50;//万能果价格
} elseif($npcc ==425){
$wpmz="〖100万法宝经验卷轴〗";//物品名字
$wpms="使用后可获得100万法宝经验";//描述
$wpjd=8;//金豆价格
$wpjg=1000;//价格
$wpdj=40;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类


} elseif($npcc ==426){
$wpmz="〖魔化石〗";//物品名字
$wpms="用于坐骑升级打造的必备物品";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==427){
$wpmz="〖1万西游声望卷轴〗";//物品名字
$wpms="使用后可获得1万西声望";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=1;//分类


} elseif($npcc ==428){
$wpmz="〖风度偏偏〗";//物品名字
$wpms="使用后可以永久增加HP24000，攻击45000，防御25000，魔攻45000";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==429){
$wpmz="〖至尊战神〗";//物品名字
$wpms="使用后可以永久增加HP14000，攻击35000，防御15000，魔攻15000";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==430){
$wpmz="〖谁与争峰〗";//物品名字
$wpms="使用后可以永久增加HP14000，攻击15000，防御15000，魔攻15000";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==431){
$wpmz="〖永不放弃〗";//物品名字
$wpms="使用后可以永久增加HP24000，攻击25000，防御25000，魔攻25000";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==432){
$wpmz="〖威震幻影〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击45000，防御45000，魔攻45000";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==433){
$wpmz="【新】";//物品名字
$wpms="暖冬活动限定-【新】字(凑齐-新年快乐可在玄武大街找新年大使兑换新年宝箱)";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==434){
$wpmz="【年】";//物品名字
$wpms="暖冬活动限定-【年】字(凑齐-新年快乐可在玄武大街找新年大使兑换新年宝箱)";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==435){
$wpmz="【快】";//物品名字
$wpms="暖冬活动限定-【快】字(凑齐-新年快乐可在玄武大街找新年大使兑换新年宝箱)";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==436){
$wpmz="【乐】";//物品名字
$wpms="暖冬活动限定-【乐】字(凑齐-新年快乐可在玄武大街找新年大使兑换新年宝箱)";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==437){
$wpmz="【新年宝箱】";//物品名字
$wpms="携手共度2018年【新年宝箱】(可开出大量属性丹药)";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=8;//分类



} elseif($npcc ==438){
$wpmz="【新年卡片】";//物品名字
$wpms="携手共度2018年【新年卡片】(可开使用此卡片兑换超值的2018新年称号)";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==439){
$wpmz="【新年攻击丹】";//物品名字
$wpms="携手共度2018年【新年攻击丹】(增加攻击300点,限服100个)";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==440){
$wpmz="【新年魔攻丹】";//物品名字
$wpms="携手共度2018年【新年魔攻丹】(增加魔攻300点,限服100个)";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==441){
$wpmz="【新年防御丹】";//物品名字
$wpms="携手共度2018年【新年防御丹】(增加防御180点,限服100个)";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==442){
$wpmz="【新年气血丹】";//物品名字
$wpms="携手共度2018年【新年气血丹】(增加血量888点,限服100个)";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==443){
$wpmz="【恶魔广场门票】";//物品名字
$wpms="传送至恶魔广场的门票【恶魔广场门票】";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=1;//分类

} elseif($npcc ==444){
$wpmz="【年糕】";//物品名字
$wpms="携手共度2018年【年糕】(用五个年糕在十字街头喂养每天10:00和20:00出现的年兽)";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==445){
$wpmz="〖2018新年狂人〗";//物品名字
$wpms="使用后可以永久增加HP88888，攻击50000，防御40000，魔攻50000";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==446){
$wpmz="〖2018新年红包〗";//物品名字
$wpms="使用后可以开出1-10元的红包可找母鸡妈妈兑换红包";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==447){
$wpmz="〖2018一元红包〗";//物品名字
$wpms="可找母鸡妈妈兑换红包";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==448){
$wpmz="〖2018两元红包〗";//物品名字
$wpms="可找母鸡妈妈兑换红包";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==449){
$wpmz="〖2018三元红包〗";//物品名字
$wpms="可找母鸡妈妈兑换红包";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==450){
$wpmz="〖2018五元红包〗";//物品名字
$wpms="可找母鸡妈妈兑换红包";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==451){
$wpmz="〖2018十元红包〗";//物品名字
$wpms="可找母鸡妈妈兑换红包";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==452){
$wpmz="【恶魔血】";//物品名字
$wpms="恶魔广场掉落（可在恶魔广场兑换恶魔声望）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==453){
$wpmz="〖财宝箱〗";//物品名字
$wpms="装有满满的2000万银两，瞬间成为高富帅，迎娶白富美";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==454){
$wpmz="〖双倍掉宝符〗";//物品名字
$wpms="使用后获得10分钟双倍美滋滋的掉率（同类祝福不叠加按最好的掉宝算）";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==455){
$wpmz="〖四倍掉宝符〗";//物品名字
$wpms="使用后获得10分钟四倍美滋滋的掉率（同类祝福不叠加按最好的掉宝算）";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==456){
$wpmz="〖八倍掉宝符〗";//物品名字
$wpms="使用后获得10分钟八倍美滋滋的掉率（同类祝福不叠加按最好的掉宝算）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==457){
$wpmz="〖极品6位ID号（111111）靓号卡〗";//物品名字
$wpms="使用后ID变更为111111，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==458){
$wpmz="〖极品6位ID号（222222）靓号卡〗";//物品名字
$wpms="使用后ID变更为222222，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==459){
$wpmz="〖极品6位ID号（333333）靓号卡〗";//物品名字
$wpms="使用后ID变更为333333，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==460){
$wpmz="〖极品6位ID号（444444）靓号卡〗";//物品名字
$wpms="使用后ID变更为444444，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==461){
$wpmz="〖极品6位ID号（555555）靓号卡〗";//物品名字
$wpms="使用后ID变更为555555，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==462){
$wpmz="〖极品6位ID号（666666）靓号卡〗";//物品名字
$wpms="使用后ID变更为666666，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==463){
$wpmz="〖极品6位ID号（777777）靓号卡〗";//物品名字
$wpms="使用后ID变更为777777，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==464){
$wpmz="〖极品6位ID号（888888）靓号卡〗";//物品名字
$wpms="使用后ID变更为888888，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==465){
$wpmz="〖极品6位ID号（999999）靓号卡〗";//物品名字
$wpms="使用后ID变更为999999，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==466){
$wpmz="〖极品6位ID号（123456）靓号卡〗";//物品名字
$wpms="使用后ID变更为123456，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==467){
$wpmz="〖极品6位ID号（654321）靓号卡〗";//物品名字
$wpms="使用后ID变更为654321，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==468){
$wpmz="〖极品6位ID号（520520）靓号卡〗";//物品名字
$wpms="使用后ID变更为520520，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==469){
$wpmz="〖极品6位ID号（122222）靓号卡〗";//物品名字
$wpms="使用后ID变更为122222，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==470){
$wpmz="〖极品6位ID号（133333）靓号卡〗";//物品名字
$wpms="使用后ID变更为133333，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==471){
$wpmz="〖极品6位ID号（144444）靓号卡〗";//物品名字
$wpms="使用后ID变更为144444，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==472){
$wpmz="〖极品6位ID号（155555）靓号卡〗";//物品名字
$wpms="使用后ID变更为155555，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==473){
$wpmz="〖极品6位ID号（166666）靓号卡〗";//物品名字
$wpms="使用后ID变更为166666，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==474){
$wpmz="〖极品6位ID号（177777）靓号卡〗";//物品名字
$wpms="使用后ID变更为177777，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==475){
$wpmz="〖极品6位ID号（188888）靓号卡〗";//物品名字
$wpms="使用后ID变更为188888，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==476){
$wpmz="〖极品6位ID号（199999）靓号卡〗";//物品名字
$wpms="使用后ID变更为199999，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==487){
$wpmz="〖大号财宝箱〗";//物品名字
$wpms="装有满满的2亿银两，瞬间成为高富帅，迎娶白富美";//描述
$wpjd=45;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==488){
$wpmz="【宠物岛门票】";//物品名字
$wpms="通往宠物岛的门票（需要前往天宫找宠物岛传送员使用）";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=1;//分类

} elseif($npcc ==489){
$wpmz="【西游宣传礼包】";//物品名字
$wpms="每日推广游戏宣传获得";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==490){
$wpmz="【西游邀请礼包】";//物品名字
$wpms="每次邀请一人即可获得该礼包";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==491){
$wpmz="【西游新人礼包】";//物品名字
$wpms="仅限制于被邀请新来的玩家福利，永久只发放一次";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==492){
$wpmz="【公测礼包】";//物品名字
$wpms="所有公测玩家的福利，绝对超值";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==493){
$wpmz="〖瞌睡虫〗（典藏版）";//物品名字
$wpms="〖瞌睡虫〗宠物一只充值消费获得，绝对超值";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==494){
$wpmz="〖荣誉宝石包〗（2个）";//物品名字
$wpms="打开后获得〖荣誉宝石〗x2";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==494){
$wpmz="〖荣誉宝石包〗（5个）";//物品名字
$wpms="打开后获得〖荣誉宝石〗x5";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==495){
$wpmz="〖荣誉宝石包〗（15个）";//物品名字
$wpms="打开后获得〖荣誉宝石〗x5";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==496){
$wpmz="〖荣誉宝石包〗（15个）";//物品名字
$wpms="打开后获得〖荣誉宝石〗x5";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==497){
$wpmz="〖荣誉宝石包〗（40个）";//物品名字
$wpms="打开后获得〖荣誉宝石〗x40";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==498){
$wpmz="〖荣誉宝石包〗（100个）";//物品名字
$wpms="打开后获得〖荣誉宝石〗x100";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==499){
$wpmz="〖冲榜助力包〗";//物品名字
$wpms="打开后获得〖钻魂〗x100，外加赠送大幸运草一根";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==500){
$wpmz="【才子印记】";//物品名字
$wpms="【才子印记】暑期假日清凉一夏获得";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类





} else{





}

?>




