<?php


if($npcc ==901){


$wpmz="〖巧克力酱〗";//物品名字
$wpms="制作糕点的原材料";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==902){
$wpmz="〖可可粉〗";//物品名字
$wpms="制作糕点的原材料";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==903){
$wpmz="〖力娇酒〗";//物品名字
$wpms="制作糕点的原材料";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==904){
$wpmz="〖原料购物票〗";//物品名字
$wpms="可使用〖原料购物票〗购买你需要的原材料";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==905){
$wpmz="〖生日甜品礼盒〗";//物品名字
$wpms="可使用半，周，年，庆，典，四字兑换";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类



} elseif($npcc ==906){
$wpmz="〖半周岁10元消费礼宝箱〗";//物品名字
$wpms="在2018.10.10-2018.10.16回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==907){
$wpmz="〖半周岁20元消费礼宝箱〗";//物品名字
$wpms="在2018.10.10-2018.10.16回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==908){
$wpmz="〖半周岁50元消费礼宝箱〗";//物品名字
$wpms="在2018.10.10-2018.10.16回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==909){
$wpmz="〖半周岁100元消费礼宝箱〗";//物品名字
$wpms="在2018.10.10-2018.10.16回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==910){
$wpmz="〖半周岁200元消费礼宝箱〗";//物品名字
$wpms="在2018.10.10-2018.10.16回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==911){
$wpmz="〖半周岁500元消费礼宝箱〗";//物品名字
$wpms="在2018.10.10-2018.10.16回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==912){
$wpmz="〖半周岁1000元消费礼宝箱〗";//物品名字
$wpms="在2018.10.10-2018.10.16回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==913){
$wpmz="〖半周岁2000元消费礼宝箱〗";//物品名字
$wpms="在2018.10.10-2018.10.16回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==914){
$wpmz="〖绝世盟主〗（纪念版）";//物品名字
$wpms="〖绝世盟主〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP1000000，攻击1000000，防御1000000，魔攻1000000";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==915){
$wpmz="〖绝世仙盟〗（纪念版）";//物品名字
$wpms="〖绝世仙盟〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP800000，攻击800000，防御800000，魔攻800000";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==916){
$wpmz="〖君临王城の至尊王城〗（纪念版）";//物品名字
$wpms="〖君临王城の至尊王城〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP500000，攻击500000，防御500000，魔攻500000";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==917){
$wpmz="〖八荒雷动の傲视群雄〗（纪念版）";//物品名字
$wpms="〖八荒雷动の傲视群雄〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP500000，攻击500000，防御500000，魔攻500000";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==918){
$wpmz="〖天下无双の群雄霸主〗（纪念版）";//物品名字
$wpms="〖天下无双の群雄霸主〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP400000，攻击400000，防御400000，魔攻400000";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类




} elseif($npcc ==919){
$wpmz="〖火树银花の名士风流〗（纪念版）";//物品名字
$wpms="〖火树银花の名士风流〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP300000，攻击300000，防御300000，魔攻300000";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==920){
$wpmz="〖万花迎春の国色天香〗（纪念版）";//物品名字
$wpms="〖万花迎春の国色天香〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==921){
$wpmz="〖勇者之王〗（纪念版）";//物品名字
$wpms="〖勇者之王〗（纪念版）在2018.10.10-2018.10.16周年庆典获得,使用后可以永久增加HP500000，攻击200000，防御200000，魔攻200000";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类







} elseif($npcc ==922){
$wpmz="〖半〗";//物品名字
$wpms="〖半〗凑齐半周年庆典兑换生日甜品礼盒";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==923){
$wpmz="〖周〗";//物品名字
$wpms="〖周〗凑齐半周年庆典兑换生日甜品礼盒";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==924){
$wpmz="〖年〗";//物品名字
$wpms="〖年〗凑齐半周年庆典兑换生日甜品礼盒";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==925){
$wpmz="〖庆〗";//物品名字
$wpms="〖庆〗凑齐半周年庆典兑换生日甜品礼盒";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==926){
$wpmz="〖典〗";//物品名字
$wpms="〖典〗凑齐半周年庆典兑换生日甜品礼盒";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==927){
$wpmz="〖极品3位ID号（111）靓号卡〗";//物品名字
$wpms="使用后ID变更为111，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==928){
$wpmz="〖极品3位ID号（222）靓号卡〗";//物品名字
$wpms="使用后ID变更为222，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==929){
$wpmz="〖极品3位ID号（333）靓号卡〗";//物品名字
$wpms="使用后ID变更为333，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==930){
$wpmz="〖极品3位ID号（444）靓号卡〗";//物品名字
$wpms="使用后ID变更为444，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==931){
$wpmz="〖极品3位ID号（555）靓号卡〗";//物品名字
$wpms="使用后ID变更为555，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==932){
$wpmz="〖极品3位ID号（666）靓号卡〗";//物品名字
$wpms="使用后ID变更为666，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==933){
$wpmz="〖极品3位ID号（777）靓号卡〗";//物品名字
$wpms="使用后ID变更为777，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==934){
$wpmz="〖极品3位ID号（888）靓号卡〗";//物品名字
$wpms="使用后ID变更为888，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==935){
$wpmz="〖极品3位ID号（999）靓号卡〗";//物品名字
$wpms="使用后ID变更为999，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==936){
$wpmz="〖极品3位ID号（123）靓号卡〗";//物品名字
$wpms="使用后ID变更为123，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==937){
$wpmz="〖极品1位ID号（1）靓号卡〗";//物品名字
$wpms="使用后ID变更为1，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==938){
$wpmz="【伏羲阵图】";//物品名字
$wpms="【伏羲阵图】用于伏羲大阵消耗使用";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=1;//分类

} elseif($npcc ==939){
$wpmz="〖帝王石〗";//物品名字
$wpms="用于合成帝王宝石的宝贵材料";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==940){
$wpmz="〖帝王宝石包〗（1个）";//物品名字
$wpms="打开后获得〖帝王宝石〗x1";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==941){
$wpmz="〖护身符〗";//物品名字
$wpms="〖护身符〗用于伏羲大阵跳阵使用";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==942){
$wpmz="【黑沃土】";//物品名字
$wpms="【黑沃土】重阳节活动产物用于施肥";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==943){
$wpmz="【仙玉露】";//物品名字
$wpms="【仙玉露】重阳节活动产物用于施肥";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==944){
$wpmz="〖紫星币〗";//物品名字
$wpms="〖紫星币〗比金豆还要珍贵的物品";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==945){
$wpmz="〖小公主の激素〗";//物品名字
$wpms="〖小公主の激素〗用于催生植物的产品（提升1小时收获时间）";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==946){
$wpmz="【面粉】";//物品名字
$wpms="【面粉】重阳节活动用于制作【重阳糕】";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==947){
$wpmz="【红枣】";//物品名字
$wpms="【红枣】重阳节活动用于制作【重阳糕】";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==948){
$wpmz="【栗子】";//物品名字
$wpms="【栗子】重阳节活动用于制作【重阳糕】";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类
} elseif($npcc ==949){
$wpmz="【杏仁】";//物品名字
$wpms="【杏仁】重阳节活动用于制作【重阳糕】";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==950){
$wpmz="〖小公主の材料票〗";//物品名字
$wpms="〖小公主の材料票〗用于购买【杏仁】【栗子】【红枣】【面粉】【黑沃土】【仙玉露】";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==951){
$wpmz="〖小公主の仙竹〗";//物品名字
$wpms="〖小公主の仙竹〗用于活动抢夺积分榜";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==952){
$wpmz="【重阳糕】";//物品名字
$wpms="【重阳糕】用于兑换称号和〖小公主の激素〗";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==953){
$wpmz="〖小公主の仙竹〗";//物品名字
$wpms="〖小公主の仙竹〗用于活动抢夺积分榜";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类



} elseif($npcc ==954){
$wpmz="〖绝代芳华〗";//物品名字
$wpms="〖绝代芳华〗使用后hp增加30万，攻击魔攻防御各20万";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==955){
$wpmz="〖君临天下の武道至尊〗";//物品名字
$wpms="〖君临天下の武道至尊〗使用后hp增加150万，攻击魔攻防御各100万";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==956){
$wpmz="〖倾城佳人の艳冠天下〗";//物品名字
$wpms="〖倾城佳人の艳冠天下〗使用后hp增加120万，攻击魔攻防御各80万";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==957){
$wpmz="〖风流倜傥の百战无双〗";//物品名字
$wpms="〖风流倜傥の百战无双〗使用后hp增加100万，攻击魔攻防御各70万";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==958){
$wpmz="〖天下无双の群雄霸主〗";//物品名字
$wpms="〖天下无双の群雄霸主〗使用后hp增加80万，攻击魔攻防御各50万";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==959){
$wpmz="〖君临王城の至尊皇者〗";//物品名字
$wpms="〖君临王城の至尊皇者〗使用后hp增加100万，攻击魔攻防御各70万";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==960){
$wpmz="〖至尊无敌〗";//物品名字
$wpms="〖至尊无敌〗使用后hp增加80万，攻击魔攻防御各50万";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==961){
$wpmz="〖妖火天尊〗";//物品名字
$wpms="〖妖火天尊〗使用后hp增加50万，攻击魔攻防御各30万";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==962){
$wpmz="〖神乎其技〗";//物品名字
$wpms="〖神乎其技〗使用后hp增加30万，攻击魔攻防御各15万";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==963){
$wpmz="〖灵机百变〗";//物品名字
$wpms="〖灵机百变〗使用后hp增加30万，攻击魔攻防御各15万";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==964){
$wpmz="〖姐是白富美〗";//物品名字
$wpms="〖姐是白富美〗使用后hp增加30万，攻击魔攻防御各15万";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类




} elseif($npcc ==965){
$wpmz="〖圣灵白板套装〗";//物品名字
$wpms="〖圣灵白板套装〗打开后获得圣灵白板一套";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==966){
$wpmz="〖圣灵1级套装〗";//物品名字
$wpms="〖圣灵1级套装〗打开后获得圣灵1级套装一套";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==967){
$wpmz="〖圣灵2级套装〗";//物品名字
$wpms="〖圣灵2级套装〗打开后获得圣灵2级套装一套";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==968){
$wpmz="〖圣灵3级套装〗";//物品名字
$wpms="〖圣灵3级套装〗打开后获得圣灵3级套装一套";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==969){
$wpmz="〖圣灵☯天元套装〗";//物品名字
$wpms="〖圣灵☯天元套装〗打开后获得圣灵☯天元套装一套";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==970){
$wpmz="〖噬魂套装〗";//物品名字
$wpms="〖噬魂套装〗打开后获得噬魂套装一套";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==971){
$wpmz="〖帝王套装〗";//物品名字
$wpms="〖帝王套装〗打开后获得帝王套装一套";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==972){
$wpmz="〖比翼双飞〗（典藏套装）";//物品名字
$wpms="〖比翼双飞〗打开后获得比翼双飞婚饰一套";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==973){
$wpmz="【伏羲仙丹】";//物品名字
$wpms="使用后可解封仙20等级";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=220;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类




} elseif($npcc ==974){
$wpmz="〖仙佑石〗";//物品名字
$wpms="〖仙佑石〗升级人物200级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==975){
$wpmz="〖仙晶砂〗";//物品名字
$wpms="〖仙晶砂〗升级人物200级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==976){
$wpmz="〖仙器魂〗";//物品名字
$wpms="〖仙器魂〗升级人物200级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==977){
$wpmz="〖神佑石〗";//物品名字
$wpms="〖神佑石〗升级人物仙20级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==978){
$wpmz="〖神晶砂〗";//物品名字
$wpms="〖神晶砂〗升级人物仙20级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==979){
$wpmz="〖神器魂〗";//物品名字
$wpms="〖神器魂〗升级人物仙20级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==980){
$wpmz="〖圣佑石〗";//物品名字
$wpms="〖圣佑石〗升级人物仙30级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==981){
$wpmz="〖圣晶砂〗";//物品名字
$wpms="〖圣晶砂〗升级人物仙30级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==982){
$wpmz="〖圣器魂〗";//物品名字
$wpms="〖圣器魂〗升级人物仙30级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==983){
$wpmz="〖混沌天佑石〗";//物品名字
$wpms="〖混沌天佑石〗升级人物仙40级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==984){
$wpmz="〖混沌天晶砂〗";//物品名字
$wpms="〖混沌天晶砂〗升级人物仙40级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==985){
$wpmz="〖混沌天器魂〗";//物品名字
$wpms="〖混沌天器魂〗升级人物仙40级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==986){
$wpmz="〖混沌神佑石〗";//物品名字
$wpms="〖混沌神佑石〗升级人物仙50级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==987){
$wpmz="〖混沌神晶砂〗";//物品名字
$wpms="〖混沌神晶砂〗升级人物仙50级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==988){
$wpmz="〖混沌神器魂〗";//物品名字
$wpms="〖混沌神器魂〗升级人物仙50级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==989){
$wpmz="〖混沌圣佑石〗";//物品名字
$wpms="〖混沌圣佑石〗升级人物仙60级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==990){
$wpmz="〖混沌圣晶砂〗";//物品名字
$wpms="〖混沌圣晶砂〗升级人物仙60级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==991){
$wpmz="〖混沌圣器魂〗";//物品名字
$wpms="〖混沌圣器魂〗升级人物仙60级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==992){
$wpmz="〖鸿蒙天佑石〗";//物品名字
$wpms="〖鸿蒙天佑石〗升级人物仙70级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==993){
$wpmz="〖鸿蒙天晶砂〗";//物品名字
$wpms="〖鸿蒙天晶砂〗升级人物仙70级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==994){
$wpmz="〖鸿蒙天器魂〗";//物品名字
$wpms="〖鸿蒙天器魂〗升级人物仙70级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==995){
$wpmz="〖鸿蒙神佑石〗";//物品名字
$wpms="〖鸿蒙神佑石〗升级人物仙80级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==996){
$wpmz="〖鸿蒙神晶砂〗";//物品名字
$wpms="〖鸿蒙神晶砂〗升级人物仙80级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==997){
$wpmz="〖鸿蒙神器魂〗";//物品名字
$wpms="〖鸿蒙神器魂〗升级人物仙80级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==998){
$wpmz="〖鸿蒙圣佑石〗";//物品名字
$wpms="〖鸿蒙圣佑石〗升级人物仙90级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==999){
$wpmz="〖鸿蒙圣晶砂〗";//物品名字
$wpms="〖鸿蒙圣晶砂〗升级人物仙90级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==1000){
$wpmz="〖鸿蒙圣器魂〗";//物品名字
$wpms="〖鸿蒙圣器魂〗升级人物仙90级装备材料";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类






} else{





}

?>




