<?php



if($npcc ==1101){
$wpmz="〖1金矿券〗";//物品名字
$wpms="〖1金矿券〗可用于换取对应金额充值卡";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1102){
$wpmz="〖5金矿券〗";//物品名字
$wpms="〖5金矿券〗可用于换取对应金额充值卡";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1103){
$wpmz="〖10金矿券〗";//物品名字
$wpms="〖10金矿券〗可用于换取对应金额充值卡";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1104){
$wpmz="〖20金矿券〗";//物品名字
$wpms="〖20金矿券〗可用于换取对应金额充值卡";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1105){
$wpmz="〖50金矿券〗";//物品名字
$wpms="〖50金矿券〗可用于换取对应金额充值卡";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==1106){
$wpmz="〖100金矿券〗";//物品名字
$wpms="〖100金矿券〗可用于换取对应金额充值卡";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类






















} else{





}

?>




