<?php


if($npcc ==501){

$wpmz="【才子印记】（碎片）";//物品名字
$wpms="【才子印记】（碎片）凑足二十个可换【才子印记】";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==502){
	
	
$wpmz="【单彩贝壳】";//物品名字
$wpms="【单彩贝壳】活动获得可随机开出以外惊喜哦（必得学分）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==503){
$wpmz="【三彩贝壳】";//物品名字
$wpms="【三彩贝壳】活动获得可随机开出以外惊喜哦（必得学分）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==504){
$wpmz="【五彩贝壳】";//物品名字
$wpms="【五彩贝壳】活动获得可随机开出以外惊喜哦（必得学分）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==505){
$wpmz="【七彩贝壳】";//物品名字
$wpms="【七彩贝壳】活动获得可随机开出以外惊喜哦（必得学分）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==506){
$wpmz="【比翼图纸】";//物品名字
$wpms="【比翼图纸】可以打造【比翼双飞の婚戒】（典藏版）或者【比翼双飞の婚链】（典藏版）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==507){
$wpmz="〖武文双全〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击35000，防御35000，魔攻35000";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==508){
$wpmz="〖文状元〗";//物品名字
$wpms="使用后可以永久增加HP40000，攻击25000，防御25000，魔攻25000";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==509){
$wpmz="〖三好学生〗";//物品名字
$wpms="使用后可以永久增加HP30000，攻击10000，防御10000，魔攻10000";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==510){
$wpmz="〖金符碎片〗";//物品名字
$wpms="〖金符碎片〗+〖金魂〗+银两可在朱雀大街符咒大师处锻造成为成品（但并非一定成功哦）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==511){
$wpmz="〖钻符碎片〗";//物品名字
$wpms="〖钻符碎片〗+〖钻魂〗+银两可在朱雀大街符咒大师处锻造成为成品（但并非一定成功哦）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

	} elseif($npcc ==512){
$wpmz="〖陨符碎片〗";//物品名字
$wpms="〖陨符碎片〗+〖陨魂〗+银两可在朱雀大街符咒大师处锻造成为成品（但并非一定成功哦）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==513){
$wpmz="〖银符碎片〗";//物品名字
$wpms="〖银符碎片〗+〖银魂〗+银两可在朱雀大街符咒大师处锻造成为成品（但并非一定成功哦）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==514){
$wpmz="〖黄金贵族宝箱〗";//物品名字
$wpms="〖黄金贵族宝箱〗开通黄金贵族的玩家每日领取获得";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==515){
$wpmz="〖铂金贵族宝箱〗";//物品名字
$wpms="〖铂金贵族宝箱〗开通铂金贵族的玩家每日领取获得";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==516){
$wpmz="〖钻石皇族宝箱〗";//物品名字
$wpms="〖钻石皇族宝箱〗开通钻石皇族的玩家每日领取获得";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==517){
$wpmz="〖至尊皇族宝箱〗";//物品名字
$wpms="〖至尊皇族宝箱〗开通至尊皇族的玩家每日领取获得";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==518){
$wpmz="〖黄金贵族卡〗";//物品名字
$wpms="使用后可获得黄金贵族的尊贵身份并且领取30次对应福利（每日1次），具体奖励看福利页面";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==519){
$wpmz="〖铂金贵族卡〗";//物品名字
$wpms="使用后可获得黄铂金族的尊贵身份并且领取30次对应福利（每日1次），具体奖励看福利页面";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==520){
$wpmz="〖钻石皇族卡〗";//物品名字
$wpms="使用后可获得钻石皇族的尊贵身份并且领取30次对应福利（每日1次），具体奖励看福利页面";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==521){
$wpmz="〖至尊皇族卡〗";//物品名字
$wpms="使用后可获得尊皇族的尊贵身份并且领取30次对应福利（每日1次），具体奖励看福利页面";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==522){
$wpmz="【保命丸】";//物品名字
$wpms="使用可恢复50万体力!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=200000;
} elseif($npcc ==523){
$wpmz="【小保命丸】";//物品名字
$wpms="使用可恢复100万体力!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=250000;
} elseif($npcc ==524){
$wpmz="【中保命丸】";//物品名字
$wpms="使用可恢复200万体力!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=400000;
} elseif($npcc ==525){
$wpmz="【大保命丸】";//物品名字
$wpms="使用可恢复500万体力!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=800000;
} elseif($npcc ==526){
$wpmz="【超保命丸】";//物品名字
$wpms="使用可恢复800万体力!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=1000000;
} elseif($npcc ==527){
$wpmz="【极品保命丸】";//物品名字
$wpms="使用可恢复1500万体力!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=2000000;
} elseif($npcc ==528){
$wpmz="【灵品保命丸】";//物品名字
$wpms="使用可恢复3000万体力!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=4000000;
} elseif($npcc ==529){
$wpmz="【仙品保命丸】";//物品名字
$wpms="使用可恢复5000万体力!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=8000000;
} elseif($npcc ==530){
$wpmz="【神品保命丸】";//物品名字
$wpms="使用可恢复7000万体力!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=10000000;
} elseif($npcc ==531){
$wpmz="【圣品保命丸】";//物品名字
$wpms="使用可恢复1亿体力!";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=5;//分类
$gmjg=20000000;

} elseif($npcc ==532){
$wpmz="〖冰晶丹〗";//物品名字
$wpms="使用永久增加攻击120点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==533){
$wpmz="〖花果丹〗";//物品名字
$wpms="使用永久增加魔攻120点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==534){
$wpmz="〖瑶池丹〗";//物品名字
$wpms="使用永久增加防御200点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==535){
$wpmz="〖老君丹〗";//物品名字
$wpms="使用永久增加血量500点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==536){
$wpmz="〖金刚经〗";//物品名字
$wpms="使用永久增加攻击300点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==537){
$wpmz="〖法华经〗";//物品名字
$wpms="使用永久增加魔攻300点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==538){
$wpmz="〖地藏经〗";//物品名字
$wpms="使用永久增加防御500点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==539){
$wpmz="〖严华经〗";//物品名字
$wpms="使用永久增加血量1000点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类




} elseif($npcc ==540){
$wpmz="〖莲花金丹〗";//物品名字
$wpms="使用永久增加攻击500点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==541){
$wpmz="〖黑龙金丹〗";//物品名字
$wpms="使用永久增加魔攻500点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==542){
$wpmz="〖修炼攻击仙丹〗";//物品名字
$wpms="使用永久增加攻击600点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==543){
$wpmz="〖修炼魔攻仙丹〗";//物品名字
$wpms="使用永久增加魔攻600点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类
} elseif($npcc ==544){
$wpmz="〖修炼防御仙丹〗";//物品名字
$wpms="使用永久增加防御600点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==545){
$wpmz="〖修炼生命仙丹〗";//物品名字
$wpms="使用永久增加血量1000点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类




} elseif($npcc ==546){
$wpmz="〖攻之龙丹〗";//物品名字
$wpms="使用永久增加攻击1000点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==547){
$wpmz="〖魔之龙丹〗";//物品名字
$wpms="使用永久增加魔攻1000点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==548){
$wpmz="〖防之龙丹〗";//物品名字
$wpms="使用永久增加防御1000点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==549){
$wpmz="〖血之龙丹〗";//物品名字
$wpms="使用永久增加血量3000点！最多可使用100颗！";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==550){
$wpmz="〖装备图纸〗（宠物）";//物品名字
$wpms="升级宠物装备的必备图纸，无法直接使用请在宠物装备栏升级消耗";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==551){
$wpmz="〖女神之恋〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==552){
$wpmz="〖全服公敌〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==553){
$wpmz="〖至尊天圣〗";//物品名字
$wpms="使用后可以永久增加HP60000，攻击60000，防御60000，魔攻60000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==554){
$wpmz="〖一掷千金〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==555){
$wpmz="〖至尊红颜〗";//物品名字
$wpms="使用后可以永久增加HP88888，攻击88888，防御88888，魔攻88888";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==556){
$wpmz="〖望门贵族〗";//物品名字
$wpms="使用后可以永久增加HP66666，攻击66666，防御66666，魔攻66666";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==557){
$wpmz="〖倾城伊人〗";//物品名字
$wpms="使用后可以永久增加HP50000，攻击50000，防御50000，魔攻50000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==558){
$wpmz="【清】";//物品名字
$wpms="【清】2018暑期活动获得，凑齐四字可在玄武大街找三藏兑换【清凉宝箱】哦";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==559){
$wpmz="【凉】";//物品名字
$wpms="【凉】2018暑期活动获得，凑齐四字可在玄武大街找三藏兑换【清凉宝箱】哦";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==560){
$wpmz="【一】";//物品名字
$wpms="【一】2018暑期活动获得，凑齐四字可在玄武大街找三藏兑换【清凉宝箱】哦";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==561){
$wpmz="【夏】";//物品名字
$wpms="【夏】2018暑期活动获得，凑齐四字可在玄武大街找三藏兑换【清凉宝箱】哦";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类
} elseif($npcc ==562){
$wpmz="【清凉宝箱】";//物品名字
$wpms="【清凉宝箱】可随机获得1万西游声望卷或者1万法宝经验卷";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==563){
$wpmz="〖万能字〗";//物品名字
$wpms="〖万能字〗可在玄武大街找三藏兑换任意字体哦哦";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类



} elseif($npcc ==564){
$wpmz="【1万西游声望卷轴】";//物品名字
$wpms="使用后可获得1万西声望";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=1;//分类



} elseif($npcc ==565){
$wpmz="【1万法宝经验卷轴】";//物品名字
$wpms="使用后可获得1万法宝经验";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=40;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=1;//分类
$wpwng=5;//万能果价格

} elseif($npcc ==566){
$wpmz="〖冠军宝石包〗（1个）";//物品名字
$wpms="打开后获得〖冠军宝石〗x1";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==567){
$wpmz="〖冠军宝石包〗（3个）";//物品名字
$wpms="打开后获得〖冠军宝石〗x3";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==568){
$wpmz="〖冠军宝石包〗（8个）";//物品名字
$wpms="打开后获得〖冠军宝石〗x8";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==569){
$wpmz="〖冠军宝石包〗（30个）";//物品名字
$wpms="打开后获得〖冠军宝石〗x30";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==570){
	
	
	
$wpmz="〖齐天大圣〗（宠物蛋）";//物品名字
$wpms="通天塔20层齐天大圣掉落或者凑齐〖大圣精魄〗兑换";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==571){
$wpmz="〖大圣精魄〗";//物品名字
$wpms="传说凑齐大圣精魄能够复活〖齐天大圣〗";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==572){
$wpmz="〖百年魔珠〗（小袋）";//物品名字
$wpms="打开后可获得〖百年魔珠〗x1000";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==573){
$wpmz="〖百年魔珠〗（中袋）";//物品名字
$wpms="打开后可获得〖百年魔珠〗x5000";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类


} elseif($npcc ==574){
$wpmz="〖百年魔珠〗（大袋）";//物品名字
$wpms="打开后可获得〖百年魔珠〗x10000";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==575){
$wpmz="【恶魔符文】";//物品名字
$wpms="可在恶魔广场兑换恶魔声望";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==576){
$wpmz="【恶魔入场卷】";//物品名字
$wpms="可在恶魔广场兑换恶魔声望";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=1;//分类
} elseif($npcc ==577){
$wpmz="〖圣灵锻造图纸〗";//物品名字
$wpms="锻造圣灵装备的图纸";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==578){
$wpmz="【昊天神丹】";//物品名字
$wpms="使用后可解封159等级";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=159;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类
} elseif($npcc ==579){
$wpmz="〖探险符〗";//物品名字
$wpms="〖探险符〗金银山探险获得可以兑换超值的物品哦";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类
} elseif($npcc ==580){
$wpmz="〖天下至尊〗";//物品名字
$wpms="使用后可以永久增加HP200000，攻击200000，防御200000，魔攻200000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==581){
$wpmz="〖蓬莱至尊〗";//物品名字
$wpms="使用后可以永久增加HP150000，攻击150000，防御150000，魔攻150000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==582){
$wpmz="〖昆仑至尊〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==583){
$wpmz="〖名动天下〗";//物品名字
$wpms="使用后可以永久增加HP150000，攻击150000，防御150000，魔攻150000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==584){
$wpmz="〖万法不侵〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==585){
$wpmz="〖乾坤唯仙〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==586){
$wpmz="〖舞星仙姬〗";//物品名字
$wpms="使用后可以永久增加HP100000，攻击100000，防御100000，魔攻100000";//描述"
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==587){
$wpmz="〖王者宝石包〗（1个）";//物品名字
$wpms="打开后获得〖王者宝石〗x1";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==588){
$wpmz="〖王者宝石包〗（3个）";//物品名字
$wpms="打开后获得〖王者宝石〗x3";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==589){
$wpmz="〖王者宝石包〗（8个）";//物品名字
$wpms="打开后获得〖王者宝石〗x8";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==590){
$wpmz="〖王者宝石包〗（30个）";//物品名字
$wpms="打开后获得〖王者宝石〗x30";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



} elseif($npcc ==591){
$wpmz="【喜鹊蛋】";//物品名字
$wpms="活动产出【喜鹊蛋】可在牛郎出孵化小喜鹊";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==592){
$wpmz="【小喜鹊】";//物品名字
$wpms="每只【小喜鹊】都代表着牛郎与织女浓浓的爱情故事！！";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==593){
$wpmz="〖诛仙令〗";//物品名字
$wpms="拥有此诛仙令可随机开出诛仙任意位置装备包一件";//描述
$wpjd=1000;//金豆价格
$wpjg=1000;//价格
$wpdj=159;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==594){
$wpmz="〖诛仙武器令〗";//物品名字
$wpms="能够开出对应职业的诛仙武器一件";//描述
$wpjd=1000;//金豆价格
$wpjg=1000;//价格
$wpdj=159;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==595){
$wpmz="〖诛仙盔甲令〗";//物品名字
$wpms="能够开出诛仙盔甲一件";//描述
$wpjd=1000;//金豆价格
$wpjg=1000;//价格
$wpdj=159;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==596){
$wpmz="〖诛仙头盔令〗";//物品名字
$wpms="能够开出诛仙头盔一件";//描述
$wpjd=1000;//金豆价格
$wpjg=1000;//价格
$wpdj=159;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==597){
$wpmz="〖诛仙鞋子令〗";//物品名字
$wpms="能够开出诛仙鞋子一件";//描述
$wpjd=1000;//金豆价格
$wpjg=1000;//价格
$wpdj=159;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==598){
$wpmz="〖诛仙项链令〗";//物品名字
$wpms="能够开出诛仙项链一件";//描述
$wpjd=1000;//金豆价格
$wpjg=1000;//价格
$wpdj=159;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==599){
$wpmz="〖诛仙手镯令〗";//物品名字
$wpms="能够开出诛仙手镯一件";//描述
$wpjd=1000;//金豆价格
$wpjg=1000;//价格
$wpdj=159;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==600){
$wpmz="【喜鹊令】";//物品名字
$wpms="受到牛郎与织女的祝福（可将159典藏升级到179典藏）";//描述
$wpjd=1000;//金豆价格
$wpjg=1000;//价格
$wpdj=159;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类






} else{





}

?>




