<?php


if($npcc ==801){
$wpmz="〖极品7位ID号（7777777）靓号卡〗";//物品名字
$wpms="使用后ID变更为7777777，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==802){
$wpmz="〖极品7位ID号（8888888）靓号卡〗";//物品名字
$wpms="使用后ID变更为8888888，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==803){
$wpmz="〖极品7位ID号（9999999）靓号卡〗";//物品名字
$wpms="使用后ID变更为9999999，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==804){
$wpmz="〖极品7位ID号（1234567）靓号卡〗";//物品名字
$wpms="使用后ID变更为1234567，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==805){
$wpmz="〖极品7位ID号（1314520）靓号卡〗";//物品名字
$wpms="使用后ID变更为1314520，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==806){
$wpmz="〖极品7位ID号（5201314）靓号卡〗";//物品名字
$wpms="使用后ID变更为5201314，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==807){
$wpmz="〖极品7位ID号（5203344）靓号卡〗";//物品名字
$wpms="使用后ID变更为5203344，此区只能用一次唯一的专属靓号（如果已是靓号再次使用则原来的靓号会被替换掉）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类





} elseif($npcc ==808){
$wpmz="〖皇者宝石包〗（1个）";//物品名字
$wpms="打开后获得〖皇者宝石〗x1";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==809){
$wpmz="〖皇者宝石包〗（3个）";//物品名字
$wpms="打开后获得〖皇者宝石〗x3";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==810){
$wpmz="〖皇者宝石包〗（8个）";//物品名字
$wpms="打开后获得〖皇者宝石〗x8";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==811){
$wpmz="〖皇者宝石包〗（30个）";//物品名字
$wpms="打开后获得〖皇者宝石〗x30";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==812){
$wpmz="〖铁魂材料包〗";//物品名字
$wpms="打开后获得〖铁魂〗x100";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==813){
$wpmz="〖铜魂材料包〗";//物品名字
$wpms="打开后获得〖铜魂〗x100";//描述
$wpjd=2;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==814){
$wpmz="〖银魂材料包〗";//物品名字
$wpms="打开后获得〖银魂〗x100";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==815){
$wpmz="〖金魂材料包〗";//物品名字
$wpms="打开后获得〖金魂〗x100";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==816){
$wpmz="〖钻魂材料包〗";//物品名字
$wpms="打开后获得〖钻魂〗x100";//描述
$wpjd=15;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==817){
$wpmz="〖陨魂材料包〗";//物品名字
$wpms="打开后获得〖陨魂〗x100";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==818){
$wpmz="〖时装碎片〗";//物品名字
$wpms="〖时装碎片〗制作时装必备材料";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类



} elseif($npcc ==819){
$wpmz="〖时装契约〗";//物品名字
$wpms="〖时装契约〗制作时装必备材料";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==820){
$wpmz="〖时装凭证〗";//物品名字
$wpms="〖时装凭证〗制作时装的证书";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==821){
$wpmz="〖云梯石〗";//物品名字
$wpms="〖云梯石〗可用于娱乐爬楼的宝贝";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类



	
	
	//小轩专业检测恶意刷bug20年===杀无赦
include("./ini/bug_ini.php");
//小轩专业检测恶意刷bug20年===杀无赦
	
	
	

	







} elseif($npcc ==822){
$wpmz="〖如意の称号宝箱〗";//物品名字
$wpms="〖如意の称号宝箱〗各类称号屌丝的逆袭，王者的荣耀（同等的几率开出各类称号）";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==823){
$wpmz="〖仙の陨魂〗";//物品名字
$wpms="〖仙の陨魂〗能提升仙陨以上装备星级材料";//描述
$wpjd=10;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=2;//分类

} elseif($npcc ==824){
$wpmz="〖仙の陨升星符〗";//物品名字
$wpms="〖仙の陨升星符〗百分之百将仙陨以上装备星级提升成功";//描述
$wpjd=1000;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==825){
$wpmz="【圣星の永生】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后HP提升700000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==826){
$wpmz="【圣星の混沌】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后防御提升600000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==827){
$wpmz="【圣星の秩序】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后攻击提升600000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==828){
$wpmz="【圣星の圣恩】";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后魔攻提升600000";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==829){
$wpmz="【圣星の元素之王】（攻）";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后冰火雷攻+30";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==830){
$wpmz="【圣星の元素之王】（防）";//物品名字ztt.php//xy591.php//xy594.php
$wpms="放入星盘大阵后冰火雷防+30";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==831){
$wpmz="【五星红旗】";
$wpms="可在爱国富商处进行升旗用（每日领取一次）";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==832){
$wpmz="【欢】";
$wpms="凑齐一定数量欢度国庆可兑换【国庆宝箱】";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==833){
$wpmz="【度】";
$wpms="凑齐一定数量欢度国庆可兑换【国庆宝箱】";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==834){
$wpmz="【国】";
$wpms="凑齐一定数量欢度国庆可兑换【国庆宝箱】";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==835){
$wpmz="【庆】";
$wpms="凑齐一定数量欢度国庆可兑换【国庆宝箱】";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==836){
$wpmz="〖国庆万能字〗";
$wpms="可在国庆期间使用转换任意字";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==837){
$wpmz="【国庆金铲】";
$wpms="可用于国庆挖宝";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==838){
$wpmz="【金铲】";
$wpms="可用于国庆挖宝";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==839){
$wpmz="【至尊铲】";
$wpms="可用于国庆挖宝";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==840){
$wpmz="〖国庆藏宝图〗（银图）";
$wpms="配合对应的铲子进行挖宝";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==841){
$wpmz="〖国庆藏宝图〗（金图）";
$wpms="配合对应的铲子进行挖宝";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==842){
$wpmz="〖国庆藏宝图〗（至尊图）";
$wpms="配合对应的铲子进行挖宝";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==843){
$wpmz="【国庆金锤】";
$wpms="可用于国庆敲金蛋活动";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类



} elseif($npcc ==844){
$wpmz="〖国庆宝箱〗";
$wpms="可开出价值不菲的宝藏";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==845){
$wpmz="〖国庆愉快卡〗";
$wpms="可在国庆大使处提交用于国庆活动期间抢榜";//描述
$wpjd=20;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==846){
$wpmz="〖凤凰圣祖〗（宠物蛋）";//物品名字
$wpms="〖凤凰圣祖〗绝版宠物，威力十分惊人";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==847){
$wpmz="〖凤凰圣祖〗（宠物蛋-万里挑一）";//物品名字
$wpms="被小轩GM调教好了的宠物，必出五级变异圣品〖凤凰圣祖〗绝版宠物，威力十分惊人";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==848){
$wpmz="〖国庆充值10元消费礼宝箱〗";//物品名字
$wpms="在2018.10.1-2018.10.7回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==849){
$wpmz="〖国庆充值20元消费礼宝箱〗";//物品名字
$wpms="在2018.10.1-2018.10.7回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==850){
$wpmz="〖国庆充值50元消费礼宝箱〗";//物品名字
$wpms="在2018.10.1-2018.10.7回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==851){
$wpmz="〖国庆充值100元消费礼宝箱〗";//物品名字
$wpms="在2018.10.1-2018.10.7回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==852){
$wpmz="〖国庆充值200元消费礼宝箱〗";//物品名字
$wpms="在2018.10.1-2018.10.7回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==853){
$wpmz="〖国庆充值500元消费礼宝箱〗";//物品名字
$wpms="在2018.10.1-2018.10.7回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==854){
$wpmz="〖国庆充值1000元消费礼宝箱〗";//物品名字
$wpms="在2018.10.1-2018.10.7回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==855){
$wpmz="〖国庆充值2000元消费礼宝箱〗";//物品名字
$wpms="在2018.10.1-2018.10.7回馈充值赠送宝箱";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类


} elseif($npcc ==856){
$wpmz="〖至尊宝石包〗（1个）";//物品名字
$wpms="打开后获得〖至尊宝石〗x1";//描述
$wpjd=1;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==857){

$wpmz="〖挂售扩容卷〗";//物品名字
$wpms="使用后可增加背包容量500";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==858){
$wpmz="〖尊享VIP〗（月卡）";//物品名字
$wpms="使用后实力可大幅度提升从此走向人生巅峰，30天月卡";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类
} elseif($npcc ==859){
$wpmz="〖尊享VIP〗（季卡）";//物品名字
$wpms="使用后实力可大幅度提升从此走向人生巅峰，90天季卡";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==860){
$wpmz="〖尊享VIP〗（半年卡）";//物品名字
$wpms="使用后实力可大幅度提升从此走向人生巅峰，180天半年卡";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==861){
$wpmz="〖尊享VIP〗（至尊年卡）";//物品名字
$wpms="使用后实力可大幅度提升从此走向人生巅峰，366天年卡";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==862){
$wpmz="【尊享VIP】（月卡）";//物品名字
$wpms="使用后实力可大幅度提升从此走向人生巅峰，30天月卡";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==863){
$wpmz="〖采花花魁〗";//物品名字
$wpms="每日采花大盗排名奖励获取可用于兑换【尊享VIP】（月卡）";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==864){
$wpmz="〖尊享VIP〗（天卡）";//物品名字
$wpms="使用后实力可大幅度提升从此走向人生巅峰，1天卡";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==865){
$wpmz="【尊享VIP】（1天）";//物品名字
$wpms="使用后实力可大幅度提升从此走向人生巅峰，1天卡";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==866){
$wpmz="【尊享VIP】（3天）";//物品名字
$wpms="使用后实力可大幅度提升从此走向人生巅峰，3天卡";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类

} elseif($npcc ==867){
$wpmz="【尊享VIP】（7天）";//物品名字
$wpms="使用后实力可大幅度提升从此走向人生巅峰，7天卡";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=0;//绑定0为绑定1为不绑定
$wpfl=4;//分类


} elseif($npcc ==868){
$wpmz="〖鲜果蛋糕〗";//物品名字
$wpms="食用后可永久提升500hp";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==869){
$wpmz="〖奶油蛋糕〗";//物品名字
$wpms="食用后可永久提升700hp";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==870){
$wpmz="〖草莓蛋糕〗";//物品名字
$wpms="食用后可永久提升900hp";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==871){
$wpmz="〖焦糖蛋糕〗";//物品名字
$wpms="食用后可永久提升1200hp";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==872){
$wpmz="〖香椰子蛋糕〗";//物品名字
$wpms="食用后可永久提升1500hp";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==873){
$wpmz="〖曲奇饼干〗";//物品名字
$wpms="食用后可永久提升500攻击";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==874){
$wpmz="〖蛋卷饼干〗";//物品名字
$wpms="食用后可永久提升700攻击";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==875){
$wpmz="〖夹心饼干〗";//物品名字
$wpms="食用后可永久提升900攻击";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==876){
$wpmz="〖芝麻饼干〗";//物品名字
$wpms="食用后可永久提升1200攻击";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==877){
$wpmz="〖杏仁饼干〗";//物品名字
$wpms="食用后可永久提升1500攻击";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==878){
$wpmz="〖奶油面包〗";//物品名字
$wpms="食用后可永久提升500魔攻";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==879){
$wpmz="〖奶香面包〗";//物品名字
$wpms="食用后可永久提升700魔攻";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==880){
$wpmz="〖抹茶面包〗";//物品名字
$wpms="食用后可永久提升900魔攻";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==881){
$wpmz="〖椰蓉面包〗";//物品名字
$wpms="食用后可永久提升1200魔攻";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==882){
$wpmz="〖毛毛虫面包〗";//物品名字
$wpms="食用后可永久提升1500魔攻";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类



} elseif($npcc ==883){
$wpmz="〖酥圈巧克力〗";//物品名字
$wpms="食用后可永久提升500防御";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==884){
$wpmz="〖浓夫巧克力〗";//物品名字
$wpms="食用后可永久提升700防御";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==885){
$wpmz="〖米雪巧克力〗";//物品名字
$wpms="食用后可永久提升900防御";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==886){
$wpmz="〖乐荷巧克力〗";//物品名字
$wpms="食用后可永久提升1200防御";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==887){
$wpmz="〖香雪巧克力〗";//物品名字
$wpms="食用后可永久提升1500防御";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==888){
$wpmz="〖麦乐堡蛋糕〗（血）";//物品名字
$wpms="食用后可永久提升5000hp";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==889){
$wpmz="〖麦乐堡蛋糕〗（攻）";//物品名字
$wpms="食用后可永久提升5000攻击";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==890){
$wpmz="〖麦乐堡蛋糕〗（魔）";//物品名字
$wpms="食用后可永久提升5000魔攻";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类


} elseif($npcc ==891){
$wpmz="〖麦乐堡蛋糕〗（防）";//物品名字
$wpms="食用后可永久提升5000防御";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=5;//分类

} elseif($npcc ==892){
$wpmz="〖麦乐堡甜品箱〗";//物品名字
$wpms="能开出各类蛋糕，饼干，面包，巧克力，【尊享VIP】（1-7天）（必得麦乐堡蛋糕）";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=8;//分类

} elseif($npcc ==893){
$wpmz="〖西游蛋糕〗";//物品名字
$wpms="不能吃的哦，但是可用于积分抢榜";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类


} elseif($npcc ==894){
$wpmz="〖鸟蛋〗";//物品名字
$wpms="制作糕点的原材料";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==895){
$wpmz="〖奶油〗";//物品名字
$wpms="制作糕点的原材料";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==896){
$wpmz="〖白糖〗";//物品名字
$wpms="制作糕点的原材料";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==897){
$wpmz="〖牛奶〗";//物品名字
$wpms="制作糕点的原材料";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==898){
$wpmz="〖面粉〗";//物品名字
$wpms="制作糕点的原材料";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==899){
$wpmz="〖黄油〗";//物品名字
$wpms="制作糕点的原材料";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类

} elseif($npcc ==900){
$wpmz="〖小麦粉〗";//物品名字
$wpms="制作糕点的原材料";//描述
$wpjd=5;//金豆价格
$wpjg=1000;//价格
$wpdj=1;//等级
$wpzl=1;//重量
$wpbd=1;//绑定0为绑定1为不绑定
$wpfl=6;//分类




} else{





}

?>




