<?php

if($bsid ==1){
$bsmz="〖攻击强化石〗";
$bsms="镶嵌到装备上增加110~154的攻击！！";
$bsmg=0;
$bsfy=0;
$bsxl=0;
$bsgj=154;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==2){
$bsmz="〖魔攻强化石〗";
$bsms="镶嵌到装备上增加110~154的魔攻！！";
$bsmg=154;
$bsfy=0;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是


} elseif($bsid ==3){
$bsmz="〖攻击强化珠〗";
$bsms="镶嵌到装备上增加290~406的攻击！！";
$bsmg=0;
$bsfy=0;
$bsxl=0;
$bsgj=406;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是



} elseif($bsid ==4){
$bsmz="〖魔攻强化珠〗";
$bsms="镶嵌到装备上增加290~406的魔攻！！";
$bsmg=406;
$bsfy=0;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是

} elseif($bsid ==5){
$bsmz="〖攻击强化玉〗";
$bsms="镶嵌到装备上增加450~630的攻击！！";
$bsmg=0;
$bsfy=0;
$bsxl=0;
$bsgj=630;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是








} elseif($bsid ==6){
$bsmz="〖魔攻强化玉〗";
$bsms="镶嵌到装备上增加450~630的魔攻！！";
$bsmg=630;
$bsfy=0;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是

} elseif($bsid ==7){
$bsmz="〖攻击强化灵〗";
$bsms="镶嵌到装备上增加580~812的攻击！！";

$bsmg=0;
$bsfy=0;
$bsxl=0;
$bsgj=812;

$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是





} elseif($bsid ==8){
$bsmz="〖魔攻强化灵〗";
$bsms="镶嵌到装备上增加580~812的魔攻！！";


$bsmg=812;
$bsfy=0;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是


} elseif($bsid ==9){
$bsmz="〖攻击之源〗";
$bsms="镶嵌到装备上增加960~1120的攻击！！";

$bsmg=0;
$bsfy=0;
$bsxl=0;
$bsgj=1120;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==10){
$bsmz="〖魔攻之源〗";
$bsms="镶嵌到装备上增加960~1120的魔攻！！";
$bsmg=1120;
$bsfy=0;
$bsxl=0;
$bsgj=0;

} elseif($bsid ==11){
$bsmz="〖防御强化石〗";
$bsms="镶嵌到装备上增加110~154的防御！！";
$bsmg=0;
$bsfy=154;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==12){
$bsmz="〖生命强化石〗";
$bsms="镶嵌到装备上增加420的生命！！";
$bsmg=0;
$bsfy=0;
$bsxl=420;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==13){
$bsmz="〖防御强化珠〗";
$bsms="镶嵌到装备上增加209~406的防御！！";
$bsmg=0;
$bsfy=406;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==14){
$bsmz="〖生命强化珠〗";
$bsms="镶嵌到装备上增加760的生命！！";
$bsmg=0;
$bsfy=0;
$bsxl=760;
$bsgj=0;

$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是

} elseif($bsid ==15){
$bsmz="〖防御强化玉〗";
$bsms="镶嵌到装备上增加加450~603的防御！！";
$bsmg=0;
$bsfy=603;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==16){
$bsmz="〖生命强化玉〗";
$bsms="镶嵌到装备上增加1040的生命！！";
$bsmg=0;
$bsfy=0;
$bsxl=1040;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==17){
$bsmz="〖防御强化灵〗";
$bsms="镶嵌到装备上增加580~812的防御！！";
$bsmg=0;
$bsfy=812;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==18){
$bsmz="〖生命强化灵〗";
$bsms="镶嵌到装备上增加1420的生命！！";
$bsmg=0;
$bsfy=0;
$bsxl=1420;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==19){
$bsmz="〖防御之源〗";
$bsms="镶嵌到装备上增加960~1120的防御！！";
$bsmg=0;
$bsfy=1850;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==20){
$bsmz="〖生命之源〗";
$bsms="镶嵌到装备上增加1850的生命！！";
$bsmg=0;
$bsfy=0;
$bsxl=1120;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==21){
$bsmz="〖财气宝石〗（血）";
$bsms="镶嵌到装备上增加3120的生命！！";
$bsmg=0;
$bsfy=0;
$bsxl=3120;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是

} elseif($bsid ==22){
$bsmz="〖财气宝石〗（攻）";
$bsms="镶嵌到装备上增加2125的攻击！！";
$bsmg=0;
$bsfy=0;
$bsxl=0;
$bsgj=2125;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是

} elseif($bsid ==23){
$bsmz="〖财气宝石〗（魔）";
$bsms="镶嵌到装备上增加2125的魔攻！！！";
$bsmg=2125;
$bsfy=0;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是

} elseif($bsid ==24){
$bsmz="〖财气宝石〗（防）";
$bsms="镶嵌到装备上增加2125的防御！！";
$bsmg=0;
$bsfy=2125;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
} elseif($bsid ==25){
$bsmz="〖荣誉宝石〗";
$bsms="镶嵌到装备上增加攻击和魔攻4200，防御3000，HP6000！！";
$bsmg=4200;
$bsfy=3000;
$bsxl=6000;
$bsgj=4200;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是

} elseif($bsid ==26){
$bsmz="〖冠军宝石〗";
$bsms="镶嵌到装备上增加攻击和魔攻10000，防御7000，HP13500！！";
$bsmg=10000;
$bsfy=7000;
$bsxl=13500;
$bsgj=10000;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是

} elseif($bsid ==27){
$bsmz="〖王者宝石〗";
$bsms="镶嵌到装备上增加攻击和魔攻18000，防御18000，HP40000！！";
$bsmg=18000;
$bsfy=18000;
$bsxl=40000;
$bsgj=18000;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是


} elseif($bsid ==28){
$bsmz="〖皇者宝石〗";
$bsms="镶嵌到装备上增加攻击和魔攻36000，防御36000，HP80000！！";
$bsmg=36000;
$bsfy=36000;
$bsxl=80000;
$bsgj=36000;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是

} elseif($bsid ==29){
$bsmz="〖圣贤宝石〗";
$bsms="镶嵌到装备上增加攻击和魔攻75000，防御75000，HP180000！！";
$bsmg=75000;
$bsfy=75000;
$bsxl=180000;
$bsgj=75000;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是


} elseif($bsid ==30){
$bsmz="〖至尊宝石〗";
$bsms="镶嵌到装备上增加攻击和魔攻105000，防御105000，HP250000！！";
$bsmg=105000;
$bsfy=105000;
$bsxl=250000;
$bsgj=105000;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是

} elseif($bsid ==31){
$bsmz="〖帝王宝石〗";
$bsms="镶嵌到装备上增加攻击和魔攻205000，防御205000，HP500000！！";
$bsmg=205000;
$bsfy=205000;
$bsxl=500000;
$bsgj=205000;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是







} else{
$bsmz="错误信息";
$bsms="错误信息：该宝石没有添加请联系GM进行更新！！";
$bsmg=0;
$bsfy=0;
$bsxl=0;
$bsgj=0;
$bsjg=1000;//宝石价格
$bszl=1;//宝石重量
$bsbd=1;//宝石绑定1为否2为是
}


?>




