<?php

	

if($npcc==1){
//需要修改的变量
$wp1="〖玄冰枪〗";//装备名字
$wp2="破旧的玄冰枪";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=329;//装备攻击
$wp16=110;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=1;//装备冰攻
$wp19=1;//装备火攻
$wp20=1;//装备雷攻
//需要修改的变量
$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派
$wp30=3;//装备分类



} elseif($npcc ==2){



//需要修改的变量

$wp1="〖仙魂枪〗";//装备名字
$wp2="仙魂套装之--枪！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=190;//装备攻击
$wp16=150;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=10;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类



} elseif($npcc ==3){



//需要修改的变量

$wp1="【白虎枪】";//装备名字
$wp2="白虎套装之--枪！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=268;//装备攻击
$wp16=157;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==4){
$wp1="【白虎笑傲枪】";//名字
$wp2="白虎笑傲套之枪！（拾取绑定）";//描述
$wp14=0;//装备hp
$wp15=983;//装备攻击
$wp16=479;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==5){
$wp1="【玄武枪】";//名字
$wp2="玄武套装之枪（拾取绑定）";//描述
$wp14=0;//装备hp
$wp15=1256;//装备攻击
$wp16=652;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==6){
$wp1="【玄武撼地枪】";//名字
$wp2="玄武撼地套装之枪！（拾取绑定）";//描述
$wp14=0;//装备hp
$wp15=1595;//装备攻击
$wp16=898;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==7){
$wp1="【朱雀枪】";//名字
$wp2="朱雀套装之枪（拾取绑定）";//描述
$wp14=0;//装备hp
$wp15=2395;//装备攻击
$wp16=1580;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=22;//装备冰攻
$wp19=22;//装备火攻
$wp20=22;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类






} elseif($npcc ==8){



//需要修改的变量

$wp1="【应龙戟】（40）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=549;//装备攻击
$wp16=236;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类
} elseif($npcc ==9){
$wp1="【应龙戟】（60）";//名字
$wp2="强大的师门神兵！";//描述
$wp14=0;//装备hp
$wp15=748;//装备攻击
$wp16=473;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=12;//装备冰攻
$wp19=12;//装备火攻
$wp20=12;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==10){
$wp1="【应龙戟】（80）";//名字
$wp2="强大的师门神兵！";//描述
$wp14=0;//装备hp
$wp15=1398;//装备攻击
$wp16=795;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==11){
$wp1="【应龙戟】（89）";//名字
$wp2="强大的师门神兵！";//描述
$wp14=0;//装备hp
$wp15=2485;//装备攻击
$wp16=1350;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=89;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==12){
$wp1="【应龙戟】（99）";//名字
$wp2="强大的师门神兵！";//描述
$wp14=0;//装备hp
$wp15=3158;//装备攻击
$wp16=1735;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类




} elseif($npcc ==13){



//需要修改的变量

$wp1="〖雷皇枪〗";//装备名字
$wp2="雷皇套装之一";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=68;//装备攻击
$wp16=54;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==14){



//需要修改的变量

$wp1="【幻想枪】";//装备名字
$wp2="幻想绝版套装之武器！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2235;//装备攻击
$wp16=1548;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=50;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==15){



//需要修改的变量

$wp1="〖玄冰叉〗";//装备名字
$wp2="龙宫初级武器";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=19;//装备攻击
$wp16=0;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=1;//装备冰攻
$wp19=1;//装备火攻
$wp20=1;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类





} elseif($npcc ==16){



//需要修改的变量


$wp1="〖仙魂叉〗";//装备名字
$wp2="仙魂套装之--叉！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=150;//装备攻击
$wp16=190;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=10;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类



} elseif($npcc ==17){



//需要修改的变量

$wp1="【龙鳞叉】";//装备名字
$wp2="龙鳞套装之--叉！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=268;//装备攻击
$wp16=157;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==18){



//需要修改的变量

$wp1="【龙鳞破天叉】";//装备名字
$wp2="龙鳞破天套之叉！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=983;//装备攻击
$wp16=479;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==19){



//需要修改的变量

$wp1="【青龙叉】";//装备名字
$wp2="青龙套装之叉（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1256;//装备攻击
$wp16=652;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==20){



//需要修改的变量

$wp1="【青龙在天叉】";//装备名字
$wp2="青龙在天套装之叉！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1595;//装备攻击
$wp16=898;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==21){



//需要修改的变量

$wp1="【天龙叉】";//装备名字
$wp2="天龙套装之叉（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2395;//装备攻击
$wp16=1580;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=22;//装备冰攻
$wp19=22;//装备火攻
$wp20=22;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==22){



//需要修改的变量

$wp1="【五龙叉】（40）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=549;//装备攻击
$wp16=236;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==23){



//需要修改的变量

$wp1="【五龙叉】（60）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=748;//装备攻击
$wp16=473;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=12;//装备冰攻
$wp19=12;//装备火攻
$wp20=12;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类



} elseif($npcc ==24){



//需要修改的变量

$wp1="【五龙叉】（80）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1398;//装备攻击
$wp16=795;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==25){



//需要修改的变量

$wp1="【五龙叉】（89）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2485;//装备攻击
$wp16=1350;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=89;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==26){



//需要修改的变量

$wp1="【五龙叉】（99）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3158;//装备攻击
$wp16=1735;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类











} elseif($npcc ==27){



//需要修改的变量

$wp1="〖雷皇叉〗";//装备名字
$wp2="雷皇套装之一";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=68;//装备攻击
$wp16=54;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=2;//装备分类




} elseif($npcc ==28){



//需要修改的变量

$wp1="【幻想叉】";//装备名字
$wp2="幻想绝版套装之武器！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2235;//装备攻击
$wp16=1548;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=50;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类




} elseif($npcc ==29){



//需要修改的变量

$wp1="〖玄冰棍〗";//装备名字
$wp2="方寸山初级武器";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=19;//装备攻击
$wp16=0;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=1;//装备冰攻
$wp19=1;//装备火攻
$wp20=1;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==30){



//需要修改的变量

$wp1="〖仙魂棍〗";//装备名字
$wp2="仙魂套装之--棍";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=190;//装备攻击
$wp16=150;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=10;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类



} elseif($npcc ==31){



//需要修改的变量

$wp1="【七星棍】";//装备名字
$wp2="七星套装之--棍！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=268;//装备攻击
$wp16=157;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==32){



//需要修改的变量

$wp1="【七星逐月棍】";//装备名字
$wp2="七星逐月套之棍！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=983;//装备攻击
$wp16=479;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类



} elseif($npcc ==33){



//需要修改的变量

$wp1="【无极棍】";//装备名字
$wp2="无极套装之棍（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1256;//装备攻击
$wp16=652;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==34){



//需要修改的变量

$wp1="【无极无道棍】";//装备名字
$wp2="无极无道套装之棍！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1595;//装备攻击
$wp16=898;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类
} elseif($npcc ==35){



//需要修改的变量

$wp1="【太乙棍】";//装备名字
$wp2="太乙套装之棍（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2395;//装备攻击
$wp16=1580;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=22;//装备冰攻
$wp19=22;//装备火攻
$wp20=22;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==36){



//需要修改的变量

$wp1="【夸父棍】（40）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=549;//装备攻击
$wp16=236;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==37){



//需要修改的变量

$wp1="【夸父棍】（60）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=748;//装备攻击
$wp16=473;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==38){



//需要修改的变量

$wp1="【夸父棍】（80）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1398;//装备攻击
$wp16=795;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类
} elseif($npcc ==39){



//需要修改的变量

$wp1="【夸父棍】（89）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2485;//装备攻击
$wp16=1350;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=89;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类
} elseif($npcc ==40){



//需要修改的变量

$wp1="【夸父棍】（99）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3158;//装备攻击
$wp16=1735;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类




} elseif($npcc ==41){



//需要修改的变量

$wp1="〖雷皇棍〗";//装备名字
$wp2="雷皇套装之一";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=68;//装备攻击
$wp16=54;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类



} elseif($npcc ==42){



//需要修改的变量

$wp1="【幻想棍】";//装备名字
$wp2="幻想绝版套装之武器！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2235;//装备攻击
$wp16=1548;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=50;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==43){



//需要修改的变量

$wp1="〖玄冰杖〗";//装备名字
$wp2="普陀山初级武器";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=19;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=1;//装备冰攻
$wp19=1;//装备火攻
$wp20=1;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类




} elseif($npcc ==44){



//需要修改的变量


$wp1="〖仙魂仗〗";//装备名字
$wp2="仙魂套装之--仗！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=190;//装备攻击
$wp16=150;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=10;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类





} elseif($npcc ==45){



//需要修改的变量

$wp1="【伏虎杖】";//装备名字
$wp2="伏虎套装之--杖！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=157;//装备攻击
$wp16=268;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==46){



//需要修改的变量

$wp1="【伏虎降龙杖】";//装备名字
$wp2="伏虎降龙套之杖！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=983;//装备攻击
$wp16=479;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类
} elseif($npcc ==47){



//需要修改的变量

$wp1="【金刚杖】";//装备名字
$wp2="金刚套装之杖（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1256;//装备攻击
$wp16=652;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类
} elseif($npcc ==48){



//需要修改的变量

$wp1="【怒目金刚杖】";//装备名字
$wp2="怒目金刚套装之杖！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1595;//装备攻击
$wp16=898;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类
} elseif($npcc ==49){



//需要修改的变量

$wp1="【罗汉杖】";//装备名字
$wp2="罗汉套装之杖（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2395;//装备攻击
$wp16=1580;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=22;//装备冰攻
$wp19=22;//装备火攻
$wp20=22;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==50){



//需要修改的变量

$wp1="【般若杖】（40）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=236;//装备攻击
$wp16=549;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类
} elseif($npcc ==51){



//需要修改的变量

$wp1="【般若杖】（60）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=748;//装备攻击
$wp16=473;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=12;//装备冰攻
$wp19=12;//装备火攻
$wp20=12;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==52){



//需要修改的变量

$wp1="【般若杖】（80）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1398;//装备攻击
$wp16=795;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==53){



//需要修改的变量

$wp1="【般若杖】（89）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2485;//装备攻击
$wp16=1350;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=89;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==54){



//需要修改的变量

$wp1="【般若杖】（99）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3158;//装备攻击
$wp16=1735;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==55){



//需要修改的变量

$wp1="〖雷皇杖〗";//装备名字
$wp2="雷皇套装之一";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=54;//装备攻击
$wp16=68;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类



} elseif($npcc ==56){



//需要修改的变量

$wp1="【幻想杖】";//装备名字
$wp2="幻想绝版套装之武器！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1548;//装备攻击
$wp16=2235;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=50;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类



} elseif($npcc ==57){



//需要修改的变量

$wp1="〖玄冰剑〗";//装备名字
$wp2="月宫初级武器";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=19;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=1;//装备冰攻
$wp19=1;//装备火攻
$wp20=1;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==58){



//需要修改的变量


$wp1="〖仙魂剑〗";//装备名字
$wp2="仙魂套装之--剑！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=150;//装备攻击
$wp16=190;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=10;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类



} elseif($npcc ==59){



//需要修改的变量

$wp1="【碧海剑】";//装备名字
$wp2="碧海套装之--剑！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=157;//装备攻击
$wp16=268;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类
} elseif($npcc ==60){



//需要修改的变量

$wp1="【碧海青天剑】";//装备名字
$wp2="碧海青天套之剑！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=479;//装备攻击
$wp16=983;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==61){



//需要修改的变量

$wp1="【银沙剑】";//装备名字
$wp2="银沙套装之剑（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=652;//装备攻击
$wp16=1256;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==62){



//需要修改的变量

$wp1="【银沙瀚海剑】";//装备名字
$wp2="银沙瀚海套装之剑！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=898;//装备攻击
$wp16=1595;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==63){



//需要修改的变量

$wp1="【奔月剑】";//装备名字
$wp2="奔月套装之剑（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1580;//装备攻击
$wp16=2395;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=22;//装备冰攻
$wp19=22;//装备火攻
$wp20=22;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类



} elseif($npcc ==64){



//需要修改的变量

$wp1="【碧落剑】（40）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=236;//装备攻击
$wp16=549;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==65){



//需要修改的变量

$wp1="【碧落剑】（60）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=473;//装备攻击
$wp16=748;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=12;//装备冰攻
$wp19=12;//装备火攻
$wp20=12;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==66){



//需要修改的变量

$wp1="【碧落剑】（80）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=795;//装备攻击
$wp16=1398;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==67){



//需要修改的变量

$wp1="【碧落剑】（89）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1350;//装备攻击
$wp16=2485;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=89;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==68){



//需要修改的变量

$wp1="【碧落剑】（99）";//装备名字
$wp2="强大的师门神兵！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1735;//装备攻击
$wp16=3158;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==69){



//需要修改的变量

$wp1="〖雷皇剑〗";//装备名字
$wp2="雷皇套装之一";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=54;//装备攻击
$wp16=68;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==70){



//需要修改的变量

$wp1="【幻想剑】";//装备名字
$wp2="幻想绝版套装之武器！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1548;//装备攻击
$wp16=2235;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=50;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类



} elseif($npcc ==71){



//需要修改的变量

$wp1="〖玄冰战甲〗";//装备名字
$wp2="初级战甲";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=15;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=1;//装备冰防
$wp22=1;//装备火防
$wp23=1;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类


} elseif($npcc ==72){



//需要修改的变量

$wp1="〖仙魂战甲〗";//装备名字
$wp2="仙魂套装之--战甲！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=222;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=4;//装备冰防
$wp22=4;//装备火防
$wp23=4;//装备雷防
//需要修改的变量

$wp24=10;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类

} elseif($npcc ==73){



//需要修改的变量

$wp1="【白虎盔甲】";//装备名字
$wp2="白虎套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=438;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==74){



//需要修改的变量

$wp1="【七星盔甲】";//装备名字
$wp2="七星套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=438;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==75){



//需要修改的变量

$wp1="【龙鳞盔甲】";//装备名字
$wp2="龙鳞套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=438;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=4;//装备分类




} elseif($npcc ==76){



//需要修改的变量

$wp1="【伏虎盔甲】";//装备名字
$wp2="伏虎套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=438;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=4;//装备分类


} elseif($npcc ==77){



//需要修改的变量

$wp1="【碧海盔甲】";//装备名字
$wp2="碧海套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=438;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=4;//装备分类


} elseif($npcc ==78){



//需要修改的变量

$wp1="【白虎笑傲铠】";//装备名字
$wp2="白虎笑傲套之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=547;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==79){



//需要修改的变量

$wp1="【七星逐月铠】";//装备名字
$wp2="七星逐月套之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=547;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==80){



//需要修改的变量

$wp1="【龙鳞破天铠】";//装备名字
$wp2="龙鳞破天套之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=547;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=4;//装备分类




} elseif($npcc ==81){



//需要修改的变量

$wp1="【伏虎降龙铠】";//装备名字
$wp2="伏虎降龙套之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=547;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=4;//装备分类


} elseif($npcc ==82){



//需要修改的变量

$wp1="【碧海青天铠】";//装备名字
$wp2="碧海青天套之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=547;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==83){



//需要修改的变量

$wp1="【玄武铠甲】";//装备名字
$wp2="玄武套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=786;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==84){



//需要修改的变量

$wp1="【无极铠甲】";//装备名字
$wp2="无极套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=786;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==85){



//需要修改的变量

$wp1="【青龙铠甲】";//装备名字
$wp2="青龙套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=786;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=4;//装备分类




} elseif($npcc ==86){



//需要修改的变量

$wp1="【金刚铠甲】";//装备名字
$wp2="金刚套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=786;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=4;//装备分类


} elseif($npcc ==87){



//需要修改的变量

$wp1="【银沙铠甲】";//装备名字
$wp2="银沙套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=786;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=4;//装备分类







} elseif($npcc ==88){



//需要修改的变量

$wp1="【玄武撼地甲】";//装备名字
$wp2="玄武撼地套装之枪！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=786;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==89){



//需要修改的变量

$wp1="【无极无道甲】";//装备名字
$wp2="无极无道套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1350;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==90){



//需要修改的变量

$wp1="【青龙在天甲】";//装备名字
$wp2="青龙在天套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1350;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=4;//装备分类




} elseif($npcc ==91){



//需要修改的变量

$wp1="【怒目金刚甲】";//装备名字
$wp2="怒目金刚套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1350;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=4;//装备分类


} elseif($npcc ==92){



//需要修改的变量

$wp1="【银沙瀚海甲】";//装备名字
$wp2="银沙瀚海套装之甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1350;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=4;//装备分类


} elseif($npcc ==93){



//需要修改的变量

$wp1="【朱雀战甲】";//装备名字
$wp2="朱雀套装之战甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=786;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==94){



//需要修改的变量

$wp1="【太乙战甲】";//装备名字
$wp2="太乙套装之战甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1350;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==95){



//需要修改的变量

$wp1="【天龙战甲】";//装备名字
$wp2="天龙套装之战甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1350;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=4;//装备分类




} elseif($npcc ==96){



//需要修改的变量

$wp1="【罗汉战甲】";//装备名字
$wp2="罗汉套装之战甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1350;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=4;//装备分类


} elseif($npcc ==97){



//需要修改的变量

$wp1="【奔月战甲】";//装备名字
$wp2="奔月套装之战甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1350;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=4;//装备分类







} elseif($npcc ==98){



//需要修改的变量

$wp1="〖刑天铁甲〗";//装备名字
$wp2="战神刑天用过的战甲！(可在长安装备锻造商处进行升级)";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=953;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类



} elseif($npcc ==99){



//需要修改的变量

$wp1="【巨灵宝甲】";//装备名字
$wp2="传说中的大巨灵装备，你值得拥有！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2765;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类





} elseif($npcc ==100){



//需要修改的变量

$wp1="〖雷皇战衣〗";//装备名字
$wp2="雷皇套装之一";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=186;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类




} else{

echo "<font color=black>没有这个装备id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}

?>




