<?php

	if($npcc ==301){



//需要修改的变量

$wp1="【仙鹤】";//装备名字
$wp2="中阶坐骑-【仙鹤】，（可在长安装备锻造商处进行魔化升级）";//装备描述
//需要修改的变量

$wp14=200;//装备hp
$wp15=30;//装备攻击
$wp16=50;//装备魔攻
$wp17=80;//装备防御
//需要修改的变量
$wp18=3;//装备冰攻
$wp19=3;//装备火攻
$wp20=3;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类


} elseif($npcc ==302){



//需要修改的变量

$wp1="【五爪金龙】";//装备名字
$wp2="中阶坐骑-【五爪金龙】，（可在长安装备锻造商处进行魔化升级）";//装备描述
//需要修改的变量

$wp14=200;//装备hp
$wp15=30;//装备攻击
$wp16=50;//装备魔攻
$wp17=80;//装备防御
//需要修改的变量
$wp18=3;//装备冰攻
$wp19=3;//装备火攻
$wp20=3;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类



} elseif($npcc ==333){



//需要修改的变量

$wp1="【镇东神兽】（青龙）";//装备名字
$wp2="高阶坐骑-【镇东神兽】（青龙）";//装备描述
//需要修改的变量

$wp14=35888;//装备hp
$wp15=4345;//装备攻击
$wp16=4345;//装备魔攻
$wp17=3258;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类


} elseif($npcc ==334){



//需要修改的变量

$wp1="【镇东神兽】（白虎）";//装备名字
$wp2="高阶坐骑-【镇东神兽】（白虎）";//装备描述
//需要修改的变量

$wp14=8888;//装备hp
$wp15=6789;//装备攻击
$wp16=4345;//装备魔攻
$wp17=3258;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类

} elseif($npcc ==335){



//需要修改的变量

$wp1="【镇东神兽】（朱雀）";//装备名字
$wp2="高阶坐骑-【镇东神兽】（朱雀）";//装备描述
//需要修改的变量

$wp14=8888;//装备hp
$wp15=4345;//装备攻击
$wp16=6789;//装备魔攻
$wp17=3258;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类





} elseif($npcc ==336){



//需要修改的变量

$wp1="【镇东神兽】（玄武）";//装备名字
$wp2="高阶坐骑-【镇东神兽】（玄武）";//装备描述
//需要修改的变量
$wp14=8888;//装备hp
$wp15=4345;//装备攻击
$wp16=4345;//装备魔攻
$wp17=6088;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类



} elseif($npcc ==337){



//需要修改的变量

$wp1="【心心相印】（婚戒）";//装备名字
$wp2="【心心相印】（婚戒）象征着彼此相爱恋人的信物";//装备描述
//需要修改的变量

$wp14=2100;//装备hp
$wp15=980;//装备攻击
$wp16=1025;//装备魔攻
$wp17=885;//装备防御
//需要修改的变量
$wp18=3;//装备冰攻
$wp19=3;//装备火攻
$wp20=3;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=9;//装备分类


} elseif($npcc ==338){



//需要修改的变量

$wp1="【心心相印】（婚链）";//装备名字
$wp2="【心心相印】（婚链）象征着彼此相爱恋人的信物";//装备描述
//需要修改的变量

$wp14=2100;//装备hp
$wp15=980;//装备攻击
$wp16=1025;//装备魔攻
$wp17=885;//装备防御
//需要修改的变量
$wp18=3;//装备冰攻
$wp19=3;//装备火攻
$wp20=3;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=10;//装备分类


} elseif($npcc ==400){

//需要修改的变量

$wp1="【幻想枪Ⅰ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想枪Ⅰ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5894;//装备攻击
$wp16=5894;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	











} else{

echo "<font color=black>没有这个装备id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}

?>




