<?php

if($npcc ==501){

//需要修改的变量

$wp1="【帝王手镯】（GM版）";//装备名字
$wp2="小轩GM专属手镯-所向披靡百战百胜（拾取绑定）";//装备描述
//需要修改的变量

$wp14=99999;//装备hp
$wp15=99999;//装备攻击
$wp16=99999;//装备魔攻
$wp17=99999;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类	
					} elseif($npcc ==502){
//需要修改的变量

$wp1="【帝王婚戒】（GM版）";//装备名字
$wp2="小轩GM专属婚戒-所向披靡百战百胜（拾取绑定）";//装备描述
//需要修改的变量

$wp14=99999;//装备hp
$wp15=99999;//装备攻击
$wp16=99999;//装备魔攻
$wp17=99999;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=9;//装备分类	
			} elseif($npcc ==503){

//需要修改的变量

$wp1="【帝王婚链】（GM版）";//装备名字
$wp2="小轩GM专属婚链-所向披靡百战百胜（拾取绑定）";//装备描述
//需要修改的变量

$wp14=99999;//装备hp
$wp15=99999;//装备攻击
$wp16=99999;//装备魔攻
$wp17=99999;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=10;//装备分类	



} elseif($npcc ==504){
//需要修改的变量

$wp1="【圣灵战甲】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=5925;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
					} elseif($npcc ==505){
//需要修改的变量

$wp1="【圣灵战盔】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7615;//装备攻击
$wp16=7615;//装备魔攻
$wp17=7615;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
					} elseif($npcc ==506){
//需要修改的变量

$wp1="【圣灵战靴】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=6115;//装备攻击
$wp16=6115;//装备魔攻
$wp17=6174;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



							} elseif($npcc ==507){
//需要修改的变量

$wp1="【圣灵项链】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=6284;//装备攻击
$wp16=6284;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==508){
//需要修改的变量

$wp1="【圣灵手镯】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=6684;//装备攻击
$wp16=6684;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



	} elseif($npcc ==509){
		
	//需要修改的变量

$wp1="【圣灵枪】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=9415;//装备攻击
$wp16=9415;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
			} elseif($npcc ==510){
//需要修改的变量

$wp1="【圣灵叉】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=9415;//装备攻击
$wp16=9415;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
				} elseif($npcc ==511){
//需要修改的变量

$wp1="【圣灵棍】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=9415;//装备攻击
$wp16=9415;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类		
					} elseif($npcc ==512){
//需要修改的变量

$wp1="【圣灵仗】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=9415;//装备攻击
$wp16=9415;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==513){
//需要修改的变量

$wp1="【圣灵剑】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=9415;//装备攻击
$wp16=9415;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	

	

} elseif($npcc ==514){
//需要修改的变量

$wp1="【圣灵战甲Ⅰ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=6525;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=42;//装备冰防
$wp22=42;//装备火防
$wp23=42;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
					} elseif($npcc ==515){
//需要修改的变量

$wp1="【圣灵战盔Ⅰ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=8215;//装备攻击
$wp16=8215;//装备魔攻
$wp17=8215;//装备防御
//需要修改的变量
$wp18=42;//装备冰攻
$wp19=42;//装备火攻
$wp20=42;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
					} elseif($npcc ==516){
//需要修改的变量

$wp1="【圣灵战靴Ⅰ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=6715;//装备攻击
$wp16=6715;//装备魔攻
$wp17=6774;//装备防御
//需要修改的变量
$wp18=42;//装备冰攻
$wp19=42;//装备火攻
$wp20=42;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



							} elseif($npcc ==517){
//需要修改的变量

$wp1="【圣灵项链Ⅰ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=6884;//装备攻击
$wp16=6884;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=42;//装备冰攻
$wp19=42;//装备火攻
$wp20=42;//装备雷攻
//需要修改的变量

$wp21=42;//装备冰防
$wp22=42;//装备火防
$wp23=42;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==518){
//需要修改的变量

$wp1="【圣灵手镯Ⅰ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7284;//装备攻击
$wp16=7284;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=42;//装备冰攻
$wp19=42;//装备火攻
$wp20=42;//装备雷攻
//需要修改的变量

$wp21=42;//装备冰防
$wp22=42;//装备火防
$wp23=42;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



	} elseif($npcc ==519){
		
	//需要修改的变量

$wp1="【圣灵枪Ⅰ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10015;//装备攻击
$wp16=10015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=42;//装备冰攻
$wp19=42;//装备火攻
$wp20=42;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
} elseif($npcc ==520){
//需要修改的变量

$wp1="【圣灵叉Ⅰ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10015;//装备攻击
$wp16=10015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=42;//装备冰攻
$wp19=42;//装备火攻
$wp20=42;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
				} elseif($npcc ==521){
//需要修改的变量

$wp1="【圣灵棍Ⅰ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10015;//装备攻击
$wp16=10015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=42;//装备冰攻
$wp19=42;//装备火攻
$wp20=42;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类		
					} elseif($npcc ==522){
//需要修改的变量

$wp1="【圣灵仗Ⅰ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10015;//装备攻击
$wp16=10015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=42;//装备冰攻
$wp19=42;//装备火攻
$wp20=42;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==523){
//需要修改的变量

$wp1="【圣灵剑Ⅰ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10015;//装备攻击
$wp16=10015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=42;//装备冰攻
$wp19=42;//装备火攻
$wp20=42;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	


} elseif($npcc ==524){
//需要修改的变量

$wp1="【圣灵战甲ⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=7125;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=44;//装备冰防
$wp22=44;//装备火防
$wp23=44;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
					} elseif($npcc ==525){
//需要修改的变量

$wp1="【圣灵战盔ⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=8815;//装备攻击
$wp16=8815;//装备魔攻
$wp17=8815;//装备防御
//需要修改的变量
$wp18=44;//装备冰攻
$wp19=44;//装备火攻
$wp20=44;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
					} elseif($npcc ==526){
//需要修改的变量

$wp1="【圣灵战靴ⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7315;//装备攻击
$wp16=7315;//装备魔攻
$wp17=7374;//装备防御
//需要修改的变量
$wp18=44;//装备冰攻
$wp19=44;//装备火攻
$wp20=44;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



							} elseif($npcc ==527){
//需要修改的变量

$wp1="【圣灵项链ⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7484;//装备攻击
$wp16=7484;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=44;//装备冰攻
$wp19=44;//装备火攻
$wp20=44;//装备雷攻
//需要修改的变量

$wp21=44;//装备冰防
$wp22=44;//装备火防
$wp23=44;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==528){
//需要修改的变量

$wp1="【圣灵手镯ⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7884;//装备攻击
$wp16=7884;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=44;//装备冰攻
$wp19=44;//装备火攻
$wp20=44;//装备雷攻
//需要修改的变量

$wp21=44;//装备冰防
$wp22=44;//装备火防
$wp23=44;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



	} elseif($npcc ==529){
		
	//需要修改的变量

$wp1="【圣灵枪ⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10615;//装备攻击
$wp16=10615;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=44;//装备冰攻
$wp19=44;//装备火攻
$wp20=44;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
			} elseif($npcc ==530){
//需要修改的变量

$wp1="【圣灵叉ⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10615;//装备攻击
$wp16=10615;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=44;//装备冰攻
$wp19=44;//装备火攻
$wp20=44;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
				} elseif($npcc ==531){
//需要修改的变量

$wp1="【圣灵棍ⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10615;//装备攻击
$wp16=10615;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=44;//装备冰攻
$wp19=44;//装备火攻
$wp20=44;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类		
					} elseif($npcc ==532){
//需要修改的变量

$wp1="【圣灵仗ⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10615;//装备攻击
$wp16=10615;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=44;//装备冰攻
$wp19=44;//装备火攻
$wp20=44;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==533){
//需要修改的变量

$wp1="【圣灵剑ⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10615;//装备攻击
$wp16=10615;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=44;//装备冰攻
$wp19=44;//装备火攻
$wp20=44;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	


} elseif($npcc ==534){
//需要修改的变量

$wp1="【圣灵战甲ⅠⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=8025;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=45;//装备冰防
$wp22=45;//装备火防
$wp23=45;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
					} elseif($npcc ==535){
//需要修改的变量

$wp1="【圣灵战盔ⅠⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=9415;//装备攻击
$wp16=9415;//装备魔攻
$wp17=9415;//装备防御
//需要修改的变量
$wp18=45;//装备冰攻
$wp19=45;//装备火攻
$wp20=45;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
					} elseif($npcc ==536){
//需要修改的变量

$wp1="【圣灵战靴ⅠⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7315;//装备攻击
$wp16=7315;//装备魔攻
$wp17=7374;//装备防御
//需要修改的变量
$wp18=45;//装备冰攻
$wp19=45;//装备火攻
$wp20=45;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



							} elseif($npcc ==537){
//需要修改的变量

$wp1="【圣灵项链ⅠⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=8084;//装备攻击
$wp16=8084;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=45;//装备冰攻
$wp19=45;//装备火攻
$wp20=45;//装备雷攻
//需要修改的变量

$wp21=45;//装备冰防
$wp22=45;//装备火防
$wp23=45;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==538){
//需要修改的变量

$wp1="【圣灵手镯ⅠⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=8484;//装备攻击
$wp16=8484;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=45;//装备冰攻
$wp19=45;//装备火攻
$wp20=45;//装备雷攻
//需要修改的变量

$wp21=45;//装备冰防
$wp22=45;//装备火防
$wp23=45;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



	} elseif($npcc ==539){
		
	//需要修改的变量

$wp1="【圣灵枪ⅠⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=11515;//装备攻击
$wp16=11515;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=45;//装备冰攻
$wp19=45;//装备火攻
$wp20=45;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
			} elseif($npcc ==540){
//需要修改的变量

$wp1="【圣灵叉ⅠⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=11515;//装备攻击
$wp16=11515;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=45;//装备冰攻
$wp19=45;//装备火攻
$wp20=45;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
				} elseif($npcc ==541){
//需要修改的变量

$wp1="【圣灵棍ⅠⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=11515;//装备攻击
$wp16=11515;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=45;//装备冰攻
$wp19=45;//装备火攻
$wp20=45;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类		
					} elseif($npcc ==542){
//需要修改的变量

$wp1="【圣灵仗ⅠⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=11515;//装备攻击
$wp16=11515;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=45;//装备冰攻
$wp19=45;//装备火攻
$wp20=45;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==543){
//需要修改的变量

$wp1="【圣灵剑ⅠⅠⅠ】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=11515;//装备攻击
$wp16=11515;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=45;//装备冰攻
$wp19=45;//装备火攻
$wp20=45;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==544){
//需要修改的变量

$wp1="【圣灵☯天元甲】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=9525;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
					} elseif($npcc ==545){
//需要修改的变量

$wp1="【圣灵☯天元盔】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10015;//装备攻击
$wp16=10015;//装备魔攻
$wp17=10015;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
					} elseif($npcc ==546){
//需要修改的变量

$wp1="【圣灵☯天元靴】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=8815;//装备攻击
$wp16=8815;//装备魔攻
$wp17=8874;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



							} elseif($npcc ==547){
//需要修改的变量

$wp1="【圣灵☯天元链】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10084;//装备攻击
$wp16=10084;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==548){
//需要修改的变量

$wp1="【圣灵☯天元镯】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=10084;//装备攻击
$wp16=10084;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



	} elseif($npcc ==549){
		
	//需要修改的变量

$wp1="【圣灵☯天元枪】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=13015;//装备攻击
$wp16=13015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
			} elseif($npcc ==550){
//需要修改的变量

$wp1="【圣灵☯天元叉】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=13015;//装备攻击
$wp16=13015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
				} elseif($npcc ==551){
//需要修改的变量

$wp1="【圣灵☯天元棍】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=13015;//装备攻击
$wp16=13015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类		
					} elseif($npcc ==552){
//需要修改的变量

$wp1="【圣灵☯天元仗】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=13015;//装备攻击
$wp16=13015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==553){
//需要修改的变量

$wp1="【圣灵☯天元剑】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=13015;//装备攻击
$wp16=13015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	



} elseif($npcc ==554){
//需要修改的变量
$wp1="【海枯石烂】（婚戒）";//装备名字
$wp2="【海枯石烂】（婚戒）象征着彼此相爱恋人的信物";//装备描述
//需要修改的变量
$wp14=14258;//装备hp
$wp15=4652;//装备攻击
$wp16=4652;//装备魔攻
$wp17=4045;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量
$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量
$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=9;//装备分类

} elseif($npcc ==555){
//需要修改的变量
$wp1="【海枯石烂】（婚链）";//装备名字
$wp2="【海枯石烂】（婚链）象征着彼此相爱恋人的信物";//装备描述
//需要修改的变量
$wp14=14258;//装备hp
$wp15=4652;//装备攻击
$wp16=4652;//装备魔攻
$wp17=4045;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量
$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量
$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=10;//装备分类



} elseif($npcc ==556){
//需要修改的变量
$wp1="【天作之合】（婚戒）";//装备名字
$wp2="【天作之合】（婚戒）象征着彼此相爱恋人的信物";//装备描述
//需要修改的变量
$wp14=15058;//装备hp
$wp15=5052;//装备攻击
$wp16=5052;//装备魔攻
$wp17=4676;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=9;//装备分类

} elseif($npcc ==557){
//需要修改的变量
$wp1="【天作之合】（婚链）";//装备名字
$wp2="【天作之合】（婚链）象征着彼此相爱恋人的信物";//装备描述
//需要修改的变量
$wp14=15058;//装备hp
$wp15=5052;//装备攻击
$wp16=5052;//装备魔攻
$wp17=4676;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=10;//装备分类



} elseif($npcc ==558){
//需要修改的变量
$wp1="【一生所爱の婚戒】（典藏版）";//装备名字
$wp2="【一生所爱の婚戒】（典藏版）挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=30000;//装备hp
$wp15=10000;//装备攻击
$wp16=10000;//装备魔攻
$wp17=10000;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=9;//装备分类

} elseif($npcc ==559){
//需要修改的变量
$wp1="【一生所爱の婚链】（典藏版）";//装备名字
$wp2="【一生所爱の婚链】（典藏版）挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=30000;//装备hp
$wp15=10000;//装备攻击
$wp16=10000;//装备魔攻
$wp17=10000;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=10;//装备分类

} elseif($npcc ==560){
//需要修改的变量
$wp1="【恋人未满の婚戒】（靛蓝版）";//装备名字
$wp2="【恋人未满の婚戒】（靛蓝版）挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=30000;//装备hp
$wp15=5052;//装备攻击
$wp16=10000;//装备魔攻
$wp17=10000;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=9;//装备分类

} elseif($npcc ==561){
//需要修改的变量
$wp1="【恋人未满の婚链】（靛蓝版）";//装备名字
$wp2="【恋人未满の婚链】（靛蓝版）挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=30000;//装备hp
$wp15=5052;//装备攻击
$wp16=10000;//装备魔攻
$wp17=10000;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=10;//装备分类







} elseif($npcc ==562){
//需要修改的变量
$wp1="【镇东神兽】青龙☯仙";//装备名字
$wp2="【镇东神兽】青龙☯仙-十分威风的仙品坐骑";//装备描述

$wp14=41555;//装备hp
$wp15=5522;//装备攻击
$wp16=5522;//装备魔攻
$wp17=4159;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类


} elseif($npcc ==563){



//需要修改的变量

$wp1="【镇东神兽】白虎☯仙";//装备名字
$wp2="【镇东神兽】白虎☯仙-十分威风的仙品坐骑";//装备描述
//需要修改的变量

$wp14=12888;//装备hp
$wp15=7859;//装备攻击
$wp16=5522;//装备魔攻
$wp17=4159;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类

} elseif($npcc ==564){



//需要修改的变量

$wp1="【镇东神兽】朱雀☯仙";//装备名字
$wp2="【镇东神兽】朱雀☯仙-十分威风的仙品坐骑";//装备描述
//需要修改的变量

$wp14=12888;//装备hp
$wp15=5522;//装备攻击
$wp16=7859;//装备魔攻
$wp17=4159;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类





} elseif($npcc ==565){



//需要修改的变量

$wp1="【镇东神兽】玄武☯仙";//装备名字
$wp2="【镇东神兽】玄武☯仙-十分威风的仙品坐骑";//装备描述
//需要修改的变量
$wp14=12888;//装备hp
$wp15=5522;//装备攻击
$wp16=5522;//装备魔攻
$wp17=7842;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量
$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类





} elseif($npcc ==566){
//需要修改的变量
$wp1="【筋斗云】☯（血）";//装备名字
$wp2="【筋斗云】☯（血）身披金甲圣衣、驾着七彩祥云";//装备描述

$wp14=51555;//装备hp
$wp15=6522;//装备攻击
$wp16=6522;//装备魔攻
$wp17=5159;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类


} elseif($npcc ==567){



//需要修改的变量

$wp1="【筋斗云】☯（攻）";//装备名字
$wp2="【筋斗云】☯（攻）身披金甲圣衣、驾着七彩祥云";//装备描述
//需要修改的变量

$wp14=15999;//装备hp
$wp15=8859;//装备攻击
$wp16=6522;//装备魔攻
$wp17=5159;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类

} elseif($npcc ==568){



//需要修改的变量

$wp1="【筋斗云】☯（魔）";//装备名字
$wp2="【筋斗云】☯（魔）身披金甲圣衣、驾着七彩祥云";//装备描述
//需要修改的变量

$wp14=15999;//装备hp
$wp15=6522;//装备攻击
$wp16=8859;//装备魔攻
$wp17=5159;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类





} elseif($npcc ==569){



//需要修改的变量

$wp1="【筋斗云】☯（防）";//装备名字
$wp2="【筋斗云】☯（防）身披金甲圣衣、驾着七彩祥云";//装备描述
//需要修改的变量
$wp14=15999;//装备hp
$wp15=6522;//装备攻击
$wp16=6522;//装备魔攻
$wp17=8842;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类














} elseif($npcc ==570){



//需要修改的变量

$wp1="【侠士披风】";//装备名字
$wp2="侠士常用的披风解释耐用";//装备描述

//需要修改的变量
$wp14=0;//装备hp
$wp15=2155;//装备攻击
$wp16=2155;//装备魔攻
$wp17=2015;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=11;//装备分类






} elseif($npcc ==572){



//需要修改的变量

$wp1="【锦缎披风】";//装备名字
$wp2="锦缎所制，纹理细密，价值不菲";//装备描述

//需要修改的变量
$wp14=0;//装备hp
$wp15=3125;//装备攻击
$wp16=3125;//装备魔攻
$wp17=2458;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=11;//装备分类




} elseif($npcc ==573){



//需要修改的变量

$wp1="【恶魔披风】";//装备名字
$wp2="用恶魔的鲜血铸造而成";//装备描述

//需要修改的变量
$wp14=0;//装备hp
$wp15=3758;//装备攻击
$wp16=3758;//装备魔攻
$wp17=3058;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=11;//装备分类


} elseif($npcc ==574){



//需要修改的变量

$wp1="【王者披风】";//装备名字
$wp2="一代绝世王者的披风";//装备描述

//需要修改的变量
$wp14=0;//装备hp
$wp15=4258;//装备攻击
$wp16=4258;//装备魔攻
$wp17=3788;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=11;//装备分类

} elseif($npcc ==575){



//需要修改的变量

$wp1="【金甲披风】";//装备名字
$wp2="战无不胜，光彩依旧";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=5058;//装备攻击
$wp16=5058;//装备魔攻
$wp17=4888;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=11;//装备分类

} elseif($npcc ==576){



//需要修改的变量

$wp1="【大圣披风】";//装备名字
$wp2="仙气环绕，光彩夺目，非凡间之物，极为少有";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=6099;//装备攻击
$wp16=6099;//装备魔攻
$wp17=5725;//装备防御
//需要修改的变量
$wp18=35;//装备冰攻
$wp19=35;//装备火攻
$wp20=35;//装备雷攻
//需要修改的变量

$wp21=35;//装备冰防
$wp22=35;//装备火防
$wp23=35;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=11;//装备分类



} elseif($npcc ==577){



//需要修改的变量

$wp1="【冠绝天下】（典藏版）";//装备名字
$wp2="千金难觅,更是世间少有";//装备描述
//需要修改的变量
$wp14=8888;//装备hp
$wp15=8888;//装备攻击
$wp16=8888;//装备魔攻
$wp17=8888;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=11;//装备分类


} elseif($npcc ==578){
//需要修改的变量

$wp1="【噬魂仙甲】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=12258;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=60;//装备冰防
$wp22=60;//装备火防
$wp23=60;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
					} elseif($npcc ==579){
//需要修改的变量

$wp1="【噬魂仙盔】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=12584;//装备攻击
$wp16=12584;//装备魔攻
$wp17=12584;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
					} elseif($npcc ==580){
//需要修改的变量

$wp1="【噬魂仙靴】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=11587;//装备攻击
$wp16=11587;//装备魔攻
$wp17=11587;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



							} elseif($npcc ==581){
//需要修改的变量

$wp1="【噬魂仙链】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=12584;//装备攻击
$wp16=12584;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量

$wp21=60;//装备冰防
$wp22=60;//装备火防
$wp23=60;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==582){
//需要修改的变量

$wp1="【噬魂仙镯】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=12458;//装备攻击
$wp16=12458;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量

$wp21=60;//装备冰防
$wp22=60;//装备火防
$wp23=60;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



	} elseif($npcc ==583){
		
	//需要修改的变量

$wp1="【噬魂仙枪】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=15015;//装备攻击
$wp16=15015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
			} elseif($npcc ==584){
//需要修改的变量

$wp1="【噬魂仙叉】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=15015;//装备攻击
$wp16=15015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
				} elseif($npcc ==585){
//需要修改的变量

$wp1="【噬魂仙棍】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=15015;//装备攻击
$wp16=15015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类		
					} elseif($npcc ==586){
//需要修改的变量

$wp1="【噬魂仙杖】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=15015;//装备攻击
$wp16=15015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==587){
//需要修改的变量

$wp1="【噬魂仙剑】";//装备名字
$wp2="传说诸神大战后留下的极品装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=15015;//装备攻击
$wp16=15015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	



} elseif($npcc ==588){
//需要修改的变量
$wp1="【缘定今生の婚戒】（典藏版）";//装备名字
$wp2="【缘定今生の婚戒】（典藏版）挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=50000;//装备hp
$wp15=20000;//装备攻击
$wp16=20000;//装备魔攻
$wp17=20000;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=9;//装备分类

} elseif($npcc ==589){
//需要修改的变量
$wp1="【缘定今生の婚链】（典藏版）";//装备名字
$wp2="【缘定今生の婚链】（典藏版）挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=50000;//装备hp
$wp15=20000;//装备攻击
$wp16=20000;//装备魔攻
$wp17=20000;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=10;//装备分类


} elseif($npcc ==590){
//需要修改的变量
$wp1="【天赐良缘の婚戒】";//装备名字
$wp2="【天赐良缘の婚戒】挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=50000;//装备hp
$wp15=20000;//装备攻击
$wp16=20000;//装备魔攻
$wp17=20000;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=9;//装备分类

} elseif($npcc ==591){
//需要修改的变量
$wp1="【天赐良缘の婚链】";//装备名字
$wp2="【天赐良缘の婚链】挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=50000;//装备hp
$wp15=20000;//装备攻击
$wp16=20000;//装备魔攻
$wp17=20000;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=10;//装备分类


} elseif($npcc ==592){



//需要修改的变量

$wp1="【玄☯仙披风】";//装备名字
$wp2="仙气环绕，光彩夺目，非凡间之物，极为少有";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=10245;//装备攻击
$wp16=10245;//装备魔攻
$wp17=9451;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=11;//装备分类











} elseif($npcc ==593){
//需要修改的变量

$wp1="【帝王仙甲】";//装备名字
$wp2="西游小皇帝专属装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=15258;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=70;//装备冰防
$wp22=70;//装备火防
$wp23=70;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
					} elseif($npcc ==594){
//需要修改的变量

$wp1="【帝王仙盔】";//装备名字
$wp2="西游小皇帝专属装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=15584;//装备攻击
$wp16=15584;//装备魔攻
$wp17=15584;//装备防御
//需要修改的变量
$wp18=70;//装备冰攻
$wp19=70;//装备火攻
$wp20=70;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
					} elseif($npcc ==595){
//需要修改的变量

$wp1="【帝王仙靴】";//装备名字
$wp2="西游小皇帝专属装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=15587;//装备攻击
$wp16=15587;//装备魔攻
$wp17=15587;//装备防御
//需要修改的变量
$wp18=70;//装备冰攻
$wp19=70;//装备火攻
$wp20=70;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



							} elseif($npcc ==596){
//需要修改的变量

$wp1="【帝王仙链】";//装备名字
$wp2="西游小皇帝专属装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=15584;//装备攻击
$wp16=15584;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=70;//装备冰攻
$wp19=70;//装备火攻
$wp20=70;//装备雷攻
//需要修改的变量

$wp21=70;//装备冰防
$wp22=70;//装备火防
$wp23=70;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==597){
//需要修改的变量

$wp1="【帝王仙镯】";//装备名字
$wp2="西游小皇帝专属装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=15458;//装备攻击
$wp16=15458;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=70;//装备冰攻
$wp19=70;//装备火攻
$wp20=70;//装备雷攻
//需要修改的变量

$wp21=70;//装备冰防
$wp22=70;//装备火防
$wp23=70;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



	} elseif($npcc ==598){
		
	//需要修改的变量

$wp1="【帝王仙枪】";//装备名字
$wp2="西游小皇帝专属装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=19015;//装备攻击
$wp16=19015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=70;//装备冰攻
$wp19=70;//装备火攻
$wp20=70;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
			} elseif($npcc ==599){
//需要修改的变量

$wp1="【帝王仙叉】";//装备名字
$wp2="西游小皇帝专属装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=19015;//装备攻击
$wp16=19015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=70;//装备冰攻
$wp19=70;//装备火攻
$wp20=70;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
				} elseif($npcc ==600){
//需要修改的变量

$wp1="【帝王仙棍】";//装备名字
$wp2="西游小皇帝专属装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=19015;//装备攻击
$wp16=19015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=70;//装备冰攻
$wp19=70;//装备火攻
$wp20=70;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类		




















} else{

echo "<font color=black>没有这个装备id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}

?>




