 <?php

	

if($npcc==101){

//需要修改的变量

$wp1="【幻想战甲】";//装备名字
$wp2="幻想绝版套装之战甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2985;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量

$wp24=50;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类


} elseif($npcc ==102){



//需要修改的变量

$wp1="〖玄冰头盔〗";//装备名字
$wp2="初级头盔";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=33;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=1;//装备冰防
$wp22=1;//装备火防
$wp23=1;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类


} elseif($npcc ==103){



//需要修改的变量

$wp1="〖仙魂头盔〗";//装备名字
$wp2="仙魂套装之--头盔！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=200;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=10;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类

} elseif($npcc ==104){



//需要修改的变量

$wp1="【白虎头盔】";//装备名字
$wp2="白虎套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=228;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=5;//装备分类

} elseif($npcc ==105){



//需要修改的变量

$wp1="【七星头盔】";//装备名字
$wp2="七星套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=228;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=5;//装备分类




} elseif($npcc ==106){



//需要修改的变量

$wp1="【龙鳞头盔】";//装备名字
$wp2="龙鳞套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=228;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=5;//装备分类



} elseif($npcc ==107){



//需要修改的变量

$wp1="【伏虎头盔】";//装备名字
$wp2="伏虎套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=228;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=5;//装备分类


} elseif($npcc ==108){



//需要修改的变量

$wp1="【碧海头盔】";//装备名字
$wp2="碧海套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=228;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=5;//装备分类



} elseif($npcc ==109){



//需要修改的变量

$wp1="【白虎笑傲盔】";//装备名字
$wp2="白虎笑傲套之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=253;//装备攻击
$wp16=0;//装备魔攻
$wp17=535;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=5;//装备分类

} elseif($npcc ==110){



//需要修改的变量

$wp1="【七星逐月盔】";//装备名字
$wp2="七星逐月套之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=253;//装备攻击
$wp16=0;//装备魔攻
$wp17=535;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=5;//装备分类




} elseif($npcc ==111){



//需要修改的变量

$wp1="【龙鳞破天盔】";//装备名字
$wp2="龙鳞破天套之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=253;//装备攻击
$wp16=0;//装备魔攻
$wp17=535;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=5;//装备分类



} elseif($npcc ==112){



//需要修改的变量

$wp1="【伏虎降龙盔】";//装备名字
$wp2="伏虎降龙套之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=253;//装备攻击
$wp16=0;//装备魔攻
$wp17=535;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=5;//装备分类


} elseif($npcc ==113){



//需要修改的变量

$wp1="【碧海青天盔】";//装备名字
$wp2="白虎笑傲套之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=253;//装备攻击
$wp16=0;//装备魔攻
$wp17=535;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=5;//装备分类



} elseif($npcc ==114){



//需要修改的变量

$wp1="【玄武头盔】";//装备名字
$wp2="玄武套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=311;//装备攻击
$wp16=0;//装备魔攻
$wp17=735;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=5;//装备分类

} elseif($npcc ==115){



//需要修改的变量

$wp1="【无极头盔】";//装备名字
$wp2="无极套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=311;//装备攻击
$wp16=0;//装备魔攻
$wp17=735;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=5;//装备分类




} elseif($npcc ==116){



//需要修改的变量

$wp1="【青龙头盔】";//装备名字
$wp2="青龙套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=311;//装备攻击
$wp16=0;//装备魔攻
$wp17=735;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=5;//装备分类



} elseif($npcc ==117){



//需要修改的变量

$wp1="【金刚头盔】";//装备名字
$wp2="金刚套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=311;//装备攻击
$wp16=0;//装备魔攻
$wp17=735;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=5;//装备分类


} elseif($npcc ==118){



//需要修改的变量

$wp1="【银沙头盔】";//装备名字
$wp2="玄武套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=311;//装备攻击
$wp16=0;//装备魔攻
$wp17=735;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=5;//装备分类





} elseif($npcc ==119){



//需要修改的变量

$wp1="【玄武撼地盔】";//装备名字
$wp2="玄武撼地套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=510;//装备攻击
$wp16=0;//装备魔攻
$wp17=1135;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=5;//装备分类

} elseif($npcc ==120){



//需要修改的变量

$wp1="【无极无道盔】";//装备名字
$wp2="无极无道套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=510;//装备攻击
$wp16=0;//装备魔攻
$wp17=1135;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=5;//装备分类




} elseif($npcc ==121){



//需要修改的变量

$wp1="【青龙在天盔】";//装备名字
$wp2="青龙在天套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=510;//装备攻击
$wp16=0;//装备魔攻
$wp17=1135;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=5;//装备分类



} elseif($npcc ==122){



//需要修改的变量

$wp1="【怒目金刚盔】";//装备名字
$wp2="怒目金刚套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=510;//装备攻击
$wp16=0;//装备魔攻
$wp17=1135;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=5;//装备分类


} elseif($npcc ==123){



//需要修改的变量

$wp1="【银沙瀚海盔】";//装备名字
$wp2="银沙瀚海套装之盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=510;//装备攻击
$wp16=0;//装备魔攻
$wp17=1135;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=5;//装备分类




} elseif($npcc ==124){



//需要修改的变量

$wp1="【朱雀头盔】";//装备名字
$wp2="朱雀套装之头盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1138;//装备攻击
$wp16=0;//装备魔攻
$wp17=2758;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=5;//装备分类

} elseif($npcc ==125){



//需要修改的变量

$wp1="【太乙头盔】";//装备名字
$wp2="太乙套装之头盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1138;//装备攻击
$wp16=0;//装备魔攻
$wp17=2758;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=5;//装备分类




} elseif($npcc ==126){



//需要修改的变量

$wp1="【天龙头盔】";//装备名字
$wp2="天龙套装之头盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1138;//装备攻击
$wp16=0;//装备魔攻
$wp17=2758;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=5;//装备分类



} elseif($npcc ==127){



//需要修改的变量

$wp1="【罗汉头盔】";//装备名字
$wp2="罗汉套装之头盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1138;//装备攻击
$wp16=0;//装备魔攻
$wp17=2758;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=5;//装备分类


} elseif($npcc ==128){



//需要修改的变量

$wp1="【奔月头盔】";//装备名字
$wp2="奔月套装之头盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1138;//装备攻击
$wp16=0;//装备魔攻
$wp17=2758;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=5;//装备分类













} elseif($npcc ==129){



//需要修改的变量

$wp1="〖旱魃鬼面〗";//装备名字
$wp2="旱魃用过的头盔！(可在长安装备锻造商处进行升级)";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=937;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类
} elseif($npcc ==130){



//需要修改的变量

$wp1="【旱魃鬼面】";//装备名字
$wp2="旱魃用过的头盔！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1638;//装备攻击
$wp16=1638;//装备魔攻
$wp17=3076;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类


} elseif($npcc ==131){



//需要修改的变量

$wp1="【巨灵头盔】";//装备名字
$wp2="传说中的大巨灵装备，你值得拥有！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=4565;//装备攻击
$wp16=4565;//装备魔攻
$wp17=3345;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类








} elseif($npcc ==132){



//需要修改的变量

$wp1="〖雷皇战盔〗";//装备名字
$wp2="雷皇套装之一";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=158;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类


} elseif($npcc ==133){



//需要修改的变量

$wp1="【幻想战盔】";//装备名字
$wp2="幻想绝版套装之战盔！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3752;//装备攻击
$wp16=3752;//装备魔攻
$wp17=2784;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量

$wp24=50;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类


} elseif($npcc ==134){



//需要修改的变量

$wp1="〖玄冰战靴〗";//装备名字
$wp2="初级战靴";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=23;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=1;//装备冰防
$wp22=1;//装备火防
$wp23=1;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类

} elseif($npcc ==135){



//需要修改的变量

$wp1="〖仙魂战靴〗";//装备名字
$wp2="仙魂套装之--战靴！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=180;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=10;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==136){



//需要修改的变量

$wp1="【白虎战靴】";//装备名字
$wp2="白虎套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=230;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=6;//装备分类

} elseif($npcc ==137){



//需要修改的变量

$wp1="【七星战靴】";//装备名字
$wp2="七星套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=230;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==138){



//需要修改的变量

$wp1="【龙鳞战靴】";//装备名字
$wp2="龙鳞套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=230;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=6;//装备分类



} elseif($npcc ==139){



//需要修改的变量

$wp1="【伏虎战靴】";//装备名字
$wp2="伏虎套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=230;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==140){



//需要修改的变量

$wp1="【碧海战靴】";//装备名字
$wp2="碧海套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=230;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==141){



//需要修改的变量

$wp1="【白虎笑傲靴】";//装备名字
$wp2="白虎笑傲套之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=369;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=6;//装备分类

} elseif($npcc ==142){



//需要修改的变量

$wp1="【七星逐月靴】";//装备名字
$wp2="七星逐月套之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=369;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==143){



//需要修改的变量

$wp1="【龙鳞破天靴】";//装备名字
$wp2="龙鳞破天套之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=369;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=6;//装备分类



} elseif($npcc ==144){



//需要修改的变量

$wp1="【伏虎降龙靴】";//装备名字
$wp2="伏虎降龙套之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=369;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==145){



//需要修改的变量

$wp1="【碧海青天靴】";//装备名字
$wp2="碧海青天套之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=369;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=6;//装备分类





} elseif($npcc ==146){



//需要修改的变量

$wp1="【玄武战靴】";//装备名字
$wp2="玄武套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=580;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=6;//装备分类

} elseif($npcc ==147){



//需要修改的变量

$wp1="【无极战靴】";//装备名字
$wp2="无极套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=580;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==148){



//需要修改的变量

$wp1="【青龙战靴】";//装备名字
$wp2="青龙套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=580;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=6;//装备分类



} elseif($npcc ==149){



//需要修改的变量

$wp1="【金刚战靴】";//装备名字
$wp2="金刚套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=580;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==150){



//需要修改的变量

$wp1="【银沙战靴】";//装备名字
$wp2="银沙套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=580;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=6;//装备分类




} elseif($npcc ==151){



//需要修改的变量

$wp1="【玄武撼地靴】";//装备名字
$wp2="玄武撼地套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1076;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=6;//装备分类

} elseif($npcc ==152){



//需要修改的变量

$wp1="【无极无道靴】";//装备名字
$wp2="无极无道套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1076;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==153){



//需要修改的变量

$wp1="【青龙在天靴】";//装备名字
$wp2="青龙在天套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1076;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=6;//装备分类



} elseif($npcc ==154){



//需要修改的变量

$wp1="【怒目金刚靴】";//装备名字
$wp2="怒目金刚套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1076;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==155){



//需要修改的变量

$wp1="【银沙瀚海靴】";//装备名字
$wp2="银沙瀚海套装之靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1076;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=6;//装备分类




} elseif($npcc ==156){



//需要修改的变量

$wp1="【朱雀战靴】";//装备名字
$wp2="朱雀套装之战靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2463;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=6;//装备分类

} elseif($npcc ==157){



//需要修改的变量

$wp1="【太乙战靴】";//装备名字
$wp2="太乙套装之战靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2463;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==158){



//需要修改的变量

$wp1="【天龙战靴】";//装备名字
$wp2="天龙套装之战靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2463;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=6;//装备分类



} elseif($npcc ==159){



//需要修改的变量

$wp1="【罗汉战靴】";//装备名字
$wp2="罗汉套装之战靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2463;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==160){



//需要修改的变量

$wp1="【奔月战靴】";//装备名字
$wp2="奔月战套装之战靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2463;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=6;//装备分类



















} elseif($npcc ==161){



//需要修改的变量

$wp1="〖神皇之靴〗";//装备名字
$wp2="战神神皇用过的靴子！(可在长安装备锻造商处进行升级)";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=895;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==162){



//需要修改的变量

$wp1="【神皇之靴】";//装备名字
$wp2="战神神皇用过的靴子！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2654;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==163){



//需要修改的变量

$wp1="【巨灵战靴】";//装备名字
$wp2="传说中的大巨灵装备，你值得拥有！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3656;//装备攻击
$wp16=3656;//装备魔攻
$wp17=3656;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类

} elseif($npcc ==164){



//需要修改的变量

$wp1="〖雷皇战靴〗";//装备名字
$wp2="雷皇套装之一";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=152;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类



} elseif($npcc ==165){



//需要修改的变量

$wp1="【幻想战靴】";//装备名字
$wp2="幻想绝版套装之战靴！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2563;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量

$wp24=50;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类


} elseif($npcc ==166){



//需要修改的变量

$wp1="〖玄冰项链〗";//装备名字
$wp2="初级项链";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=39;//装备攻击
$wp16=39;//装备魔攻
$wp17=29;//装备防御
//需要修改的变量
$wp18=1;//装备冰攻
$wp19=1;//装备火攻
$wp20=1;//装备雷攻
//需要修改的变量

$wp21=1;//装备冰防
$wp22=1;//装备火防
$wp23=1;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==167){



//需要修改的变量

$wp1="〖仙魂之怒〗";//装备名字
$wp2="仙魂套装之--项链！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=110;//装备攻击
$wp16=110;//装备魔攻
$wp17=98;//装备防御
//需要修改的变量
$wp18=2;//装备冰攻
$wp19=2;//装备火攻
$wp20=2;//装备雷攻
//需要修改的变量

$wp21=2;//装备冰防
$wp22=2;//装备火防
$wp23=2;//装备雷防
//需要修改的变量

$wp24=10;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==168){



//需要修改的变量

$wp1="【白虎项链】";//装备名字
$wp2="白虎套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=211;//装备攻击
$wp16=211;//装备魔攻
$wp17=198;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==169){



//需要修改的变量

$wp1="【七星项链】";//装备名字
$wp2="七星套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=211;//装备攻击
$wp16=211;//装备魔攻
$wp17=198;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==170){



//需要修改的变量

$wp1="【龙鳞项链】";//装备名字
$wp2="龙鳞套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=211;//装备攻击
$wp16=211;//装备魔攻
$wp17=198;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==171){



//需要修改的变量

$wp1="【伏虎项链】";//装备名字
$wp2="伏虎套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=211;//装备攻击
$wp16=211;//装备魔攻
$wp17=198;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==172){



//需要修改的变量

$wp1="【碧海项链】";//装备名字
$wp2="碧海套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=211;//装备攻击
$wp16=211;//装备魔攻
$wp17=198;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==173){



//需要修改的变量

$wp1="【白虎笑傲项链】";//装备名字
$wp2="白虎笑傲套之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=458;//装备攻击
$wp16=458;//装备魔攻
$wp17=325;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==174){



//需要修改的变量

$wp1="【七星逐月项链】";//装备名字
$wp2="七星逐月套之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=458;//装备攻击
$wp16=458;//装备魔攻
$wp17=325;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==175){



//需要修改的变量

$wp1="【龙鳞破天项链】";//装备名字
$wp2="龙鳞破天套之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=458;//装备攻击
$wp16=458;//装备魔攻
$wp17=325;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==176){



//需要修改的变量

$wp1="【伏虎降龙项链】";//装备名字
$wp2="伏虎降龙套之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=458;//装备攻击
$wp16=458;//装备魔攻
$wp17=325;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==177){



//需要修改的变量

$wp1="【碧海青天项链】";//装备名字
$wp2="碧海青天套之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=458;//装备攻击
$wp16=458;//装备魔攻
$wp17=325;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==178){



//需要修改的变量

$wp1="【玄武项链】";//装备名字
$wp2="玄武套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=765;//装备攻击
$wp16=765;//装备魔攻
$wp17=886;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==179){



//需要修改的变量

$wp1="【无极项链】";//装备名字
$wp2="无极套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=765;//装备攻击
$wp16=765;//装备魔攻
$wp17=886;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==180){



//需要修改的变量

$wp1="【青龙项链】";//装备名字
$wp2="青龙套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=765;//装备攻击
$wp16=765;//装备魔攻
$wp17=886;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==181){



//需要修改的变量

$wp1="【金刚项链】";//装备名字
$wp2="金刚套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=765;//装备攻击
$wp16=765;//装备魔攻
$wp17=886;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==182){



//需要修改的变量

$wp1="【银沙项链】";//装备名字
$wp2="银沙套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=765;//装备攻击
$wp16=765;//装备魔攻
$wp17=886;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==183){



//需要修改的变量

$wp1="【玄武撼地项链】";//装备名字
$wp2="玄武撼地套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1087;//装备攻击
$wp16=1087;//装备魔攻
$wp17=1285;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==184){



//需要修改的变量

$wp1="【无极无道项链】";//装备名字
$wp2="无极无道套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1087;//装备攻击
$wp16=1087;//装备魔攻
$wp17=1285;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==185){



//需要修改的变量

$wp1="【青龙在天项链】";//装备名字
$wp2="青龙在天套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1087;//装备攻击
$wp16=1087;//装备魔攻
$wp17=1285;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==186){



//需要修改的变量

$wp1="【怒目金刚项链】";//装备名字
$wp2="怒目金刚套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1087;//装备攻击
$wp16=1087;//装备魔攻
$wp17=1285;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==187){



//需要修改的变量

$wp1="【银沙瀚海项链】";//装备名字
$wp2="银沙瀚海套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1087;//装备攻击
$wp16=1087;//装备魔攻
$wp17=1285;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==188){



//需要修改的变量

$wp1="【朱雀项链】";//装备名字
$wp2="朱雀套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1987;//装备攻击
$wp16=1987;//装备魔攻
$wp17=2213;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==189){



//需要修改的变量

$wp1="【太乙项链】";//装备名字
$wp2="太乙套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1987;//装备攻击
$wp16=1987;//装备魔攻
$wp17=2213;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==190){



//需要修改的变量

$wp1="【天龙项链】";//装备名字
$wp2="天龙套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1987;//装备攻击
$wp16=1987;//装备魔攻
$wp17=2213;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==191){



//需要修改的变量

$wp1="【罗汉项链】";//装备名字
$wp2="罗汉套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1987;//装备攻击
$wp16=1987;//装备魔攻
$wp17=2213;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==192){



//需要修改的变量

$wp1="【奔月项链】";//装备名字
$wp2="奔月套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1987;//装备攻击
$wp16=1987;//装备魔攻
$wp17=2213;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=7;//装备分类

} elseif($npcc ==193){



//需要修改的变量

$wp1="【共工护符】";//装备名字
$wp2="战神神皇用过的护符！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2134;//装备攻击
$wp16=2134;//装备魔攻
$wp17=2345;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==194){



//需要修改的变量

$wp1="【巨灵项链】";//装备名字
$wp2="传说中的大巨灵装备，你值得拥有！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3443;//装备攻击
$wp16=3443;//装备魔攻
$wp17=2767;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==195){



//需要修改的变量

$wp1="〖雷皇之怒〗";//装备名字
$wp2="雷皇套装之一";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=211;//装备攻击
$wp16=211;//装备魔攻
$wp17=195;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=4;//装备冰防
$wp22=4;//装备火防
$wp23=4;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类


} elseif($npcc ==196){



//需要修改的变量

$wp1="【幻想项链】";//装备名字
$wp2="幻想绝版套装之项链！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2688;//装备攻击
$wp16=2688;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量

$wp24=50;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类



} elseif($npcc ==197){



//需要修改的变量

$wp1="〖玄冰手镯〗";//装备名字
$wp2="初级手镯";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=28;//装备攻击
$wp16=28;//装备魔攻
$wp17=33;//装备防御
//需要修改的变量
$wp18=1;//装备冰攻
$wp19=1;//装备火攻
$wp20=1;//装备雷攻
//需要修改的变量

$wp21=1;//装备冰防
$wp22=1;//装备火防
$wp23=1;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类




} elseif($npcc ==198){



//需要修改的变量

$wp1="〖仙魂守护〗";//装备名字
$wp2="仙魂套装之--手镯！";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=99;//装备攻击
$wp16=99;//装备魔攻
$wp17=150;//装备防御
//需要修改的变量
$wp18=2;//装备冰攻
$wp19=2;//装备火攻
$wp20=2;//装备雷攻
//需要修改的变量

$wp21=2;//装备冰防
$wp22=2;//装备火防
$wp23=2;//装备雷防
//需要修改的变量

$wp24=10;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类




} elseif($npcc ==199){



//需要修改的变量

$wp1="【白虎手镯】";//装备名字
$wp2="白虎套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=268;//装备攻击
$wp16=268;//装备魔攻
$wp17=244;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=8;//装备分类


} elseif($npcc ==200){



//需要修改的变量

$wp1="【七星手镯】";//装备名字
$wp2="七星套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=268;//装备攻击
$wp16=268;//装备魔攻
$wp17=244;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=8;//装备分类



















} else{

echo "<font color=black>没有这个装备id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}

?>




