<?php

	

if($npcc ==201){



//需要修改的变量

$wp1="【龙鳞手镯】";//装备名字
$wp2="龙鳞套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=268;//装备攻击
$wp16=268;//装备魔攻
$wp17=244;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=8;//装备分类


} elseif($npcc ==202){



//需要修改的变量

$wp1="【伏虎手镯】";//装备名字
$wp2="伏虎套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=268;//装备攻击
$wp16=268;//装备魔攻
$wp17=244;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=8;//装备分类

} elseif($npcc ==203){



//需要修改的变量

$wp1="【碧海手镯】";//装备名字
$wp2="碧海套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=268;//装备攻击
$wp16=268;//装备魔攻
$wp17=244;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=8;//装备分类





} elseif($npcc ==204){



//需要修改的变量

$wp1="【白虎笑傲手镯】";//装备名字
$wp2="白虎笑傲套之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=510;//装备攻击
$wp16=510;//装备魔攻
$wp17=415;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=8;//装备分类


} elseif($npcc ==205){



//需要修改的变量

$wp1="【七星逐月手镯】";//装备名字
$wp2="七星逐月套之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=510;//装备攻击
$wp16=510;//装备魔攻
$wp17=415;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=8;//装备分类
} elseif($npcc ==206){


//需要修改的变量

$wp1="【龙鳞破天手镯】";//装备名字
$wp2="龙鳞破天套之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=510;//装备攻击
$wp16=510;//装备魔攻
$wp17=415;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=8;//装备分类


} elseif($npcc ==207){



//需要修改的变量

$wp1="【伏虎降龙手镯】";//装备名字
$wp2="伏虎降龙套之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=510;//装备攻击
$wp16=510;//装备魔攻
$wp17=415;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=8;//装备分类

} elseif($npcc ==208){



//需要修改的变量

$wp1="【碧海青天手镯】";//装备名字
$wp2="碧海青天套之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=510;//装备攻击
$wp16=510;//装备魔攻
$wp17=415;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=8;//装备分类





} elseif($npcc ==209){



//需要修改的变量

$wp1="【玄武手镯】";//装备名字
$wp2="玄武套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=881;//装备攻击
$wp16=881;//装备魔攻
$wp17=992;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=8;//装备分类


} elseif($npcc ==210){



//需要修改的变量

$wp1="【无极手镯】";//装备名字
$wp2="无极套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=881;//装备攻击
$wp16=881;//装备魔攻
$wp17=992;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=8;//装备分类
} elseif($npcc ==211){


//需要修改的变量

$wp1="【青龙手镯】";//装备名字
$wp2="青龙套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=881;//装备攻击
$wp16=881;//装备魔攻
$wp17=992;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=8;//装备分类


} elseif($npcc ==212){



//需要修改的变量

$wp1="【金刚手镯】";//装备名字
$wp2="金刚套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=881;//装备攻击
$wp16=881;//装备魔攻
$wp17=992;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=8;//装备分类

} elseif($npcc ==213){



//需要修改的变量

$wp1="【银沙手镯】";//装备名字
$wp2="银沙套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=881;//装备攻击
$wp16=881;//装备魔攻
$wp17=992;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=65;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=8;//装备分类





} elseif($npcc ==214){



//需要修改的变量

$wp1="【玄武撼地手镯】";//装备名字
$wp2="玄武撼地套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1353;//装备攻击
$wp16=1353;//装备魔攻
$wp17=1557;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=8;//装备分类


} elseif($npcc ==215){



//需要修改的变量

$wp1="【无极无道手镯】";//装备名字
$wp2="无极无道套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1353;//装备攻击
$wp16=1353;//装备魔攻
$wp17=1557;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=8;//装备分类
} elseif($npcc ==216){


//需要修改的变量

$wp1="【青龙在天手镯】";//装备名字
$wp2="青龙在天套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1353;//装备攻击
$wp16=1353;//装备魔攻
$wp17=1557;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=8;//装备分类


} elseif($npcc ==217){



//需要修改的变量

$wp1="【怒目金刚手镯】";//装备名字
$wp2="怒目金刚套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1353;//装备攻击
$wp16=1353;//装备魔攻
$wp17=1557;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=8;//装备分类

} elseif($npcc ==218){



//需要修改的变量

$wp1="【银沙瀚海手镯】";//装备名字
$wp2="银沙瀚海套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=1353;//装备攻击
$wp16=1353;//装备魔攻
$wp17=1557;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=70;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=8;//装备分类






} elseif($npcc ==219){



//需要修改的变量

$wp1="【朱雀手镯】";//装备名字
$wp2="朱雀套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3153;//装备攻击
$wp16=3153;//装备魔攻
$wp17=3328;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=8;//装备分类


} elseif($npcc ==220){



//需要修改的变量

$wp1="【太乙手镯】";//装备名字
$wp2="太乙套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3153;//装备攻击
$wp16=3153;//装备魔攻
$wp17=3328;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=8;//装备分类
} elseif($npcc ==221){


//需要修改的变量

$wp1="【天龙手镯】";//装备名字
$wp2="天龙套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3153;//装备攻击
$wp16=3153;//装备魔攻
$wp17=3328;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=8;//装备分类


} elseif($npcc ==222){



//需要修改的变量

$wp1="【罗汉手镯】";//装备名字
$wp2="罗汉套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3153;//装备攻击
$wp16=3153;//装备魔攻
$wp17=3328;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=8;//装备分类

} elseif($npcc ==223){



//需要修改的变量

$wp1="【奔月手镯】";//装备名字
$wp2="奔月套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3153;//装备攻击
$wp16=3153;//装备魔攻
$wp17=3328;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=80;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=8;//装备分类















} elseif($npcc ==224){



//需要修改的变量

$wp1="〖祝融戒指〗";//装备名字
$wp2="战神祝融使用过的戒指！(可在长安装备锻造商处进行升级)";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=364;//装备攻击
$wp16=364;//装备魔攻
$wp17=731;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类





} elseif($npcc ==232){



//需要修改的变量

$wp1="【巨灵手镯】";//装备名字
$wp2="战神祝融使用过的戒指！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=4534;//装备攻击
$wp16=4534;//装备魔攻
$wp17=3654;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类



} elseif($npcc ==233){



//需要修改的变量

$wp1="〖雷皇守护〗";//装备名字
$wp2="雷皇套装之一";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=288;//装备攻击
$wp16=288;//装备魔攻
$wp17=234;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=4;//装备冰防
$wp22=4;//装备火防
$wp23=4;//装备雷防
//需要修改的变量

$wp24=40;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类


} elseif($npcc ==234){



//需要修改的变量

$wp1="【幻想手镯】";//装备名字
$wp2="幻想绝版套装之手镯！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=2514;//装备攻击
$wp16=2514;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量

$wp24=50;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类










} elseif($npcc ==235){



//需要修改的变量

$wp1="〖共工护符〗";//装备名字
$wp2="战神共工用过的护符！(可在长安装备锻造商处进行升级)";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=899;//装备攻击
$wp16=899;//装备魔攻
$wp17=1000;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派

$wp30=7;//装备分类





} elseif($npcc ==236){



//需要修改的变量

$wp1="【刑天铁甲】";//装备名字
$wp2="战神刑天用过的战甲！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2131;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类


} elseif($npcc ==237){



//需要修改的变量

$wp1="【祝融戒指】";//装备名字
$wp2="战神祝融使用过的戒指！！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3324;//装备攻击
$wp16=3324;//装备魔攻
$wp17=3567;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类



} elseif($npcc ==238){



//需要修改的变量

$wp1="【阐气瓶】（1级）";//装备名字
$wp2="低级的法宝武器-【阐气瓶】";//装备描述
//需要修改的变量

$wp14=20000;//装备hp
$wp15=800;//装备攻击
$wp16=800;//装备魔攻
$wp17=500;//装备防御
//需要修改的变量
$wp18=3;//装备冰攻
$wp19=3;//装备火攻
$wp20=3;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类



} elseif($npcc ==239){



//需要修改的变量

$wp1="【阐气瓶】（2级）";//装备名字
$wp2="低级的法宝武器-【阐气瓶】";//装备描述
//需要修改的变量

$wp14=22000;//装备hp
$wp15=1080;//装备攻击
$wp16=1080;//装备魔攻
$wp17=700;//装备防御
//需要修改的变量
$wp18=4;//装备冰攻
$wp19=4;//装备火攻
$wp20=4;//装备雷攻
//需要修改的变量

$wp21=4;//装备冰防
$wp22=4;//装备火防
$wp23=4;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==240){



//需要修改的变量

$wp1="【阐气瓶】（3级）";//装备名字
$wp2="低级的法宝武器-【阐气瓶】";//装备描述
//需要修改的变量

$wp14=25000;//装备hp
$wp15=1460;//装备攻击
$wp16=1460;//装备魔攻
$wp17=1080;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量

$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类



} elseif($npcc ==241){



//需要修改的变量

$wp1="【阐气瓶】（4级）";//装备名字
$wp2="低级的法宝武器-【阐气瓶】";//装备描述
//需要修改的变量

$wp14=30000;//装备hp
$wp15=1628;//装备攻击
$wp16=1628;//装备魔攻
$wp17=1325;//装备防御
//需要修改的变量
$wp18=6;//装备冰攻
$wp19=6;//装备火攻
$wp20=6;//装备雷攻
//需要修改的变量

$wp21=6;//装备冰防
$wp22=6;//装备火防
$wp23=6;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==242){



//需要修改的变量

$wp1="【阐气瓶】（5级）";//装备名字
$wp2="低级的法宝武器-【阐气瓶】";//装备描述
//需要修改的变量

$wp14=35000;//装备hp
$wp15=1888;//装备攻击
$wp16=1888;//装备魔攻
$wp17=1269;//装备防御
//需要修改的变量
$wp18=7;//装备冰攻
$wp19=7;//装备火攻
$wp20=7;//装备雷攻
//需要修改的变量

$wp21=7;//装备冰防
$wp22=7;//装备火防
$wp23=7;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类




} elseif($npcc ==243){



//需要修改的变量

$wp1="【开天珠】（1级）";//装备名字
$wp2="中级的法宝武器【开天珠】";//装备描述
//需要修改的变量

$wp14=40000;//装备hp
$wp15=2158;//装备攻击
$wp16=2158;//装备魔攻
$wp17=1388;//装备防御
//需要修改的变量
$wp18=8;//装备冰攻
$wp19=8;//装备火攻
$wp20=8;//装备雷攻
//需要修改的变量

$wp21=8;//装备冰防
$wp22=8;//装备火防
$wp23=8;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类

} elseif($npcc ==244){



//需要修改的变量

$wp1="【开天珠】（2级）";//装备名字
$wp2="中级的法宝武器【开天珠】";//装备描述
//需要修改的变量

$wp14=45822;//装备hp
$wp15=2352;//装备攻击
$wp16=2352;//装备魔攻
$wp17=1599;//装备防御
//需要修改的变量
$wp18=9;//装备冰攻
$wp19=9;//装备火攻
$wp20=9;//装备雷攻
//需要修改的变量

$wp21=9;//装备冰防
$wp22=9;//装备火防
$wp23=9;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==245){



//需要修改的变量

$wp1="【开天珠】（3级）";//装备名字
$wp2="中级的法宝武器【开天珠】";//装备描述
//需要修改的变量

$wp14=52102;//装备hp
$wp15=2689;//装备攻击
$wp16=2679;//装备魔攻
$wp17=1688;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量

$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==246){



//需要修改的变量

$wp1="【开天珠】（4级）";//装备名字
$wp2="中级的法宝武器【开天珠】";//装备描述
//需要修改的变量

$wp14=62158;//装备hp
$wp15=2825;//装备攻击
$wp16=2825;//装备魔攻
$wp17=2111;//装备防御
//需要修改的变量
$wp18=11;//装备冰攻
$wp19=11;//装备火攻
$wp20=11;//装备雷攻
//需要修改的变量

$wp21=11;//装备冰防
$wp22=11;//装备火防
$wp23=11;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==247){



//需要修改的变量

$wp1="【开天珠】（5级）";//装备名字
$wp2="中级的法宝武器【开天珠】";//装备描述
//需要修改的变量

$wp14=72158;//装备hp
$wp15=3125;//装备攻击
$wp16=3125;//装备魔攻
$wp17=2356;//装备防御
//需要修改的变量
$wp18=12;//装备冰攻
$wp19=12;//装备火攻
$wp20=12;//装备雷攻
//需要修改的变量

$wp21=12;//装备冰防
$wp22=12;//装备火防
$wp23=12;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==248){



//需要修改的变量

$wp1="【定海珠】（1级）";//装备名字
$wp2="中级的法宝武器【定海珠】";//装备描述
//需要修改的变量

$wp14=74125;//装备hp
$wp15=3514;//装备攻击
$wp16=3514;//装备魔攻
$wp17=2579;//装备防御
//需要修改的变量
$wp18=13;//装备冰攻
$wp19=13;//装备火攻
$wp20=13;//装备雷攻
//需要修改的变量

$wp21=13;//装备冰防
$wp22=13;//装备火防
$wp23=13;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==249){



//需要修改的变量

$wp1="【定海珠】（2级）";//装备名字
$wp2="中级的法宝武器【定海珠】";//装备描述
//需要修改的变量

$wp14=76852;//装备hp
$wp15=3869;//装备攻击
$wp16=3869;//装备魔攻
$wp17=2789;//装备防御
//需要修改的变量
$wp18=14;//装备冰攻
$wp19=14;//装备火攻
$wp20=14;//装备雷攻
//需要修改的变量

$wp21=14;//装备冰防
$wp22=14;//装备火防
$wp23=14;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类



} elseif($npcc ==250){



//需要修改的变量

$wp1="【定海珠】（3级）";//装备名字
$wp2="中级的法宝武器【定海珠】";//装备描述
//需要修改的变量

$wp14=78588;//装备hp
$wp15=4012;//装备攻击
$wp16=4012;//装备魔攻
$wp17=2956;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量

$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类




} elseif($npcc ==251){



//需要修改的变量

$wp1="【定海珠】（4级）";//装备名字
$wp2="中级的法宝武器【定海珠】";//装备描述
//需要修改的变量

$wp14=80258;//装备hp
$wp15=4256;//装备攻击
$wp16=4256;//装备魔攻
$wp17=3126;//装备防御
//需要修改的变量
$wp18=16;//装备冰攻
$wp19=16;//装备火攻
$wp20=16;//装备雷攻
//需要修改的变量

$wp21=16;//装备冰防
$wp22=16;//装备火防
$wp23=16;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类



} elseif($npcc ==252){



//需要修改的变量

$wp1="【定海珠】（5级）";//装备名字
$wp2="中级的法宝武器【定海珠】";//装备描述
//需要修改的变量

$wp14=82456;//装备hp
$wp15=4452;//装备攻击
$wp16=4452;//装备魔攻
$wp17=3315;//装备防御
//需要修改的变量
$wp18=17;//装备冰攻
$wp19=17;//装备火攻
$wp20=17;//装备雷攻
//需要修改的变量

$wp21=17;//装备冰防
$wp22=17;//装备火防
$wp23=17;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类

} elseif($npcc ==253){



//需要修改的变量

$wp1="【乾坤圈】（1级）";//装备名字
$wp2="高级的法宝武器【乾坤圈】";//装备描述
//需要修改的变量

$wp14=84215;//装备hp
$wp15=4621;//装备攻击
$wp16=4621;//装备魔攻
$wp17=3542;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类

} elseif($npcc ==254){



//需要修改的变量

$wp1="【乾坤圈】（2级）";//装备名字
$wp2="高级的法宝武器【乾坤圈】";//装备描述
//需要修改的变量

$wp14=86524;//装备hp
$wp15=4852;//装备攻击
$wp16=4852;//装备魔攻
$wp17=3687;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类

} elseif($npcc ==255){



//需要修改的变量

$wp1="【乾坤圈】（3级）";//装备名字
$wp2="高级的法宝武器【乾坤圈】";//装备描述
//需要修改的变量

$wp14=88596;//装备hp
$wp15=5014;//装备攻击
$wp16=5014;//装备魔攻
$wp17=3689;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类

} elseif($npcc ==256){



//需要修改的变量

$wp1="【乾坤圈】（4级）";//装备名字
$wp2="高级的法宝武器【乾坤圈】";//装备描述
//需要修改的变量

$wp14=90261;//装备hp
$wp15=6235;//装备攻击
$wp16=6235;//装备魔攻
$wp17=3856;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类

} elseif($npcc ==257){



//需要修改的变量

$wp1="【乾坤圈】（5级）";//装备名字
$wp2="高级的法宝武器【乾坤圈】";//装备描述
//需要修改的变量

$wp14=92365;//装备hp
$wp15=6425;//装备攻击
$wp16=6425;//装备魔攻
$wp17=4015;//装备防御
//需要修改的变量
$wp18=18;//装备冰攻
$wp19=18;//装备火攻
$wp20=18;//装备雷攻
//需要修改的变量

$wp21=18;//装备冰防
$wp22=18;//装备火防
$wp23=18;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类





} elseif($npcc ==258){



//需要修改的变量

$wp1="【金箍棒】（1级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=105822;//装备hp
$wp15=7058;//装备攻击
$wp16=7058;//装备魔攻
$wp17=5028;//装备防御
//需要修改的变量
$wp18=21;//装备冰攻
$wp19=21;//装备火攻
$wp20=21;//装备雷攻
//需要修改的变量

$wp21=21;//装备冰防
$wp22=21;//装备火防
$wp23=21;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==259){



//需要修改的变量

$wp1="【金箍棒】（2级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=108822;//装备hp
$wp15=7358;//装备攻击
$wp16=7358;//装备魔攻
$wp17=5328;//装备防御
//需要修改的变量
$wp18=22;//装备冰攻
$wp19=22;//装备火攻
$wp20=22;//装备雷攻
//需要修改的变量

$wp21=22;//装备冰防
$wp22=22;//装备火防
$wp23=22;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==260){



//需要修改的变量

$wp1="【金箍棒】（3级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=111822;//装备hp
$wp15=7658;//装备攻击
$wp16=7658;//装备魔攻
$wp17=5628;//装备防御
//需要修改的变量
$wp18=23;//装备冰攻
$wp19=23;//装备火攻
$wp20=23;//装备雷攻
//需要修改的变量

$wp21=23;//装备冰防
$wp22=23;//装备火防
$wp23=23;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类



} elseif($npcc ==261){



//需要修改的变量

$wp1="【金箍棒】（4级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=114822;//装备hp
$wp15=7958;//装备攻击
$wp16=7958;//装备魔攻
$wp17=5928;//装备防御
//需要修改的变量
$wp18=24;//装备冰攻
$wp19=24;//装备火攻
$wp20=24;//装备雷攻
//需要修改的变量

$wp21=24;//装备冰防
$wp22=24;//装备火防
$wp23=24;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类




} elseif($npcc ==262){



//需要修改的变量

$wp1="【金箍棒】（5级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=117822;//装备hp
$wp15=8358;//装备攻击
$wp16=8358;//装备魔攻
$wp17=8328;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类




} elseif($npcc ==263){



//需要修改的变量

$wp1="【金箍棒】（6级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=120822;//装备hp
$wp15=8658;//装备攻击
$wp16=8658;//装备魔攻
$wp17=8628;//装备防御
//需要修改的变量
$wp18=26;//装备冰攻
$wp19=26;//装备火攻
$wp20=26;//装备雷攻
//需要修改的变量

$wp21=26;//装备冰防
$wp22=26;//装备火防
$wp23=26;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类




} elseif($npcc ==264){



//需要修改的变量

$wp1="【金箍棒】（7级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=123822;//装备hp
$wp15=8958;//装备攻击
$wp16=8958;//装备魔攻
$wp17=8928;//装备防御
//需要修改的变量
$wp18=27;//装备冰攻
$wp19=27;//装备火攻
$wp20=27;//装备雷攻
//需要修改的变量

$wp21=27;//装备冰防
$wp22=27;//装备火防
$wp23=27;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类

} elseif($npcc ==265){



//需要修改的变量

$wp1="【金箍棒】（8级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=126822;//装备hp
$wp15=9258;//装备攻击
$wp16=9258;//装备魔攻
$wp17=9228;//装备防御
//需要修改的变量
$wp18=28;//装备冰攻
$wp19=28;//装备火攻
$wp20=28;//装备雷攻
//需要修改的变量

$wp21=28;//装备冰防
$wp22=28;//装备火防
$wp23=28;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类



} elseif($npcc ==266){



//需要修改的变量

$wp1="【金箍棒】（9级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=129822;//装备hp
$wp15=9558;//装备攻击
$wp16=9558;//装备魔攻
$wp17=9528;//装备防御
//需要修改的变量
$wp18=29;//装备冰攻
$wp19=29;//装备火攻
$wp20=29;//装备雷攻
//需要修改的变量

$wp21=29;//装备冰防
$wp22=29;//装备火防
$wp23=29;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类




} elseif($npcc ==267){



//需要修改的变量

$wp1="【金箍棒】（10级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=132822;//装备hp
$wp15=10058;//装备攻击
$wp16=10058;//装备魔攻
$wp17=10028;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类

} elseif($npcc ==268){



//需要修改的变量

$wp1="【金箍棒】（11级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=136822;//装备hp
$wp15=10458;//装备攻击
$wp16=10458;//装备魔攻
$wp17=10428;//装备防御
//需要修改的变量
$wp18=31;//装备冰攻
$wp19=31;//装备火攻
$wp20=31;//装备雷攻
//需要修改的变量

$wp21=31;//装备冰防
$wp22=31;//装备火防
$wp23=31;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类



} elseif($npcc ==269){



//需要修改的变量

$wp1="【金箍棒】（12级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=140822;//装备hp
$wp15=10858;//装备攻击
$wp16=10858;//装备魔攻
$wp17=10828;//装备防御
//需要修改的变量
$wp18=32;//装备冰攻
$wp19=32;//装备火攻
$wp20=32;//装备雷攻
//需要修改的变量

$wp21=32;//装备冰防
$wp22=32;//装备火防
$wp23=32;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==270){



//需要修改的变量

$wp1="【金箍棒】（13级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=144822;//装备hp
$wp15=11258;//装备攻击
$wp16=11258;//装备魔攻
$wp17=11228;//装备防御
//需要修改的变量
$wp18=33;//装备冰攻
$wp19=33;//装备火攻
$wp20=33;//装备雷攻
//需要修改的变量

$wp21=33;//装备冰防
$wp22=33;//装备火防
$wp23=33;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类



} elseif($npcc ==271){



//需要修改的变量

$wp1="【金箍棒】（14级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=148822;//装备hp
$wp15=11658;//装备攻击
$wp16=11658;//装备魔攻
$wp17=11628;//装备防御
//需要修改的变量
$wp18=34;//装备冰攻
$wp19=34;//装备火攻
$wp20=34;//装备雷攻
//需要修改的变量

$wp21=34;//装备冰防
$wp22=34;//装备火防
$wp23=34;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==272){



//需要修改的变量

$wp1="【金箍棒】（15级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=152822;//装备hp
$wp15=12058;//装备攻击
$wp16=12058;//装备魔攻
$wp17=12028;//装备防御
//需要修改的变量
$wp18=35;//装备冰攻
$wp19=35;//装备火攻
$wp20=35;//装备雷攻
//需要修改的变量

$wp21=35;//装备冰防
$wp22=35;//装备火防
$wp23=35;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类



} elseif($npcc ==273){



//需要修改的变量

$wp1="【金箍棒】（16级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=156822;//装备hp
$wp15=12458;//装备攻击
$wp16=12458;//装备魔攻
$wp17=12428;//装备防御
//需要修改的变量
$wp18=36;//装备冰攻
$wp19=36;//装备火攻
$wp20=36;//装备雷攻
//需要修改的变量

$wp21=36;//装备冰防
$wp22=36;//装备火防
$wp23=36;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==274){



//需要修改的变量

$wp1="【金箍棒】（17级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=160822;//装备hp
$wp15=12858;//装备攻击
$wp16=12858;//装备魔攻
$wp17=12828;//装备防御
//需要修改的变量
$wp18=37;//装备冰攻
$wp19=37;//装备火攻
$wp20=37;//装备雷攻
//需要修改的变量

$wp21=37;//装备冰防
$wp22=37;//装备火防
$wp23=37;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==275){



//需要修改的变量

$wp1="【金箍棒】（18级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=164822;//装备hp
$wp15=13258;//装备攻击
$wp16=13258;//装备魔攻
$wp17=13228;//装备防御
//需要修改的变量
$wp18=38;//装备冰攻
$wp19=38;//装备火攻
$wp20=38;//装备雷攻
//需要修改的变量

$wp21=38;//装备冰防
$wp22=38;//装备火防
$wp23=38;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类



} elseif($npcc ==276){



//需要修改的变量

$wp1="【金箍棒】（19级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=168822;//装备hp
$wp15=13658;//装备攻击
$wp16=13658;//装备魔攻
$wp17=13628;//装备防御
//需要修改的变量
$wp18=39;//装备冰攻
$wp19=39;//装备火攻
$wp20=39;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==277){



//需要修改的变量

$wp1="【金箍棒】（20级）";//装备名字
$wp2="齐天大圣曾使用过的【金箍棒】";//装备描述
//需要修改的变量

$wp14=172822;//装备hp
$wp15=14058;//装备攻击
$wp16=14058;//装备魔攻
$wp17=14028;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类



} elseif($npcc ==278){



//需要修改的变量

$wp1="【如意金箍棒】（1级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量

$wp14=180000;//装备hp
$wp15=15000;//装备攻击
$wp16=15000;//装备魔攻
$wp17=15000;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类









} elseif($npcc ==279){
//需要修改的变量
$wp1="【如意金箍棒】（2级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=190000;//装备hp
$wp15=16000;//装备攻击
$wp16=16000;//装备魔攻
$wp17=16000;//装备防御
//需要修改的变量
$wp18=51;//装备冰攻
$wp19=51;//装备火攻
$wp20=51;//装备雷攻
//需要修改的变量
$wp21=51;//装备冰防
$wp22=51;//装备火防
$wp23=51;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类



} elseif($npcc ==280){
//需要修改的变量
$wp1="【如意金箍棒】（3级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=200000;//装备hp
$wp15=17000;//装备攻击
$wp16=17000;//装备魔攻
$wp17=17000;//装备防御
//需要修改的变量
$wp18=52;//装备冰攻
$wp19=52;//装备火攻
$wp20=52;//装备雷攻
//需要修改的变量
$wp21=52;//装备冰防
$wp22=52;//装备火防
$wp23=52;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类



} elseif($npcc ==281){
//需要修改的变量
$wp1="【如意金箍棒】（4级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=210000;//装备hp
$wp15=18000;//装备攻击
$wp16=18000;//装备魔攻
$wp17=18000;//装备防御
//需要修改的变量
$wp18=53;//装备冰攻
$wp19=53;//装备火攻
$wp20=53;//装备雷攻
//需要修改的变量
$wp21=53;//装备冰防
$wp22=53;//装备火防
$wp23=53;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类




} elseif($npcc ==282){
//需要修改的变量
$wp1="【如意金箍棒】（5级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=220000;//装备hp
$wp15=19000;//装备攻击
$wp16=19000;//装备魔攻
$wp17=19000;//装备防御
//需要修改的变量
$wp18=54;//装备冰攻
$wp19=54;//装备火攻
$wp20=54;//装备雷攻
//需要修改的变量
$wp21=54;//装备冰防
$wp22=54;//装备火防
$wp23=54;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类


} elseif($npcc ==283){
//需要修改的变量
$wp1="【如意金箍棒】（6级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=230000;//装备hp
$wp15=20000;//装备攻击
$wp16=20000;//装备魔攻
$wp17=20000;//装备防御
//需要修改的变量
$wp18=55;//装备冰攻
$wp19=55;//装备火攻
$wp20=55;//装备雷攻
//需要修改的变量
$wp21=55;//装备冰防
$wp22=55;//装备火防
$wp23=55;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类



} elseif($npcc ==284){
//需要修改的变量
$wp1="【如意金箍棒】（7级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=240000;//装备hp
$wp15=21000;//装备攻击
$wp16=21000;//装备魔攻
$wp17=21000;//装备防御
//需要修改的变量
$wp18=56;//装备冰攻
$wp19=56;//装备火攻
$wp20=56;//装备雷攻
//需要修改的变量
$wp21=56;//装备冰防
$wp22=56;//装备火防
$wp23=56;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类



} elseif($npcc ==285){
//需要修改的变量
$wp1="【如意金箍棒】（8级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=250000;//装备hp
$wp15=22000;//装备攻击
$wp16=22000;//装备魔攻
$wp17=22000;//装备防御
//需要修改的变量
$wp18=57;//装备冰攻
$wp19=57;//装备火攻
$wp20=57;//装备雷攻
//需要修改的变量
$wp21=57;//装备冰防
$wp22=57;//装备火防
$wp23=57;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类



} elseif($npcc ==286){
//需要修改的变量
$wp1="【如意金箍棒】（9级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=260000;//装备hp
$wp15=23000;//装备攻击
$wp16=23000;//装备魔攻
$wp17=23000;//装备防御
//需要修改的变量
$wp18=58;//装备冰攻
$wp19=58;//装备火攻
$wp20=58;//装备雷攻
//需要修改的变量
$wp21=58;//装备冰防
$wp22=58;//装备火防
$wp23=58;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类



} elseif($npcc ==287){
//需要修改的变量
$wp1="【如意金箍棒】（10级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=270000;//装备hp
$wp15=24000;//装备攻击
$wp16=24000;//装备魔攻
$wp17=24000;//装备防御
//需要修改的变量
$wp18=65;//装备冰攻
$wp19=65;//装备火攻
$wp20=65;//装备雷攻
//需要修改的变量
$wp21=65;//装备冰防
$wp22=65;//装备火防
$wp23=65;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类



} elseif($npcc ==288){
//需要修改的变量
$wp1="【如意金箍棒】（11级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=280000;//装备hp
$wp15=25000;//装备攻击
$wp16=25000;//装备魔攻
$wp17=25000;//装备防御
//需要修改的变量
$wp18=66;//装备冰攻
$wp19=66;//装备火攻
$wp20=66;//装备雷攻
//需要修改的变量
$wp21=66;//装备冰防
$wp22=66;//装备火防
$wp23=66;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类



} elseif($npcc ==289){
//需要修改的变量
$wp1="【如意金箍棒】（12级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=290000;//装备hp
$wp15=26000;//装备攻击
$wp16=26000;//装备魔攻
$wp17=26000;//装备防御
//需要修改的变量
$wp18=67;//装备冰攻
$wp19=67;//装备火攻
$wp20=67;//装备雷攻
//需要修改的变量
$wp21=67;//装备冰防
$wp22=67;//装备火防
$wp23=67;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类


} elseif($npcc ==289){
//需要修改的变量
$wp1="【如意金箍棒】（13级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=300000;//装备hp
$wp15=27000;//装备攻击
$wp16=27000;//装备魔攻
$wp17=27000;//装备防御
//需要修改的变量
$wp18=68;//装备冰攻
$wp19=68;//装备火攻
$wp20=68;//装备雷攻
//需要修改的变量
$wp21=68;//装备冰防
$wp22=68;//装备火防
$wp23=68;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类



} elseif($npcc ==290){
//需要修改的变量
$wp1="【如意金箍棒】（14级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=310000;//装备hp
$wp15=28000;//装备攻击
$wp16=28000;//装备魔攻
$wp17=28000;//装备防御
//需要修改的变量
$wp18=69;//装备冰攻
$wp19=69;//装备火攻
$wp20=69;//装备雷攻
//需要修改的变量
$wp21=69;//装备冰防
$wp22=69;//装备火防
$wp23=69;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类



} elseif($npcc ==291){
//需要修改的变量
$wp1="【如意金箍棒】（15级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=320000;//装备hp
$wp15=29000;//装备攻击
$wp16=29000;//装备魔攻
$wp17=29000;//装备防御
//需要修改的变量
$wp18=75;//装备冰攻
$wp19=75;//装备火攻
$wp20=75;//装备雷攻
//需要修改的变量
$wp21=75;//装备冰防
$wp22=75;//装备火防
$wp23=75;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类


} elseif($npcc ==292){
//需要修改的变量
$wp1="【如意金箍棒】（16级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=330000;//装备hp
$wp15=30000;//装备攻击
$wp16=30000;//装备魔攻
$wp17=30000;//装备防御
//需要修改的变量
$wp18=76;//装备冰攻
$wp19=76;//装备火攻
$wp20=76;//装备雷攻
//需要修改的变量
$wp21=76;//装备冰防
$wp22=76;//装备火防
$wp23=76;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类


} elseif($npcc ==293){
//需要修改的变量
$wp1="【如意金箍棒】（17级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=340000;//装备hp
$wp15=31000;//装备攻击
$wp16=31000;//装备魔攻
$wp17=31000;//装备防御
//需要修改的变量
$wp18=77;//装备冰攻
$wp19=77;//装备火攻
$wp20=77;//装备雷攻
//需要修改的变量
$wp21=77;//装备冰防
$wp22=77;//装备火防
$wp23=77;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类





} elseif($npcc ==294){
//需要修改的变量
$wp1="【如意金箍棒】（17级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=350000;//装备hp
$wp15=32000;//装备攻击
$wp16=32000;//装备魔攻
$wp17=32000;//装备防御
//需要修改的变量
$wp18=78;//装备冰攻
$wp19=78;//装备火攻
$wp20=78;//装备雷攻
//需要修改的变量
$wp21=78;//装备冰防
$wp22=78;//装备火防
$wp23=78;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类



} elseif($npcc ==295){
//需要修改的变量
$wp1="【如意金箍棒】（18级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=360000;//装备hp
$wp15=33000;//装备攻击
$wp16=33000;//装备魔攻
$wp17=33000;//装备防御
//需要修改的变量
$wp18=79;//装备冰攻
$wp19=79;//装备火攻
$wp20=79;//装备雷攻
//需要修改的变量
$wp21=79;//装备冰防
$wp22=79;//装备火防
$wp23=79;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类


} elseif($npcc ==296){
//需要修改的变量
$wp1="【如意金箍棒】（19级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=370000;//装备hp
$wp15=34000;//装备攻击
$wp16=34000;//装备魔攻
$wp17=34000;//装备防御
//需要修改的变量
$wp18=80;//装备冰攻
$wp19=80;//装备火攻
$wp20=80;//装备雷攻
//需要修改的变量
$wp21=80;//装备冰防
$wp22=80;//装备火防
$wp23=80;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类





} elseif($npcc ==297){



//需要修改的变量

$wp1="【风火双轮】";//装备名字
$wp2="低阶坐骑-【风火双轮】，（可在天宫升级，合成中阶坐骑的必备）";//装备描述
//需要修改的变量

$wp14=200;//装备hp
$wp15=30;//装备攻击
$wp16=50;//装备魔攻
$wp17=80;//装备防御
//需要修改的变量
$wp18=3;//装备冰攻
$wp19=3;//装备火攻
$wp20=3;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类


} elseif($npcc ==298){



//需要修改的变量

$wp1="【玉角麒麟】";//装备名字
$wp2="低阶坐骑-【玉角麒麟】，（可在天宫升级，合成中阶坐骑的必备）";//装备描述
//需要修改的变量

$wp14=200;//装备hp
$wp15=30;//装备攻击
$wp16=50;//装备魔攻
$wp17=80;//装备防御
//需要修改的变量
$wp18=3;//装备冰攻
$wp19=3;//装备火攻
$wp20=3;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类

} elseif($npcc ==299){



//需要修改的变量

$wp1="【五彩神牛】";//装备名字
$wp2="低阶坐骑-【五彩神牛】，（可在天宫升级，合成中阶坐骑的必备）";//装备描述
//需要修改的变量

$wp14=200;//装备hp
$wp15=30;//装备攻击
$wp16=50;//装备魔攻
$wp17=80;//装备防御
//需要修改的变量
$wp18=3;//装备冰攻
$wp19=3;//装备火攻
$wp20=3;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类


} elseif($npcc ==300){



//需要修改的变量

$wp1="【章鱼哥】";//装备名字
$wp2="中阶坐骑-【章鱼哥】，（可在长安装备锻造商处进行魔化升级）";//装备描述
//需要修改的变量

$wp14=200;//装备hp
$wp15=30;//装备攻击
$wp16=50;//装备魔攻
$wp17=80;//装备防御
//需要修改的变量
$wp18=3;//装备冰攻
$wp19=3;//装备火攻
$wp20=3;//装备雷攻
//需要修改的变量

$wp21=3;//装备冰防
$wp22=3;//装备火防
$wp23=3;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类










} else{

echo "<font color=black>没有这个装备id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}

?>




