<?php

if($npcc ==701){
//需要修改的变量

$wp1="【混沌天尊甲】";//装备名字
$wp2="西游混沌天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=41258;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=119;//装备冰防
$wp22=119;//装备火防
$wp23=119;//装备雷防
//需要修改的变量

$wp24=250;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
} elseif($npcc ==702){
//需要修改的变量

$wp1="【混沌天尊盔】";//装备名字
$wp2="西游混沌天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=41584;//装备攻击
$wp16=41584;//装备魔攻
$wp17=41584;//装备防御
//需要修改的变量
$wp18=119;//装备冰攻
$wp19=119;//装备火攻
$wp20=119;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=250;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
} elseif($npcc ==703){
//需要修改的变量

$wp1="【混沌天尊靴】";//装备名字
$wp2="西游混沌天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=41587;//装备攻击
$wp16=41587;//装备魔攻
$wp17=41587;//装备防御
//需要修改的变量
$wp18=119;//装备冰攻
$wp19=119;//装备火攻
$wp20=119;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=250;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



} elseif($npcc ==704){
//需要修改的变量

$wp1="【混沌天尊链】";//装备名字
$wp2="西游混沌天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=41584;//装备攻击
$wp16=41584;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=119;//装备冰攻
$wp19=119;//装备火攻
$wp20=119;//装备雷攻
//需要修改的变量

$wp21=119;//装备冰防
$wp22=119;//装备火防
$wp23=119;//装备雷防
//需要修改的变量

$wp24=250;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==705){
//需要修改的变量

$wp1="【混沌天尊镯】";//装备名字
$wp2="西游混沌天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=41458;//装备攻击
$wp16=41458;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=119;//装备冰攻
$wp19=119;//装备火攻
$wp20=119;//装备雷攻
//需要修改的变量

$wp21=119;//装备冰防
$wp22=119;//装备火防
$wp23=119;//装备雷防
//需要修改的变量

$wp24=250;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



} elseif($npcc ==706){
		
	//需要修改的变量

$wp1="【混沌天尊枪】";//装备名字
$wp2="西游混沌天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=45015;//装备攻击
$wp16=45015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=119;//装备冰攻
$wp19=119;//装备火攻
$wp20=119;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=250;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
} elseif($npcc ==707){
//需要修改的变量

$wp1="【混沌天尊叉】";//装备名字
$wp2="西游混沌天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=45015;//装备攻击
$wp16=45015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=119;//装备冰攻
$wp19=119;//装备火攻
$wp20=119;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=250;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
} elseif($npcc ==708){
//需要修改的变量

$wp1="【混沌天尊棍】";//装备名字
$wp2="西游混沌天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=45015;//装备攻击
$wp16=45015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=119;//装备冰攻
$wp19=119;//装备火攻
$wp20=119;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=250;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==709){
//需要修改的变量
$wp1="【混沌天尊杖】";//装备名字
$wp2="西游混沌天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=45015;//装备攻击
$wp16=45015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=119;//装备冰攻
$wp19=119;//装备火攻
$wp20=119;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=250;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==710){
//需要修改的变量

$wp1="【混沌天尊剑】";//装备名字
$wp2="西游混沌天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=45015;//装备攻击
$wp16=45015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=119;//装备冰攻
$wp19=119;//装备火攻
$wp20=119;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=250;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	


} elseif($npcc ==711){
//需要修改的变量

$wp1="【混沌神尊甲】";//装备名字
$wp2="西游混沌神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=50258;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=129;//装备冰防
$wp22=129;//装备火防
$wp23=129;//装备雷防
//需要修改的变量

$wp24=260;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
} elseif($npcc ==712){
//需要修改的变量

$wp1="【混沌神尊盔】";//装备名字
$wp2="西游混沌神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=50584;//装备攻击
$wp16=50584;//装备魔攻
$wp17=50584;//装备防御
//需要修改的变量
$wp18=129;//装备冰攻
$wp19=129;//装备火攻
$wp20=129;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=260;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
} elseif($npcc ==713){
//需要修改的变量

$wp1="【混沌神尊靴】";//装备名字
$wp2="西游混沌神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=50587;//装备攻击
$wp16=50587;//装备魔攻
$wp17=50587;//装备防御
//需要修改的变量
$wp18=129;//装备冰攻
$wp19=129;//装备火攻
$wp20=129;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=260;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



} elseif($npcc ==714){
//需要修改的变量

$wp1="【混沌神尊链】";//装备名字
$wp2="西游混沌神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=50584;//装备攻击
$wp16=50584;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=129;//装备冰攻
$wp19=129;//装备火攻
$wp20=129;//装备雷攻
//需要修改的变量

$wp21=129;//装备冰防
$wp22=129;//装备火防
$wp23=129;//装备雷防
//需要修改的变量

$wp24=260;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==715){
//需要修改的变量

$wp1="【混沌神尊镯】";//装备名字
$wp2="西游混沌神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=50458;//装备攻击
$wp16=50458;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=129;//装备冰攻
$wp19=129;//装备火攻
$wp20=129;//装备雷攻
//需要修改的变量

$wp21=129;//装备冰防
$wp22=129;//装备火防
$wp23=129;//装备雷防
//需要修改的变量

$wp24=260;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



} elseif($npcc ==716){
		
	//需要修改的变量

$wp1="【混沌神尊枪】";//装备名字
$wp2="西游混沌神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=54015;//装备攻击
$wp16=54015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=129;//装备冰攻
$wp19=129;//装备火攻
$wp20=129;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=260;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
} elseif($npcc ==717){
//需要修改的变量

$wp1="【混沌神尊叉】";//装备名字
$wp2="西游混沌神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=54015;//装备攻击
$wp16=54015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=129;//装备冰攻
$wp19=129;//装备火攻
$wp20=129;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=260;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
} elseif($npcc ==718){
//需要修改的变量

$wp1="【混沌神尊棍】";//装备名字
$wp2="西游混沌神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=54015;//装备攻击
$wp16=54015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=129;//装备冰攻
$wp19=129;//装备火攻
$wp20=129;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=260;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==719){
//需要修改的变量
$wp1="【混沌神尊杖】";//装备名字
$wp2="西游混沌神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=54015;//装备攻击
$wp16=54015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=129;//装备冰攻
$wp19=129;//装备火攻
$wp20=129;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=260;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==720){
//需要修改的变量

$wp1="【混沌神尊剑】";//装备名字
$wp2="西游混沌神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=54015;//装备攻击
$wp16=54015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=129;//装备冰攻
$wp19=129;//装备火攻
$wp20=129;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=260;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	


} elseif($npcc ==721){
//需要修改的变量

$wp1="【混沌圣尊甲】";//装备名字
$wp2="西游混沌圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=60258;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=139;//装备冰防
$wp22=139;//装备火防
$wp23=139;//装备雷防
//需要修改的变量

$wp24=270;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
} elseif($npcc ==722){
//需要修改的变量

$wp1="【混沌圣尊盔】";//装备名字
$wp2="西游混沌圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=60584;//装备攻击
$wp16=60584;//装备魔攻
$wp17=60584;//装备防御
//需要修改的变量
$wp18=139;//装备冰攻
$wp19=139;//装备火攻
$wp20=139;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=270;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
} elseif($npcc ==723){
//需要修改的变量

$wp1="【混沌圣尊靴】";//装备名字
$wp2="西游混沌圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=60587;//装备攻击
$wp16=60587;//装备魔攻
$wp17=60587;//装备防御
//需要修改的变量
$wp18=139;//装备冰攻
$wp19=139;//装备火攻
$wp20=139;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=270;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



} elseif($npcc ==724){
//需要修改的变量

$wp1="【混沌圣尊链】";//装备名字
$wp2="西游混沌圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=60584;//装备攻击
$wp16=60584;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=139;//装备冰攻
$wp19=139;//装备火攻
$wp20=139;//装备雷攻
//需要修改的变量

$wp21=139;//装备冰防
$wp22=139;//装备火防
$wp23=139;//装备雷防
//需要修改的变量

$wp24=270;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==725){
//需要修改的变量

$wp1="【混沌圣尊镯】";//装备名字
$wp2="西游混沌圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=60458;//装备攻击
$wp16=60458;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=139;//装备冰攻
$wp19=139;//装备火攻
$wp20=139;//装备雷攻
//需要修改的变量

$wp21=139;//装备冰防
$wp22=139;//装备火防
$wp23=139;//装备雷防
//需要修改的变量

$wp24=270;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



} elseif($npcc ==726){
		
	//需要修改的变量

$wp1="【混沌圣尊枪】";//装备名字
$wp2="西游混沌圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=64015;//装备攻击
$wp16=64015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=139;//装备冰攻
$wp19=139;//装备火攻
$wp20=139;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=270;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
} elseif($npcc ==727){
//需要修改的变量

$wp1="【混沌圣尊叉】";//装备名字
$wp2="西游混沌圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=64015;//装备攻击
$wp16=64015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=139;//装备冰攻
$wp19=139;//装备火攻
$wp20=139;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=270;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
} elseif($npcc ==728){
//需要修改的变量

$wp1="【混沌圣尊棍】";//装备名字
$wp2="西游混沌圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=64015;//装备攻击
$wp16=64015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=139;//装备冰攻
$wp19=139;//装备火攻
$wp20=139;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=270;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==729){
//需要修改的变量
$wp1="【混沌圣尊杖】";//装备名字
$wp2="西游混沌圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=64015;//装备攻击
$wp16=64015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=139;//装备冰攻
$wp19=139;//装备火攻
$wp20=139;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=270;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==730){
//需要修改的变量

$wp1="【混沌圣尊剑】";//装备名字
$wp2="西游混沌圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=64015;//装备攻击
$wp16=64015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=139;//装备冰攻
$wp19=139;//装备火攻
$wp20=139;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=270;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	



} elseif($npcc ==731){
//需要修改的变量

$wp1="【鸿蒙天尊甲】";//装备名字
$wp2="西游鸿蒙天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=71258;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=149;//装备冰防
$wp22=149;//装备火防
$wp23=149;//装备雷防
//需要修改的变量

$wp24=280;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
} elseif($npcc ==732){
//需要修改的变量

$wp1="【鸿蒙天尊盔】";//装备名字
$wp2="西游鸿蒙天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=71584;//装备攻击
$wp16=71584;//装备魔攻
$wp17=71584;//装备防御
//需要修改的变量
$wp18=149;//装备冰攻
$wp19=149;//装备火攻
$wp20=149;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=280;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
} elseif($npcc ==733){
//需要修改的变量

$wp1="【鸿蒙天尊靴】";//装备名字
$wp2="西游鸿蒙天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=71587;//装备攻击
$wp16=71587;//装备魔攻
$wp17=71587;//装备防御
//需要修改的变量
$wp18=149;//装备冰攻
$wp19=149;//装备火攻
$wp20=149;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=280;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



} elseif($npcc ==734){
//需要修改的变量

$wp1="【鸿蒙天尊链】";//装备名字
$wp2="西游鸿蒙天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=71584;//装备攻击
$wp16=71584;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=149;//装备冰攻
$wp19=149;//装备火攻
$wp20=149;//装备雷攻
//需要修改的变量

$wp21=149;//装备冰防
$wp22=149;//装备火防
$wp23=149;//装备雷防
//需要修改的变量

$wp24=280;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==735){
//需要修改的变量

$wp1="【鸿蒙天尊镯】";//装备名字
$wp2="西游鸿蒙天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=71458;//装备攻击
$wp16=71458;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=149;//装备冰攻
$wp19=149;//装备火攻
$wp20=149;//装备雷攻
//需要修改的变量

$wp21=149;//装备冰防
$wp22=149;//装备火防
$wp23=149;//装备雷防
//需要修改的变量

$wp24=280;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



} elseif($npcc ==736){
		
	//需要修改的变量

$wp1="【鸿蒙天尊枪】";//装备名字
$wp2="西游鸿蒙天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=75015;//装备攻击
$wp16=75015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=149;//装备冰攻
$wp19=149;//装备火攻
$wp20=149;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=280;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
} elseif($npcc ==737){
//需要修改的变量

$wp1="【鸿蒙天尊叉】";//装备名字
$wp2="西游鸿蒙天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=75015;//装备攻击
$wp16=75015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=149;//装备冰攻
$wp19=149;//装备火攻
$wp20=149;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=280;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
} elseif($npcc ==738){
//需要修改的变量

$wp1="【鸿蒙天尊棍】";//装备名字
$wp2="西游鸿蒙天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=75015;//装备攻击
$wp16=75015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=149;//装备冰攻
$wp19=149;//装备火攻
$wp20=149;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=280;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==739){
//需要修改的变量
$wp1="【鸿蒙天尊杖】";//装备名字
$wp2="西游鸿蒙天级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=75015;//装备攻击
$wp16=75015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=149;//装备冰攻
$wp19=149;//装备火攻
$wp20=149;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=280;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==740){
//需要修改的变量

$wp1="【鸿蒙天尊剑】";//装备名字
$wp2="西游鸿蒙天级装备";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=75015;//装备攻击
$wp16=75015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=149;//装备冰攻
$wp19=149;//装备火攻
$wp20=149;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=280;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==741){
//需要修改的变量

$wp1="【鸿蒙神尊甲】";//装备名字
$wp2="西游鸿蒙神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=83258;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=159;//装备冰防
$wp22=159;//装备火防
$wp23=159;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
} elseif($npcc ==742){
//需要修改的变量

$wp1="【鸿蒙神尊盔】";//装备名字
$wp2="西游鸿蒙神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=83584;//装备攻击
$wp16=83584;//装备魔攻
$wp17=83584;//装备防御
//需要修改的变量
$wp18=159;//装备冰攻
$wp19=159;//装备火攻
$wp20=159;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
} elseif($npcc ==743){
//需要修改的变量

$wp1="【鸿蒙神尊靴】";//装备名字
$wp2="西游鸿蒙神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=83587;//装备攻击
$wp16=83587;//装备魔攻
$wp17=83587;//装备防御
//需要修改的变量
$wp18=159;//装备冰攻
$wp19=159;//装备火攻
$wp20=159;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



} elseif($npcc ==744){
//需要修改的变量

$wp1="【鸿蒙神尊链】";//装备名字
$wp2="西游鸿蒙神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=83584;//装备攻击
$wp16=83584;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=159;//装备冰攻
$wp19=159;//装备火攻
$wp20=159;//装备雷攻
//需要修改的变量

$wp21=159;//装备冰防
$wp22=159;//装备火防
$wp23=159;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==745){
//需要修改的变量

$wp1="【鸿蒙神尊镯】";//装备名字
$wp2="西游鸿蒙神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=83458;//装备攻击
$wp16=83458;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=159;//装备冰攻
$wp19=159;//装备火攻
$wp20=159;//装备雷攻
//需要修改的变量

$wp21=159;//装备冰防
$wp22=159;//装备火防
$wp23=159;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



} elseif($npcc ==746){
		
	//需要修改的变量

$wp1="【鸿蒙神尊枪】";//装备名字
$wp2="西游鸿蒙神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=88015;//装备攻击
$wp16=88015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=159;//装备冰攻
$wp19=159;//装备火攻
$wp20=159;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
} elseif($npcc ==747){
//需要修改的变量

$wp1="【鸿蒙神尊叉】";//装备名字
$wp2="西游鸿蒙神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=88015;//装备攻击
$wp16=88015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=159;//装备冰攻
$wp19=159;//装备火攻
$wp20=159;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
} elseif($npcc ==748){
//需要修改的变量

$wp1="【鸿蒙神尊棍】";//装备名字
$wp2="西游鸿蒙神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=88015;//装备攻击
$wp16=88015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=159;//装备冰攻
$wp19=159;//装备火攻
$wp20=159;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==749){
//需要修改的变量
$wp1="【鸿蒙神尊杖】";//装备名字
$wp2="西游鸿蒙神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=88015;//装备攻击
$wp16=88015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=159;//装备冰攻
$wp19=159;//装备火攻
$wp20=159;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==750){
//需要修改的变量

$wp1="【鸿蒙神尊剑】";//装备名字
$wp2="西游鸿蒙神级装备";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=88015;//装备攻击
$wp16=88015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=159;//装备冰攻
$wp19=159;//装备火攻
$wp20=159;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==751){
//需要修改的变量

$wp1="【鸿蒙圣尊甲】";//装备名字
$wp2="西游鸿蒙圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=95258;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=179;//装备冰防
$wp22=179;//装备火防
$wp23=179;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
} elseif($npcc ==752){
//需要修改的变量

$wp1="【鸿蒙圣尊盔】";//装备名字
$wp2="西游鸿蒙圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=95584;//装备攻击
$wp16=95584;//装备魔攻
$wp17=95584;//装备防御
//需要修改的变量
$wp18=179;//装备冰攻
$wp19=179;//装备火攻
$wp20=179;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
} elseif($npcc ==753){
//需要修改的变量

$wp1="【鸿蒙圣尊靴】";//装备名字
$wp2="西游鸿蒙圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=95587;//装备攻击
$wp16=95587;//装备魔攻
$wp17=95587;//装备防御
//需要修改的变量
$wp18=179;//装备冰攻
$wp19=179;//装备火攻
$wp20=179;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



} elseif($npcc ==754){
//需要修改的变量

$wp1="【鸿蒙圣尊链】";//装备名字
$wp2="西游鸿蒙圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=95584;//装备攻击
$wp16=95584;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=179;//装备冰攻
$wp19=179;//装备火攻
$wp20=179;//装备雷攻
//需要修改的变量

$wp21=179;//装备冰防
$wp22=179;//装备火防
$wp23=179;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==755){
//需要修改的变量

$wp1="【鸿蒙圣尊镯】";//装备名字
$wp2="西游鸿蒙圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=95458;//装备攻击
$wp16=95458;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=179;//装备冰攻
$wp19=179;//装备火攻
$wp20=179;//装备雷攻
//需要修改的变量

$wp21=179;//装备冰防
$wp22=179;//装备火防
$wp23=179;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



} elseif($npcc ==756){
		
	//需要修改的变量

$wp1="【鸿蒙圣尊枪】";//装备名字
$wp2="西游鸿蒙圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=100015;//装备攻击
$wp16=100015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=179;//装备冰攻
$wp19=179;//装备火攻
$wp20=179;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
} elseif($npcc ==757){
//需要修改的变量

$wp1="【鸿蒙圣尊叉】";//装备名字
$wp2="西游鸿蒙圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=100015;//装备攻击
$wp16=100015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=179;//装备冰攻
$wp19=179;//装备火攻
$wp20=179;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
} elseif($npcc ==758){
//需要修改的变量

$wp1="【鸿蒙圣尊棍】";//装备名字
$wp2="西游鸿蒙圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=100015;//装备攻击
$wp16=100015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=179;//装备冰攻
$wp19=179;//装备火攻
$wp20=179;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==759){
//需要修改的变量
$wp1="【鸿蒙圣尊杖】";//装备名字
$wp2="西游鸿蒙圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=100015;//装备攻击
$wp16=100015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=179;//装备冰攻
$wp19=179;//装备火攻
$wp20=179;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==760){
//需要修改的变量

$wp1="【鸿蒙圣尊剑】";//装备名字
$wp2="西游鸿蒙圣级装备";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=100015;//装备攻击
$wp16=100015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=179;//装备冰攻
$wp19=179;//装备火攻
$wp20=179;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=290;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	









} else{

echo "<font color=black>没有这个装备id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}

?>




