<?php

if($npcc ==401){
//需要修改的变量

$wp1="【幻想战甲Ⅰ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想战甲Ⅰ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=3318;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
					} elseif($npcc ==402){
//需要修改的变量

$wp1="【幻想战盔Ⅰ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想战盔Ⅰ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=4214;//装备攻击
$wp16=4214;//装备魔攻
$wp17=3041;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
					} elseif($npcc ==403){
//需要修改的变量

$wp1="【幻想战靴Ⅰ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想战靴Ⅰ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3325;//装备攻击
$wp16=3325;//装备魔攻
$wp17=3325;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



							} elseif($npcc ==404){
//需要修改的变量

$wp1="【幻想项链Ⅰ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想项链Ⅰ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3322;//装备攻击
$wp16=3322;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
								} elseif($npcc ==405){
//需要修改的变量

$wp1="【幻想手镯Ⅰ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想手镯Ⅰ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=4578;//装备攻击
$wp16=4578;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类		
		
		
		
		
					} elseif($npcc ==407){
//需要修改的变量

$wp1="【幻想战甲ⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想战甲ⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=3678;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
					} elseif($npcc ==408){
//需要修改的变量

$wp1="【幻想战盔ⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想战盔ⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5158;//装备攻击
$wp16=5158;//装备魔攻
$wp17=3854;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
					} elseif($npcc ==409){
//需要修改的变量

$wp1="【幻想战靴ⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想战靴ⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=4015;//装备攻击
$wp16=4015;//装备魔攻
$wp17=3888;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



							} elseif($npcc ==410){
//需要修改的变量

$wp1="【幻想项链ⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想项链ⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=3845;//装备攻击
$wp16=3845;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
								} elseif($npcc ==411){
//需要修改的变量

$wp1="【幻想手镯ⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想手镯ⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5048;//装备攻击
$wp16=5048;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		
		
		
		
		
		
		
		
		
		
		
			} elseif($npcc ==412){
//需要修改的变量

$wp1="【幻想叉Ⅰ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想叉Ⅰ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5894;//装备攻击
$wp16=5894;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
				} elseif($npcc ==413){
//需要修改的变量

$wp1="【幻想棍Ⅰ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想棍Ⅰ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5894;//装备攻击
$wp16=5894;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类		
					} elseif($npcc ==414){
//需要修改的变量

$wp1="【幻想仗Ⅰ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想仗Ⅰ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5894;//装备攻击
$wp16=5894;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
						} elseif($npcc ==415){
//需要修改的变量

$wp1="【幻想剑Ⅰ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想剑Ⅰ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5894;//装备攻击
$wp16=5894;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类			
		
		
		
		
		
		
		
		
		
		
		



} elseif($npcc ==416){
//需要修改的变量

$wp1="【元帅戟】";//装备名字
$wp2="将军府武器之【元帅戟】！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5894;//装备攻击
$wp16=5894;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==417){
//需要修改的变量

$wp1="【龙王叉】";//装备名字
$wp2="龙宫武器之【龙王叉】！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5894;//装备攻击
$wp16=5894;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类


} elseif($npcc ==418){
//需要修改的变量

$wp1="【天尊棍】";//装备名字
$wp2="方寸山武器之【天尊棍】！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5894;//装备攻击
$wp16=5894;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类

} elseif($npcc ==419){
//需要修改的变量

$wp1="【菩萨仗】";//装备名字
$wp2="普陀山武器之【菩萨仗】！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5894;//装备攻击
$wp16=5894;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类
} elseif($npcc ==420){
//需要修改的变量

$wp1="【王母剑】";//装备名字
$wp2="月宫武器之【王母剑】！（拾取绑定）";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5894;//装备攻击
$wp16=5894;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类



	
		
} elseif($npcc ==421){
		
	//需要修改的变量

$wp1="【幻想枪ⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想枪ⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=6688;//装备攻击
$wp16=6688;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
			} elseif($npcc ==422){
//需要修改的变量

$wp1="【幻想叉ⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想叉ⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=6688;//装备攻击
$wp16=6688;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
				} elseif($npcc ==423){
//需要修改的变量

$wp1="【幻想棍ⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想棍ⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=6688;//装备攻击
$wp16=6688;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类		
					} elseif($npcc ==424){
//需要修改的变量

$wp1="【幻想仗ⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想仗ⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=6688;//装备攻击
$wp16=6688;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
						} elseif($npcc ==425){
//需要修改的变量

$wp1="【幻想剑ⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想剑ⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=6688;//装备攻击
$wp16=6688;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=109;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类			
		
} elseif($npcc ==426){
//需要修改的变量
$wp1="〖小兽爪〗";//装备名字
$wp2="宠物可穿戴的初级武器";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=158;//装备攻击
$wp16=158;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=1;//装备冰攻
$wp19=1;//装备火攻
$wp20=1;//装备雷攻
//需要修改的变量
$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=3;//装备分类		

} elseif($npcc ==427){
//需要修改的变量
$wp1="〖小兽甲〗";//装备名字
$wp2="宠物可穿戴的初级衣服";//装备描述
//需要修改的变量
$wp14=600;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=100;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=1;//装备冰防
$wp22=1;//装备火防
$wp23=1;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=4;//装备分类	

} elseif($npcc ==428){
//需要修改的变量
$wp1="〖小兽盔〗";//装备名字
$wp2="宠物可穿戴的初级头盔";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=80;//装备攻击
$wp16=80;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=1;//装备冰防
$wp22=1;//装备火防
$wp23=1;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=5;//装备分类	

} elseif($npcc ==429){
//需要修改的变量
$wp1="〖小兽靴〗";//装备名字
$wp2="宠物可穿戴的初级鞋子";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=69;//装备攻击
$wp16=69;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=1;//装备冰攻
$wp19=1;//装备火攻
$wp20=1;//装备雷攻
//需要修改的变量
$wp21=1;//装备冰防
$wp22=1;//装备火防
$wp23=1;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=6;//装备分类	

} elseif($npcc ==430){
//需要修改的变量
$wp1="〖小兽链〗";//装备名字
$wp2="宠物可佩戴带的初级项链";//装备描述
//需要修改的变量
$wp14=500;//装备hp
$wp15=69;//装备攻击
$wp16=69;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=1;//装备冰攻
$wp19=1;//装备火攻
$wp20=1;//装备雷攻
//需要修改的变量
$wp21=1;//装备冰防
$wp22=1;//装备火防
$wp23=1;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=7;//装备分类	

} elseif($npcc ==431){
//需要修改的变量
$wp1="〖小兽镯〗";//装备名字
$wp2="宠物可佩戴的初级手镯";//装备描述
//需要修改的变量
$wp14=525;//装备hp
$wp15=77;//装备攻击
$wp16=77;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=1;//装备冰攻
$wp19=1;//装备火攻
$wp20=1;//装备雷攻
//需要修改的变量
$wp21=1;//装备冰防
$wp22=1;//装备火防
$wp23=1;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=8;//装备分类	


} elseif($npcc ==432){
//需要修改的变量
$wp1="【心有灵犀】（婚戒）";//装备名字
$wp2="【心有灵犀】（婚戒）象征着彼此相爱恋人的信物";//装备描述
//需要修改的变量
$wp14=6858;//装备hp
$wp15=2125;//装备攻击
$wp16=2125;//装备魔攻
$wp17=1852;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量
$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量
$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=9;//装备分类

} elseif($npcc ==433){
//需要修改的变量
$wp1="【心有灵犀】（婚链）";//装备名字
$wp2="【心有灵犀】（婚链）象征着彼此相爱恋人的信物";//装备描述
//需要修改的变量
$wp14=6858;//装备hp
$wp15=2125;//装备攻击
$wp16=2125;//装备魔攻
$wp17=1852;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量
$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量
$wp24=99;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=10;//装备分类

} elseif($npcc ==434){
//需要修改的变量
$wp1="【山盟海誓】（婚戒）";//装备名字
$wp2="【山盟海誓】（婚戒）象征着彼此相爱恋人的信物";//装备描述
//需要修改的变量
$wp14=11258;//装备hp
$wp15=4252;//装备攻击
$wp16=4252;//装备魔攻
$wp17=3645;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=9;//装备分类

} elseif($npcc ==435){
//需要修改的变量
$wp1="【山盟海誓】（婚链）";//装备名字
$wp2="【山盟海誓】（婚链）象征着彼此相爱恋人的信物";//装备描述
//需要修改的变量
$wp14=11258;//装备hp
$wp15=4252;//装备攻击
$wp16=4252;//装备魔攻
$wp17=3645;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=10;//装备分类



} elseif($npcc ==436){
//需要修改的变量
$wp1="【比翼双飞の婚戒】（典藏版）";//装备名字
$wp2="【比翼双飞の婚戒】（典藏版）在天愿作比翼鸟，在地愿为连理枝";//装备描述
//需要修改的变量
$wp14=21125;//装备hp
$wp15=7521;//装备攻击
$wp16=7521;//装备魔攻
$wp17=7894;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量
$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量
$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=9;//装备分类

} elseif($npcc ==437){
//需要修改的变量
$wp1="【比翼双飞の婚链】（典藏版）";//装备名字
$wp2="【比翼双飞の婚链】（典藏版）在天愿作比翼鸟，在地愿为连理枝";//装备描述
//需要修改的变量
$wp14=23125;//装备hp
$wp15=7721;//装备攻击
$wp16=7769;//装备魔攻
$wp17=8012;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量
$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量
$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=10;//装备分类





	} elseif($npcc ==438){
		
	//需要修改的变量

$wp1="【幻想枪ⅠⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想枪ⅠⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7821;//装备攻击
$wp16=7821;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
			} elseif($npcc ==439){
//需要修改的变量

$wp1="【幻想叉ⅠⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想叉ⅠⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7821;//装备攻击
$wp16=7821;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
				} elseif($npcc ==440){
//需要修改的变量

$wp1="【幻想棍ⅠⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想棍ⅠⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7821;//装备攻击
$wp16=7821;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类		
					} elseif($npcc ==441){
//需要修改的变量

$wp1="【幻想仗ⅠⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想仗ⅠⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7821;//装备攻击
$wp16=7821;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
						} elseif($npcc ==442){
//需要修改的变量

$wp1="【幻想剑ⅠⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想剑ⅠⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7821;//装备攻击
$wp16=7821;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	

	



					} elseif($npcc ==443){
//需要修改的变量

$wp1="【幻想战甲ⅠⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想战甲ⅠⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=4578;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
					} elseif($npcc ==444){
//需要修改的变量

$wp1="【幻想战盔ⅠⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想战盔ⅠⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=6158;//装备攻击
$wp16=6158;//装备魔攻
$wp17=5854;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
					} elseif($npcc ==445){
//需要修改的变量

$wp1="【幻想战靴ⅠⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想战靴ⅠⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=4715;//装备攻击
$wp16=4715;//装备魔攻
$wp17=4888;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



							} elseif($npcc ==446){
//需要修改的变量

$wp1="【幻想项链ⅠⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想项链ⅠⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=4877;//装备攻击
$wp16=4877;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
								} elseif($npcc ==447){
//需要修改的变量

$wp1="【幻想手镯ⅠⅠⅠ】";//装备名字
$wp2="小轩西游vip玩家专属【幻想手镯ⅠⅠⅠ】";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5448;//装备攻击
$wp16=5448;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=139;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		
		


} elseif($npcc ==448){
//需要修改的变量

$wp1="【诛仙战甲】";//装备名字
$wp2="此乃九天异铁落入凡间，枯心上人在北极冰原偶得，修炼而成";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=5325;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=35;//装备冰防
$wp22=35;//装备火防
$wp23=35;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
					} elseif($npcc ==449){
//需要修改的变量

$wp1="【诛仙战盔】";//装备名字
$wp2="此乃九天异铁落入凡间，枯心上人在北极冰原偶得，修炼而成";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=7015;//装备攻击
$wp16=7015;//装备魔攻
$wp17=7015;//装备防御
//需要修改的变量
$wp18=35;//装备冰攻
$wp19=35;//装备火攻
$wp20=35;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
					} elseif($npcc ==450){
//需要修改的变量

$wp1="【诛仙战靴】";//装备名字
$wp2="此乃九天异铁落入凡间，枯心上人在北极冰原偶得，修炼而成";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5515;//装备攻击
$wp16=5515;//装备魔攻
$wp17=5674;//装备防御
//需要修改的变量
$wp18=35;//装备冰攻
$wp19=35;//装备火攻
$wp20=35;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



							} elseif($npcc ==451){
//需要修改的变量

$wp1="【诛仙项链】";//装备名字
$wp2="此乃九天异铁落入凡间，枯心上人在北极冰原偶得，修炼而成";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5684;//装备攻击
$wp16=5684;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=35;//装备冰攻
$wp19=35;//装备火攻
$wp20=35;//装备雷攻
//需要修改的变量

$wp21=35;//装备冰防
$wp22=35;//装备火防
$wp23=35;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==452){
//需要修改的变量

$wp1="【诛仙手镯】";//装备名字
$wp2="此乃九天异铁落入凡间，枯心上人在北极冰原偶得，修炼而成";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=5984;//装备攻击
$wp16=5984;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=35;//装备冰攻
$wp19=35;//装备火攻
$wp20=35;//装备雷攻
//需要修改的变量

$wp21=35;//装备冰防
$wp22=35;//装备火防
$wp23=35;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



	} elseif($npcc ==453){
		
	//需要修改的变量

$wp1="【诛仙枪】";//装备名字
$wp2="此乃九天异铁落入凡间，枯心上人在北极冰原偶得，修炼而成";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=8815;//装备攻击
$wp16=8815;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=35;//装备冰攻
$wp19=35;//装备火攻
$wp20=35;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
			} elseif($npcc ==454){
//需要修改的变量

$wp1="【诛仙叉】";//装备名字
$wp2="此乃九天异铁落入凡间，枯心上人在北极冰原偶得，修炼而成";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=8815;//装备攻击
$wp16=8815;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=35;//装备冰攻
$wp19=35;//装备火攻
$wp20=35;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
				} elseif($npcc ==455){
//需要修改的变量

$wp1="【诛仙棍】";//装备名字
$wp2="此乃九天异铁落入凡间，枯心上人在北极冰原偶得，修炼而成";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=8815;//装备攻击
$wp16=8815;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=35;//装备冰攻
$wp19=35;//装备火攻
$wp20=35;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类		
					} elseif($npcc ==456){
//需要修改的变量

$wp1="【诛仙仗】";//装备名字
$wp2="此乃九天异铁落入凡间，枯心上人在北极冰原偶得，修炼而成";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=8815;//装备攻击
$wp16=8815;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=35;//装备冰攻
$wp19=35;//装备火攻
$wp20=35;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
						} elseif($npcc ==457){
//需要修改的变量

$wp1="【诛仙剑】";//装备名字
$wp2="此乃九天异铁落入凡间，枯心上人在北极冰原偶得，修炼而成";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=8815;//装备攻击
$wp16=8815;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=35;//装备冰攻
$wp19=35;//装备火攻
$wp20=35;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=159;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	

	
	
	
	
	
	
} elseif($npcc ==458){
//需要修改的变量
$wp1="〖大兽爪〗";//装备名字
$wp2="宠物可穿戴的中级武器";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=658;//装备攻击
$wp16=658;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量
$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量
$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=3;//装备分类		

} elseif($npcc ==459){
//需要修改的变量
$wp1="〖大兽甲〗";//装备名字
$wp2="宠物可穿戴的中级衣服";//装备描述
//需要修改的变量
$wp14=1600;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=600;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量
$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=4;//装备分类	

} elseif($npcc ==460){
//需要修改的变量
$wp1="〖大兽盔〗";//装备名字
$wp2="宠物可穿戴的中级头盔";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=580;//装备攻击
$wp16=580;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量
$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=5;//装备分类	

} elseif($npcc ==461){
//需要修改的变量
$wp1="〖大兽靴〗";//装备名字
$wp2="宠物可穿戴的中级鞋子";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=569;//装备攻击
$wp16=569;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量
$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量
$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=6;//装备分类	

} elseif($npcc ==462){
//需要修改的变量
$wp1="〖大兽链〗";//装备名字
$wp2="宠物可佩戴带的中级项链";//装备描述
//需要修改的变量
$wp14=1500;//装备hp
$wp15=569;//装备攻击
$wp16=569;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量
$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量
$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=7;//装备分类	

} elseif($npcc ==463){
//需要修改的变量
$wp1="〖大兽镯〗";//装备名字
$wp2="宠物可佩戴的中级手镯";//装备描述
//需要修改的变量
$wp14=1525;//装备hp
$wp15=577;//装备攻击
$wp16=577;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=5;//装备冰攻
$wp19=5;//装备火攻
$wp20=5;//装备雷攻
//需要修改的变量
$wp21=5;//装备冰防
$wp22=5;//装备火防
$wp23=5;//装备雷防
//需要修改的变量
$wp24=60;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=8;//装备分类		
	
	
	
	
} elseif($npcc ==464){
//需要修改的变量
$wp1="〖顽兽爪〗";//装备名字
$wp2="宠物可穿戴的高级武器";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=1158;//装备攻击
$wp16=1158;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量
$wp24=100;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=3;//装备分类		

} elseif($npcc ==465){
//需要修改的变量
$wp1="〖顽兽甲〗";//装备名字
$wp2="宠物可穿戴的高级衣服";//装备描述
//需要修改的变量
$wp14=2600;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1100;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=100;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=4;//装备分类	

} elseif($npcc ==466){
//需要修改的变量
$wp1="〖顽兽盔〗";//装备名字
$wp2="宠物可穿戴的高级头盔";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=1080;//装备攻击
$wp16=1080;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=100;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=5;//装备分类	

} elseif($npcc ==467){
//需要修改的变量
$wp1="〖顽兽靴〗";//装备名字
$wp2="宠物可穿戴的高级鞋子";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=1069;//装备攻击
$wp16=1069;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=100;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=6;//装备分类	

} elseif($npcc ==468){
//需要修改的变量
$wp1="〖顽兽链〗";//装备名字
$wp2="宠物可佩戴带的高级项链";//装备描述
//需要修改的变量
$wp14=2500;//装备hp
$wp15=1069;//装备攻击
$wp16=1069;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=100;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=7;//装备分类	

} elseif($npcc ==469){
//需要修改的变量
$wp1="〖顽兽镯〗";//装备名字
$wp2="宠物可佩戴的高级手镯";//装备描述
//需要修改的变量
$wp14=2525;//装备hp
$wp15=1077;//装备攻击
$wp16=1077;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=100;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=8;//装备分类	
	
	
} elseif($npcc ==470){
//需要修改的变量
$wp1="〖猛兽爪〗";//装备名字
$wp2="宠物可穿戴的猛兽级武器";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=1658;//装备攻击
$wp16=1658;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量
$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量
$wp24=120;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=3;//装备分类		

} elseif($npcc ==471){
//需要修改的变量
$wp1="〖猛兽甲〗";//装备名字
$wp2="宠物可穿戴的猛兽级衣服";//装备描述
//需要修改的变量
$wp14=3100;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1100;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量
$wp24=120;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=4;//装备分类	

} elseif($npcc ==472){
//需要修改的变量
$wp1="〖猛兽盔〗";//装备名字
$wp2="宠物可穿戴的猛兽级头盔";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=1580;//装备攻击
$wp16=1580;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量
$wp24=120;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=5;//装备分类	

} elseif($npcc ==473){
//需要修改的变量
$wp1="〖猛兽靴〗";//装备名字
$wp2="宠物可穿戴的猛兽级鞋子";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=1569;//装备攻击
$wp16=1569;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量
$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量
$wp24=120;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=6;//装备分类	

} elseif($npcc ==474){
//需要修改的变量
$wp1="〖猛兽链〗";//装备名字
$wp2="宠物可佩戴带的猛兽级项链";//装备描述
//需要修改的变量
$wp14=3000;//装备hp
$wp15=1569;//装备攻击
$wp16=1569;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量
$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量
$wp24=120;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=7;//装备分类	

} elseif($npcc ==475){
//需要修改的变量
$wp1="〖猛兽镯〗";//装备名字
$wp2="宠物可佩戴的猛兽级手镯";//装备描述
//需要修改的变量
$wp14=3025;//装备hp
$wp15=1577;//装备攻击
$wp16=1577;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=15;//装备冰攻
$wp19=15;//装备火攻
$wp20=15;//装备雷攻
//需要修改的变量
$wp21=15;//装备冰防
$wp22=15;//装备火防
$wp23=15;//装备雷防
//需要修改的变量
$wp24=120;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=8;//装备分类	
	
	
	
	
} elseif($npcc ==476){
//需要修改的变量
$wp1="〖神兽兽爪〗";//装备名字
$wp2="宠物可穿戴的神兽级武器";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=2158;//装备攻击
$wp16=2158;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量
$wp24=150;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=3;//装备分类		

} elseif($npcc ==477){
//需要修改的变量
$wp1="〖神兽兽甲〗";//装备名字
$wp2="宠物可穿戴的神兽级衣服";//装备描述
//需要修改的变量
$wp14=5000;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1600;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=150;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=4;//装备分类	

} elseif($npcc ==478){
//需要修改的变量
$wp1="〖神兽兽盔〗";//装备名字
$wp2="宠物可穿戴的神兽级头盔";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=2080;//装备攻击
$wp16=2080;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=150;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=5;//装备分类	

} elseif($npcc ==479){
//需要修改的变量
$wp1="〖神兽兽靴〗";//装备名字
$wp2="宠物可穿戴的神兽级鞋子";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=2069;//装备攻击
$wp16=2069;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=150;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=6;//装备分类	

} elseif($npcc ==480){
//需要修改的变量
$wp1="〖神兽兽链〗";//装备名字
$wp2="宠物可佩戴带的神兽级项链";//装备描述
//需要修改的变量
$wp14=5500;//装备hp
$wp15=2069;//装备攻击
$wp16=2069;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=150;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=7;//装备分类	

} elseif($npcc ==481){
//需要修改的变量
$wp1="〖神兽兽镯〗";//装备名字
$wp2="宠物可佩戴的神兽级手镯";//装备描述
//需要修改的变量
$wp14=5025;//装备hp
$wp15=2077;//装备攻击
$wp16=2077;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=150;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=8;//装备分类	
	
	
} elseif($npcc ==482){
//需要修改的变量
$wp1="〖圣兽兽爪〗";//装备名字
$wp2="宠物可穿戴的圣兽级武器";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=3058;//装备攻击
$wp16=3058;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量
$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量
$wp24=180;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=3;//装备分类		

} elseif($npcc ==483){
//需要修改的变量
$wp1="〖圣兽兽甲〗";//装备名字
$wp2="宠物可穿戴的圣兽级衣服";//装备描述
//需要修改的变量
$wp14=6000;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2100;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量
$wp24=180;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=4;//装备分类	

} elseif($npcc ==484){
//需要修改的变量
$wp1="〖圣兽兽盔〗";//装备名字
$wp2="宠物可穿戴的圣兽级头盔";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=2580;//装备攻击
$wp16=2580;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量
$wp24=180;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=5;//装备分类	

} elseif($npcc ==485){
//需要修改的变量
$wp1="〖圣兽兽靴〗";//装备名字
$wp2="宠物可穿戴的圣兽级鞋子";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=2569;//装备攻击
$wp16=2569;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=180;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=6;//装备分类	

} elseif($npcc ==486){
//需要修改的变量
$wp1="〖圣兽兽链〗";//装备名字
$wp2="宠物可佩戴带的圣兽级项链";//装备描述
//需要修改的变量
$wp14=6000;//装备hp
$wp15=2569;//装备攻击
$wp16=2569;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量
$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量
$wp24=180;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=7;//装备分类	

} elseif($npcc ==487){
//需要修改的变量
$wp1="〖圣兽兽镯〗";//装备名字
$wp2="宠物可佩戴的圣兽级手镯";//装备描述
//需要修改的变量
$wp14=6025;//装备hp
$wp15=2577;//装备攻击
$wp16=2577;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=25;//装备冰攻
$wp19=25;//装备火攻
$wp20=25;//装备雷攻
//需要修改的变量
$wp21=25;//装备冰防
$wp22=25;//装备火防
$wp23=25;//装备雷防
//需要修改的变量
$wp24=180;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=8;//装备分类	
	
	

} elseif($npcc ==488){
//需要修改的变量
$wp1="〖玛雅兽爪〗";//装备名字
$wp2="玛雅宠物装，这是历代玛雅人的智慧与结晶";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=5000;//装备攻击
$wp16=5000;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=3;//装备分类		

} elseif($npcc ==489){
//需要修改的变量
$wp1="〖玛雅兽甲〗";//装备名字
$wp2="玛雅宠物装，这是历代玛雅人的智慧与结晶";//装备描述
//需要修改的变量
$wp14=8000;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=4100;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=4;//装备分类	

} elseif($npcc ==490){
//需要修改的变量
$wp1="〖玛雅兽盔〗";//装备名字
$wp2="玛雅宠物装，这是历代玛雅人的智慧与结晶";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=3580;//装备攻击
$wp16=3580;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=5;//装备分类	

} elseif($npcc ==491){
//需要修改的变量
$wp1="〖玛雅兽靴〗";//装备名字
$wp2="玛雅宠物装，这是历代玛雅人的智慧与结晶";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=3669;//装备攻击
$wp16=3669;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=6;//装备分类	

} elseif($npcc ==492){
//需要修改的变量
$wp1="〖玛雅兽链〗";//装备名字
$wp2="玛雅宠物装，这是历代玛雅人的智慧与结晶";//装备描述
//需要修改的变量
$wp14=8000;//装备hp
$wp15=3569;//装备攻击
$wp16=3569;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=7;//装备分类	

} elseif($npcc ==493){
//需要修改的变量
$wp1="〖玛雅兽镯〗";//装备名字
$wp2="玛雅宠物装，这是历代玛雅人的智慧与结晶";//装备描述
//需要修改的变量
$wp14=8025;//装备hp
$wp15=3487;//装备攻击
$wp16=3487;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=1;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=7;//装备门派
$wp30=8;//装备分类		
	
	
} elseif($npcc ==494){

//需要修改的变量

$wp1="【红莲怒火】（GM版）";//装备名字
$wp2="小轩GM专属法宝-所向披靡百战百胜（拾取绑定）";//装备描述
//需要修改的变量

$wp14=99999;//装备hp
$wp15=99999;//装备攻击
$wp16=99999;//装备魔攻
$wp17=99999;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=1;//装备分类


} elseif($npcc ==495){

//需要修改的变量

$wp1="【冰火麒麟】（GM版）";//装备名字
$wp2="小轩GM专属坐骑-所向披靡百战百胜（拾取绑定）";//装备描述
//需要修改的变量

$wp14=99999;//装备hp
$wp15=99999;//装备攻击
$wp16=99999;//装备魔攻
$wp17=99999;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类



} elseif($npcc ==496){

//需要修改的变量

$wp1="【帝王权杖】（GM版）";//装备名字
$wp2="小轩GM专属武器-所向披靡百战百胜（拾取绑定）";//装备描述
//需要修改的变量

$wp14=99999;//装备hp
$wp15=99999;//装备攻击
$wp16=99999;//装备魔攻
$wp17=99999;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=3;//装备分类
	
	
	
} elseif($npcc ==497){

//需要修改的变量

$wp1="【帝王战甲】（GM版）";//装备名字
$wp2="小轩GM专属战甲-所向披靡百战百胜（拾取绑定）";//装备描述
//需要修改的变量

$wp14=99999;//装备hp
$wp15=99999;//装备攻击
$wp16=99999;//装备魔攻
$wp17=99999;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类
	
	
	
} elseif($npcc ==498){

//需要修改的变量

$wp1="【帝王战盔】（GM版）";//装备名字
$wp2="小轩GM专属头盔-所向披靡百战百胜（拾取绑定）";//装备描述
//需要修改的变量

$wp14=99999;//装备hp
$wp15=99999;//装备攻击
$wp16=99999;//装备魔攻
$wp17=99999;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类
	
	

} elseif($npcc ==499){

//需要修改的变量

$wp1="【帝王战靴】（GM版）";//装备名字
$wp2="小轩GM专属鞋子-所向披靡百战百胜（拾取绑定）";//装备描述
//需要修改的变量

$wp14=99999;//装备hp
$wp15=99999;//装备攻击
$wp16=99999;//装备魔攻
$wp17=99999;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类	
	
	
	
} elseif($npcc ==500){

//需要修改的变量

$wp1="【帝王项链】（GM版）";//装备名字
$wp2="小轩GM专属项链-所向披靡百战百胜（拾取绑定）";//装备描述
//需要修改的变量

$wp14=99999;//装备hp
$wp15=99999;//装备攻击
$wp16=99999;//装备魔攻
$wp17=99999;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
	
	

	
	
	
	
	
	
	
	
	
	
	






} else{

echo "<font color=black>没有这个装备id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}

?>




