<?php

	if($npcc ==301){


	//需要修改的变量

$wp1="【帝王仙杖】";//装备名字
$wp2="西游小皇帝专属装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=19015;//装备攻击
$wp16=19015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=70;//装备冰攻
$wp19=70;//装备火攻
$wp20=70;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==602){
//需要修改的变量

$wp1="【帝王仙剑】";//装备名字
$wp2="西游小皇帝专属装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=19015;//装备攻击
$wp16=19015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=70;//装备冰攻
$wp19=70;//装备火攻
$wp20=70;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	


} elseif($npcc ==603){
//需要修改的变量
$wp1="【镇东神兽】青龙☯神";//装备名字
$wp2="【镇东神兽】青龙☯神-十分威风的神品坐骑";//装备描述

$wp14=46555;//装备hp
$wp15=7522;//装备攻击
$wp16=7522;//装备魔攻
$wp17=7159;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类


} elseif($npcc ==604){



//需要修改的变量

$wp1="【镇东神兽】白虎☯神";//装备名字
$wp2="【镇东神兽】白虎☯神-十分威风的神品坐骑";//装备描述
//需要修改的变量

$wp14=18888;//装备hp
$wp15=11859;//装备攻击
$wp16=7522;//装备魔攻
$wp17=6159;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类

} elseif($npcc ==605){



//需要修改的变量

$wp1="【镇东神兽】朱雀☯神";//装备名字
$wp2="【镇东神兽】朱雀☯神-十分威风的神品坐骑";//装备描述
//需要修改的变量

$wp14=18888;//装备hp
$wp15=7522;//装备攻击
$wp16=11859;//装备魔攻
$wp17=6159;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量

$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类





} elseif($npcc ==606){



//需要修改的变量

$wp1="【镇东神兽】玄武☯神";//装备名字
$wp2="【镇东神兽】玄武☯神-十分威风的神品坐骑";//装备描述
//需要修改的变量
$wp14=18888;//装备hp
$wp15=7522;//装备攻击
$wp16=7522;//装备魔攻
$wp17=11859;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量

$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=179;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类





} elseif($npcc ==607){
//需要修改的变量
$wp1="【镇东至尊兽】青龙☯至尊";//装备名字
$wp2="【镇东至尊兽】青龙☯至尊-十分威风的至尊-坐骑";//装备描述

$wp14=66555;//装备hp
$wp15=9522;//装备攻击
$wp16=9522;//装备魔攻
$wp17=9159;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类


} elseif($npcc ==608){



//需要修改的变量

$wp1="【镇东至尊兽】白虎☯至尊";//装备名字
$wp2="【镇东至尊兽】白虎☯至尊-十分威风的至尊-坐骑";//装备描述
//需要修改的变量

$wp14=28888;//装备hp
$wp15=16859;//装备攻击
$wp16=9522;//装备魔攻
$wp17=8159;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类

} elseif($npcc ==609){



//需要修改的变量

$wp1="【镇东至尊兽】朱雀☯至尊";//装备名字
$wp2="【镇东至尊兽】朱雀☯至尊-十分威风的至尊-坐骑";//装备描述
//需要修改的变量

$wp14=28888;//装备hp
$wp15=9522;//装备攻击
$wp16=16859;//装备魔攻
$wp17=8159;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量

$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类





} elseif($npcc ==610){



//需要修改的变量

$wp1="【镇东至尊兽】玄武☯至尊";//装备名字
$wp2="【镇东至尊兽】玄武☯至尊-十分威风的至尊-坐骑";//装备描述
//需要修改的变量
$wp14=28888;//装备hp
$wp15=9522;//装备攻击
$wp16=9522;//装备魔攻
$wp17=16859;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量

$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量
$wp24=199;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类


} elseif($npcc ==611){
//需要修改的变量
$wp1="【天尊神兽】（青龙）";//装备名字
$wp2="【天尊神兽】（青龙）-十分威风的天尊-坐骑";//装备描述

$wp14=108970;//装备hp
$wp15=11522;//装备攻击
$wp16=11522;//装备魔攻
$wp17=11159;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类


} elseif($npcc ==612){



//需要修改的变量

$wp1="【天尊神兽】（白虎）";//装备名字
$wp2="【天尊神兽】（白虎）-十分威风的天尊-坐骑";//装备描述
//需要修改的变量

$wp14=38888;//装备hp
$wp15=20859;//装备攻击
$wp16=11522;//装备魔攻
$wp17=11522;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类

} elseif($npcc ==613){



//需要修改的变量

$wp1="【天尊神兽】（朱雀）";//装备名字
$wp2="【天尊神兽】（朱雀）-十分威风的天尊-坐骑";//装备描述
//需要修改的变量

$wp14=38888;//装备hp
$wp15=11522;//装备攻击
$wp16=20859;//装备魔攻
$wp17=11522;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类





} elseif($npcc ==614){



//需要修改的变量

$wp1="【天尊神兽】（玄武）";//装备名字
$wp2="【天尊神兽】（玄武）-十分威风的天尊-坐骑";//装备描述
//需要修改的变量
$wp14=38888;//装备hp
$wp15=11522;//装备攻击
$wp16=11522;//装备魔攻
$wp17=20859;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量

$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=2;//装备分类


} elseif($npcc ==615){
//需要修改的变量
$wp1="【天仙之恋の婚戒】";//装备名字
$wp2="【天仙之恋の婚戒】挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=60000;//装备hp
$wp15=30000;//装备攻击
$wp16=30000;//装备魔攻
$wp17=30000;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量
$wp21=60;//装备冰防
$wp22=60;//装备火防
$wp23=60;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=9;//装备分类

} elseif($npcc ==616){
//需要修改的变量
$wp1="【天仙之恋の婚链】";//装备名字
$wp2="【天仙之恋の婚链】挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=60000;//装备hp
$wp15=30000;//装备攻击
$wp16=30000;//装备魔攻
$wp17=30000;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量
$wp21=60;//装备冰防
$wp22=60;//装备火防
$wp23=60;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=10;//装备分类


} elseif($npcc ==617){
//需要修改的变量
$wp1="【天尊之恋の婚戒】（典藏版）";//装备名字
$wp2="【天尊之恋の婚戒】（典藏版）挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=70000;//装备hp
$wp15=30000;//装备攻击
$wp16=30000;//装备魔攻
$wp17=30000;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量
$wp21=60;//装备冰防
$wp22=60;//装备火防
$wp23=60;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=9;//装备分类

} elseif($npcc ==618){
//需要修改的变量
$wp1="【天尊之恋の婚链】（典藏版）";//装备名字
$wp2="【天尊之恋の婚链】（典藏版）挚爱一生你值得拥有~~~";//装备描述
//需要修改的变量
$wp14=70000;//装备hp
$wp15=30000;//装备攻击
$wp16=30000;//装备魔攻
$wp17=30000;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量
$wp21=60;//装备冰防
$wp22=60;//装备火防
$wp23=60;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=10;//装备分类


} elseif($npcc ==619){



//需要修改的变量

$wp1="【天尊の披风】";//装备名字
$wp2="仙气环绕，光彩夺目，非凡间之物，极为少有";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=15245;//装备攻击
$wp16=15245;//装备魔攻
$wp17=14451;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量

$wp21=60;//装备冰防
$wp22=60;//装备火防
$wp23=60;//装备雷防
//需要修改的变量

$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=11;//装备分类


} elseif($npcc ==620){
//需要修改的变量
$wp1="【如意金箍棒】（20级）";//装备名字
$wp2="【如意金箍棒】号令天下，谁敢不从，能够自动收缩抽打敌人";//装备描述
//需要修改的变量
$wp14=400000;//装备hp
$wp15=40000;//装备攻击
$wp16=40000;//装备魔攻
$wp17=40000;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量
$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量
$wp24=200;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=1;//装备分类





} elseif($npcc ==621){
//需要修改的变量
$wp1="【小恶魔の魔翼】";//装备名字
$wp2="时装位置：翅膀【小恶魔の魔翼】（1级时装）";//装备描述
//需要修改的变量
$wp14=20000*3;//装备hp
$wp15=1000*3;//装备攻击
$wp16=1000*3;//装备魔攻
$wp17=1000*3;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=12;//装备分类

} elseif($npcc ==622){
//需要修改的变量
$wp1="【小恶魔の魔杖】";//装备名字
$wp2="时装位置：武器【小恶魔の魔杖】（1级时装）";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=1000*3;//装备攻击
$wp16=1000*3;//装备魔攻
$wp17=1000*3;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=13;//装备分类


} elseif($npcc ==623){
//需要修改的变量
$wp1="【小恶魔の魔盾】";//装备名字
$wp2="时装位置：副手【小恶魔の魔盾】（1级时装）";//装备描述
//需要修改的变量
$wp14=15000*3;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1500*3;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=14;//装备分类



} elseif($npcc ==624){
//需要修改的变量
$wp1="【小恶魔の魔镜】";//装备名字
$wp2="时装位置：面具【小恶魔の魔镜】（1级时装）";//装备描述
//需要修改的变量
$wp14=1000*3;//装备hp
$wp15=1000*3;//装备攻击
$wp16=1000*3;//装备魔攻
$wp17=1000*3;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=15;//装备分类


} elseif($npcc ==625){
//需要修改的变量
$wp1="【小恶魔の魔服】";//装备名字
$wp2="时装位置：衣服【小恶魔の魔服】（1级时装）";//装备描述
//需要修改的变量
$wp14=10000*3;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1500*3;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=16;//装备分类



} elseif($npcc ==626){
//需要修改的变量
$wp1="【小恶魔の魔靴】";//装备名字
$wp2="时装位置：鞋子【小恶魔の魔靴】（1级时装）";//装备描述
//需要修改的变量
$wp14=1000*3;//装备hp
$wp15=1000*3;//装备攻击
$wp16=1000*3;//装备魔攻
$wp17=1000*3;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=17;//装备分类



} elseif($npcc ==627){
//需要修改的变量
$wp1="【小恶魔の魔戒】";//装备名字
$wp2="时装位置：戒指【小恶魔の魔戒】（1级时装）";//装备描述
//需要修改的变量
$wp14=5000*3;//装备hp
$wp15=1500*3;//装备攻击
$wp16=1500*3;//装备魔攻
$wp17=1500*3;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=18;//装备分类



} elseif($npcc ==628){
//需要修改的变量
$wp1="【小恶魔の魔链】";//装备名字
$wp2="时装位置：项链【小恶魔の魔链】（1级时装）";//装备描述
//需要修改的变量
$wp14=5000*3;//装备hp
$wp15=1500*3;//装备攻击
$wp16=1500*3;//装备魔攻
$wp17=1500*3;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=19;//装备分类

} elseif($npcc ==629){
//需要修改的变量
$wp1="【小恶魔の魔袍】";//装备名字
$wp2="时装位置：披风【小恶魔の魔袍】（1级时装）";//装备描述
//需要修改的变量
$wp14=5000*3;//装备hp
$wp15=1200*3;//装备攻击
$wp16=1200*3;//装备魔攻
$wp17=1200*3;//装备防御
//需要修改的变量
$wp18=10;//装备冰攻
$wp19=10;//装备火攻
$wp20=10;//装备雷攻
//需要修改的变量
$wp21=10;//装备冰防
$wp22=10;//装备火防
$wp23=10;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=20;//装备分类

} elseif($npcc ==630){
//需要修改的变量
$wp1="【小恶魔の十字勋章】";//装备名字
$wp2="时装位置：勋章【小恶魔の十字勋章】（1级时装）";//装备描述
//需要修改的变量
$wp14=5000*3;//装备hp
$wp15=1500*3;//装备攻击
$wp16=1500*3;//装备魔攻
$wp17=1500*3;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=21;//装备分类



} elseif($npcc ==631){
//需要修改的变量
$wp1="【小天使の神翼】";//装备名字
$wp2="时装位置：翅膀【小天使の神翼】（2级时装）";//装备描述
//需要修改的变量
$wp14=22000*3;//装备hp
$wp15=1200*3;//装备攻击
$wp16=1200*3;//装备魔攻
$wp17=1200*3;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=12;//装备分类

} elseif($npcc ==632){
//需要修改的变量
$wp1="【小天使の神杖】";//装备名字
$wp2="时装位置：武器【小天使の神杖】（2级时装）";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=1200*3;//装备攻击
$wp16=1200*3;//装备魔攻
$wp17=1200*3;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=13;//装备分类


} elseif($npcc ==633){
//需要修改的变量
$wp1="【小天使の神盾】";//装备名字
$wp2="时装位置：副手【小天使の神盾】（2级时装）";//装备描述
//需要修改的变量
$wp14=17000*3;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1700*3;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=14;//装备分类



} elseif($npcc ==634){
//需要修改的变量
$wp1="【小天使の神镜】";//装备名字
$wp2="时装位置：面具【小天使の神镜】（2级时装）";//装备描述
//需要修改的变量
$wp14=1200*3;//装备hp
$wp15=1200*3;//装备攻击
$wp16=1200*3;//装备魔攻
$wp17=1200*3;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=15;//装备分类


} elseif($npcc ==635){
//需要修改的变量
$wp1="【小天使の神服】";//装备名字
$wp2="时装位置：衣服【小天使の神服】（2级时装）";//装备描述
//需要修改的变量
$wp14=12000*3;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=1700*3;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=16;//装备分类



} elseif($npcc ==636){
//需要修改的变量
$wp1="【小天使の神靴】";//装备名字
$wp2="时装位置：鞋子【小天使の神靴】（2级时装）";//装备描述
//需要修改的变量
$wp14=1200*3;//装备hp
$wp15=1200*3;//装备攻击
$wp16=1200*3;//装备魔攻
$wp17=1200*3;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=17;//装备分类



} elseif($npcc ==637){
//需要修改的变量
$wp1="【小天使の神戒】";//装备名字
$wp2="时装位置：戒指【小天使の神戒】（2级时装）";//装备描述
//需要修改的变量
$wp14=7000*3;//装备hp
$wp15=1700*3;//装备攻击
$wp16=1700*3;//装备魔攻
$wp17=1700*3;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=18;//装备分类



} elseif($npcc ==638){
//需要修改的变量
$wp1="【小天使の神链】";//装备名字
$wp2="时装位置：项链【小天使の神链】（2级时装）";//装备描述
//需要修改的变量
$wp14=7000*3;//装备hp
$wp15=1700*3;//装备攻击
$wp16=1700*3;//装备魔攻
$wp17=1700*3;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=19;//装备分类

} elseif($npcc ==639){
//需要修改的变量
$wp1="【小天使の神袍】";//装备名字
$wp2="时装位置：披风【小天使の神袍】（2级时装）";//装备描述
//需要修改的变量
$wp14=7000*3;//装备hp
$wp15=1400*3;//装备攻击
$wp16=1400*3;//装备魔攻
$wp17=1400*3;//装备防御
//需要修改的变量
$wp18=20;//装备冰攻
$wp19=20;//装备火攻
$wp20=20;//装备雷攻
//需要修改的变量
$wp21=20;//装备冰防
$wp22=20;//装备火防
$wp23=20;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=20;//装备分类

} elseif($npcc ==640){
//需要修改的变量
$wp1="【小天使の烈火灼魂】";//装备名字
$wp2="时装位置：勋章【小天使の烈火灼魂】（2级时装）";//装备描述
//需要修改的变量
$wp14=7000*3;//装备hp
$wp15=1700*3;//装备攻击
$wp16=1700*3;//装备魔攻
$wp17=1700*3;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=21;//装备分类

} elseif($npcc ==641){
//需要修改的变量
$wp1="【黑骑士の火翼】";//装备名字
$wp2="时装位置：翅膀【黑骑士の火翼】（3级时装）";//装备描述
//需要修改的变量
$wp14=25000*3;//装备hp
$wp15=1500*3;//装备攻击
$wp16=1500*3;//装备魔攻
$wp17=1500*3;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=12;//装备分类

} elseif($npcc ==642){
//需要修改的变量
$wp1="【黑骑士の火杖】";//装备名字
$wp2="时装位置：武器【黑骑士の火杖】（3级时装）";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=1500*3;//装备攻击
$wp16=1500*3;//装备魔攻
$wp17=1500*3;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=13;//装备分类


} elseif($npcc ==643){
//需要修改的变量
$wp1="【黑骑士の火盾】";//装备名字
$wp2="时装位置：副手【黑骑士の火盾】（3级时装）";//装备描述
//需要修改的变量
$wp14=20000*3;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2000*3;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=14;//装备分类



} elseif($npcc ==644){
//需要修改的变量
$wp1="【黑骑士の火镜】";//装备名字
$wp2="时装位置：面具【黑骑士の火镜】（3级时装）";//装备描述
//需要修改的变量
$wp14=1500*3;//装备hp
$wp15=1500*3;//装备攻击
$wp16=1500*3;//装备魔攻
$wp17=1500*3;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=15;//装备分类


} elseif($npcc ==645){
//需要修改的变量
$wp1="【黑骑士の火服】";//装备名字
$wp2="时装位置：衣服【黑骑士の火服】（3级时装）";//装备描述
//需要修改的变量
$wp14=15000*3;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=2000*3;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=16;//装备分类



} elseif($npcc ==646){
//需要修改的变量
$wp1="【黑骑士の火靴】";//装备名字
$wp2="时装位置：鞋子【黑骑士の火靴】（3级时装）";//装备描述
//需要修改的变量
$wp14=1500*3;//装备hp
$wp15=1500*3;//装备攻击
$wp16=1500*3;//装备魔攻
$wp17=1500*3;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=17;//装备分类



} elseif($npcc ==647){
//需要修改的变量
$wp1="【黑骑士の火戒】";//装备名字
$wp2="时装位置：戒指【黑骑士の火戒】（3级时装）";//装备描述
//需要修改的变量
$wp14=10000*3;//装备hp
$wp15=2000*3;//装备攻击
$wp16=2000*3;//装备魔攻
$wp17=2000*3;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=18;//装备分类



} elseif($npcc ==648){
//需要修改的变量
$wp1="【黑骑士の火链】";//装备名字
$wp2="时装位置：项链【黑骑士の火链】（3级时装）";//装备描述
//需要修改的变量
$wp14=10000*3;//装备hp
$wp15=2000*3;//装备攻击
$wp16=2000*3;//装备魔攻
$wp17=2000*3;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=19;//装备分类

} elseif($npcc ==649){
//需要修改的变量
$wp1="【黑骑士の火袍】";//装备名字
$wp2="时装位置：披风【黑骑士の火袍】（3级时装）";//装备描述
//需要修改的变量
$wp14=10000*3;//装备hp
$wp15=1700*3;//装备攻击
$wp16=1700*3;//装备魔攻
$wp17=1700*3;//装备防御
//需要修改的变量
$wp18=30;//装备冰攻
$wp19=30;//装备火攻
$wp20=30;//装备雷攻
//需要修改的变量
$wp21=30;//装备冰防
$wp22=30;//装备火防
$wp23=30;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=20;//装备分类

} elseif($npcc ==650){
//需要修改的变量
$wp1="【黑骑士の三角勋章】";//装备名字
$wp2="时装位置：勋章【黑骑士の三角勋章】（3级时装）";//装备描述
//需要修改的变量
$wp14=10000*3;//装备hp
$wp15=2000*3;//装备攻击
$wp16=2000*3;//装备魔攻
$wp17=2000*3;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量
$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=21;//装备分类


} elseif($npcc ==651){
//需要修改的变量
$wp1="【猎天使の天灵羽】";//装备名字
$wp2="时装位置：翅膀【猎天使の天灵羽】（4级时装）";//装备描述
//需要修改的变量
$wp14=30000*3;//装备hp
$wp15=4500*3;//装备攻击
$wp16=4500*3;//装备魔攻
$wp17=4500*3;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量
$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=12;//装备分类

} elseif($npcc ==652){
//需要修改的变量
$wp1="【猎天使の天灵镰】";//装备名字
$wp2="时装位置：武器【猎天使の天灵镰】（4级时装）";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=4500*3;//装备攻击
$wp16=4500*3;//装备魔攻
$wp17=4500*3;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量
$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=13;//装备分类


} elseif($npcc ==653){
//需要修改的变量
$wp1="【猎天使の天灵盾】";//装备名字
$wp2="时装位置：副手【猎天使の天灵盾】（4级时装）";//装备描述
//需要修改的变量
$wp14=40000*3;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=5000*3;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量
$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=14;//装备分类



} elseif($npcc ==654){
//需要修改的变量
$wp1="【猎天使の天灵镜】";//装备名字
$wp2="时装位置：面具【猎天使の天灵镜】（4级时装）";//装备描述
//需要修改的变量
$wp14=4500*3;//装备hp
$wp15=4500*3;//装备攻击
$wp16=4500*3;//装备魔攻
$wp17=4500*3;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量
$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=15;//装备分类


} elseif($npcc ==655){
//需要修改的变量
$wp1="【猎天使の天灵服】";//装备名字
$wp2="时装位置：衣服【猎天使の天灵服】（4级时装）";//装备描述
//需要修改的变量
$wp14=35000*3;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=5000*3;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量
$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=16;//装备分类



} elseif($npcc ==656){
//需要修改的变量
$wp1="【猎天使の天灵靴】";//装备名字
$wp2="时装位置：鞋子【猎天使の天灵靴】（4级时装）";//装备描述
//需要修改的变量
$wp14=4500*3;//装备hp
$wp15=4500*3;//装备攻击
$wp16=4500*3;//装备魔攻
$wp17=4500*3;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量
$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=17;//装备分类



} elseif($npcc ==657){
//需要修改的变量
$wp1="【猎天使の天灵戒】";//装备名字
$wp2="时装位置：戒指【猎天使の天灵戒】（4级时装）";//装备描述
//需要修改的变量
$wp14=30000*3;//装备hp
$wp15=5000*3;//装备攻击
$wp16=5000*3;//装备魔攻
$wp17=5000*3;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量
$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=18;//装备分类



} elseif($npcc ==658){
//需要修改的变量
$wp1="【猎天使の天灵链】";//装备名字
$wp2="时装位置：项链【猎天使の天灵链】（4级时装）";//装备描述
//需要修改的变量
$wp14=30000*3;//装备hp
$wp15=5000*3;//装备攻击
$wp16=5000*3;//装备魔攻
$wp17=5000*3;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量
$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=19;//装备分类

} elseif($npcc ==659){
//需要修改的变量
$wp1="【猎天使の天灵袍】";//装备名字
$wp2="时装位置：披风【猎天使の天灵袍】（4级时装）";//装备描述
//需要修改的变量
$wp14=30000*3;//装备hp
$wp15=5700*3;//装备攻击
$wp16=5700*3;//装备魔攻
$wp17=5000*3;//装备防御
//需要修改的变量
$wp18=40;//装备冰攻
$wp19=40;//装备火攻
$wp20=40;//装备雷攻
//需要修改的变量
$wp21=40;//装备冰防
$wp22=40;//装备火防
$wp23=40;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=20;//装备分类

} elseif($npcc ==660){
//需要修改的变量
$wp1="【猎天使の星辰勋章】";//装备名字
$wp2="时装位置：勋章【猎天使の星辰勋章】（4级时装）";//装备描述
//需要修改的变量
$wp14=30000*3;//装备hp
$wp15=5000*3;//装备攻击
$wp16=5000*3;//装备魔攻
$wp17=5000*3;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=21;//装备分类



} elseif($npcc ==661){
//需要修改的变量
$wp1="【死神の星海翼】";//装备名字
$wp2="时装位置：翅膀【死神の星海翼】（5级时装）";//装备描述
//需要修改的变量
$wp14=40000*3;//装备hp
$wp15=9500*3;//装备攻击
$wp16=9500*3;//装备魔攻
$wp17=9500*3;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=12;//装备分类

} elseif($npcc ==662){
//需要修改的变量
$wp1="【死神の星海镰】";//装备名字
$wp2="时装位置：武器【死神の星海镰】（5级时装）";//装备描述
//需要修改的变量
$wp14=0;//装备hp
$wp15=9500*3;//装备攻击
$wp16=9500*3;//装备魔攻
$wp17=9500*3;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=13;//装备分类


} elseif($npcc ==663){
//需要修改的变量
$wp1="【死神の星海盾】";//装备名字
$wp2="时装位置：副手【死神の星海盾】（5级时装）";//装备描述
//需要修改的变量
$wp14=70000*3;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=9000*3;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=14;//装备分类



} elseif($npcc ==664){
//需要修改的变量
$wp1="【死神の星海镜】";//装备名字
$wp2="时装位置：面具【死神の星海镜】（5级时装）";//装备描述
//需要修改的变量
$wp14=9500*3;//装备hp
$wp15=9500*3;//装备攻击
$wp16=9500*3;//装备魔攻
$wp17=9500*3;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=15;//装备分类


} elseif($npcc ==665){
//需要修改的变量
$wp1="【死神の星海服】";//装备名字
$wp2="时装位置：衣服【死神の星海服】";//装备描述
//需要修改的变量
$wp14=55000*3;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=9000*3;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=16;//装备分类



} elseif($npcc ==666){
//需要修改的变量
$wp1="【死神の星海靴】";//装备名字
$wp2="时装位置：鞋子【死神の星海靴】（5级时装）";//装备描述
//需要修改的变量
$wp14=9500*3;//装备hp
$wp15=9500*3;//装备攻击
$wp16=9500*3;//装备魔攻
$wp17=9500*3;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=17;//装备分类



} elseif($npcc ==667){
//需要修改的变量
$wp1="【死神の星海戒】";//装备名字
$wp2="时装位置：戒指【死神の星海戒】（5级时装）";//装备描述
//需要修改的变量
$wp14=50000*3;//装备hp
$wp15=9000*3;//装备攻击
$wp16=9000*3;//装备魔攻
$wp17=9000*3;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=18;//装备分类



} elseif($npcc ==668){
//需要修改的变量
$wp1="【死神の星海链】";//装备名字
$wp2="时装位置：项链【死神の星海链】（5级时装）";//装备描述
//需要修改的变量
$wp14=50000*3;//装备hp
$wp15=9000*3;//装备攻击
$wp16=9000*3;//装备魔攻
$wp17=9000*3;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=19;//装备分类

} elseif($npcc ==669){
//需要修改的变量
$wp1="【死神の星海袍】";//装备名字
$wp2="时装位置：披风【死神の星海袍】（5级时装）";//装备描述
//需要修改的变量
$wp14=50000*3;//装备hp
$wp15=9700*3;//装备攻击
$wp16=9700*3;//装备魔攻
$wp17=9000*3;//装备防御
//需要修改的变量
$wp18=50;//装备冰攻
$wp19=50;//装备火攻
$wp20=50;//装备雷攻
//需要修改的变量
$wp21=50;//装备冰防
$wp22=50;//装备火防
$wp23=50;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=20;//装备分类

} elseif($npcc ==670){
//需要修改的变量
$wp1="【死神の无尽勋章】";//装备名字
$wp2="时装位置：勋章【死神の无尽勋章】（5级时装）";//装备描述
//需要修改的变量
$wp14=40000*3;//装备hp
$wp15=9000*3;//装备攻击
$wp16=9000*3;//装备魔攻
$wp17=9000*3;//装备防御
//需要修改的变量
$wp18=60;//装备冰攻
$wp19=60;//装备火攻
$wp20=60;//装备雷攻
//需要修改的变量
$wp21=60;//装备冰防
$wp22=60;//装备火防
$wp23=60;//装备雷防
//需要修改的变量
$wp24=1;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量
$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派
$wp30=21;//装备分类

} elseif($npcc ==671){
//需要修改的变量

$wp1="【仙尊甲】";//装备名字
$wp2="西游仙级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=20258;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=80;//装备冰防
$wp22=80;//装备火防
$wp23=80;//装备雷防
//需要修改的变量

$wp24=220;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
} elseif($npcc ==672){
//需要修改的变量

$wp1="【仙尊盔】";//装备名字
$wp2="西游仙级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=20584;//装备攻击
$wp16=20584;//装备魔攻
$wp17=20584;//装备防御
//需要修改的变量
$wp18=80;//装备冰攻
$wp19=80;//装备火攻
$wp20=80;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=220;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
} elseif($npcc ==673){
//需要修改的变量

$wp1="【仙尊靴】";//装备名字
$wp2="西游仙级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=20587;//装备攻击
$wp16=20587;//装备魔攻
$wp17=20587;//装备防御
//需要修改的变量
$wp18=80;//装备冰攻
$wp19=80;//装备火攻
$wp20=80;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=220;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



} elseif($npcc ==674){
//需要修改的变量

$wp1="【仙尊链】";//装备名字
$wp2="西游仙级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=20584;//装备攻击
$wp16=20584;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=80;//装备冰攻
$wp19=80;//装备火攻
$wp20=80;//装备雷攻
//需要修改的变量

$wp21=80;//装备冰防
$wp22=80;//装备火防
$wp23=80;//装备雷防
//需要修改的变量

$wp24=220;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==675){
//需要修改的变量

$wp1="【仙尊镯】";//装备名字
$wp2="西游仙级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=20458;//装备攻击
$wp16=20458;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=80;//装备冰攻
$wp19=80;//装备火攻
$wp20=80;//装备雷攻
//需要修改的变量

$wp21=80;//装备冰防
$wp22=80;//装备火防
$wp23=80;//装备雷防
//需要修改的变量

$wp24=220;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



} elseif($npcc ==676){
		
	//需要修改的变量

$wp1="【仙尊枪】";//装备名字
$wp2="西游仙级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=24015;//装备攻击
$wp16=24015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=80;//装备冰攻
$wp19=80;//装备火攻
$wp20=80;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=220;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
} elseif($npcc ==677){
//需要修改的变量

$wp1="【仙尊叉】";//装备名字
$wp2="西游仙级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=24015;//装备攻击
$wp16=24015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=80;//装备冰攻
$wp19=80;//装备火攻
$wp20=80;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=220;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
} elseif($npcc ==678){
//需要修改的变量

$wp1="【仙尊棍】";//装备名字
$wp2="西游仙级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=24015;//装备攻击
$wp16=24015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=80;//装备冰攻
$wp19=80;//装备火攻
$wp20=80;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=220;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==679){
//需要修改的变量
$wp1="【仙尊杖】";//装备名字
$wp2="西游仙级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=24015;//装备攻击
$wp16=24015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=80;//装备冰攻
$wp19=80;//装备火攻
$wp20=80;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=220;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==680){
//需要修改的变量

$wp1="【仙尊剑】";//装备名字
$wp2="西游仙级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=24015;//装备攻击
$wp16=24015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=80;//装备冰攻
$wp19=80;//装备火攻
$wp20=80;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=220;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==681){
//需要修改的变量

$wp1="【神尊甲】";//装备名字
$wp2="西游神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=26258;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=230;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
} elseif($npcc ==682){
//需要修改的变量

$wp1="【神尊盔】";//装备名字
$wp2="西游神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=26584;//装备攻击
$wp16=26584;//装备魔攻
$wp17=26584;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=230;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
} elseif($npcc ==683){
//需要修改的变量

$wp1="【神尊靴】";//装备名字
$wp2="西游神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=26587;//装备攻击
$wp16=26587;//装备魔攻
$wp17=26587;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=230;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



} elseif($npcc ==684){
//需要修改的变量

$wp1="【神尊链】";//装备名字
$wp2="西游神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=26584;//装备攻击
$wp16=26584;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=230;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==685){
//需要修改的变量

$wp1="【神尊镯】";//装备名字
$wp2="西游神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=26458;//装备攻击
$wp16=26458;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=99;//装备冰防
$wp22=99;//装备火防
$wp23=99;//装备雷防
//需要修改的变量

$wp24=230;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



} elseif($npcc ==686){
		
	//需要修改的变量

$wp1="【神尊枪】";//装备名字
$wp2="西游神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=30015;//装备攻击
$wp16=30015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=230;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
} elseif($npcc ==687){
//需要修改的变量

$wp1="【神尊叉】";//装备名字
$wp2="西游神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=30015;//装备攻击
$wp16=30015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=230;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
} elseif($npcc ==688){
//需要修改的变量

$wp1="【神尊棍】";//装备名字
$wp2="西游神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=30015;//装备攻击
$wp16=30015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=230;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==689){
//需要修改的变量
$wp1="【神尊杖】";//装备名字
$wp2="西游神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=30015;//装备攻击
$wp16=30015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=230;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==690){
//需要修改的变量

$wp1="【神尊剑】";//装备名字
$wp2="西游神级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=30015;//装备攻击
$wp16=30015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=99;//装备冰攻
$wp19=99;//装备火攻
$wp20=99;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=230;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==691){
//需要修改的变量

$wp1="【圣尊甲】";//装备名字
$wp2="西游圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=0;//装备攻击
$wp16=0;//装备魔攻
$wp17=33258;//装备防御
//需要修改的变量
$wp18=0;//装备冰攻
$wp19=0;//装备火攻
$wp20=0;//装备雷攻
//需要修改的变量

$wp21=109;//装备冰防
$wp22=109;//装备火防
$wp23=109;//装备雷防
//需要修改的变量

$wp24=240;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=4;//装备分类		
	
} elseif($npcc ==692){
//需要修改的变量

$wp1="【圣尊盔】";//装备名字
$wp2="西游圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=33584;//装备攻击
$wp16=33584;//装备魔攻
$wp17=33584;//装备防御
//需要修改的变量
$wp18=109;//装备冰攻
$wp19=109;//装备火攻
$wp20=109;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=240;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=5;//装备分类				
		
		
} elseif($npcc ==693){
//需要修改的变量

$wp1="【圣尊靴】";//装备名字
$wp2="西游圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=33587;//装备攻击
$wp16=33587;//装备魔攻
$wp17=33587;//装备防御
//需要修改的变量
$wp18=109;//装备冰攻
$wp19=109;//装备火攻
$wp20=109;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=240;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=6;//装备分类		



} elseif($npcc ==694){
//需要修改的变量

$wp1="【圣尊链】";//装备名字
$wp2="西游圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=33584;//装备攻击
$wp16=33584;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=109;//装备冰攻
$wp19=109;//装备火攻
$wp20=109;//装备雷攻
//需要修改的变量

$wp21=109;//装备冰防
$wp22=109;//装备火防
$wp23=109;//装备雷防
//需要修改的变量

$wp24=240;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=7;//装备分类	
		
		
} elseif($npcc ==695){
//需要修改的变量

$wp1="【圣尊镯】";//装备名字
$wp2="西游圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=33458;//装备攻击
$wp16=33458;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=109;//装备冰攻
$wp19=109;//装备火攻
$wp20=109;//装备雷攻
//需要修改的变量

$wp21=109;//装备冰防
$wp22=109;//装备火防
$wp23=109;//装备雷防
//需要修改的变量

$wp24=240;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=6;//装备门派

$wp30=8;//装备分类			
		



} elseif($npcc ==696){
		
	//需要修改的变量

$wp1="【圣尊枪】";//装备名字
$wp2="西游圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=37015;//装备攻击
$wp16=37015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=109;//装备冰攻
$wp19=109;//装备火攻
$wp20=109;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=240;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=1;//装备门派

$wp30=3;//装备分类	



	
} elseif($npcc ==697){
//需要修改的变量

$wp1="【圣尊叉】";//装备名字
$wp2="西游圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=37015;//装备攻击
$wp16=37015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=109;//装备冰攻
$wp19=109;//装备火攻
$wp20=109;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=240;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=2;//装备门派

$wp30=3;//装备分类	
		
} elseif($npcc ==698){
//需要修改的变量

$wp1="【圣尊棍】";//装备名字
$wp2="西游圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=37015;//装备攻击
$wp16=37015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=109;//装备冰攻
$wp19=109;//装备火攻
$wp20=109;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=240;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=4;//装备门派

$wp30=3;//装备分类	

} elseif($npcc ==699){
//需要修改的变量
$wp1="【圣尊杖】";//装备名字
$wp2="西游圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=37015;//装备攻击
$wp16=37015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=109;//装备冰攻
$wp19=109;//装备火攻
$wp20=109;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=240;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=5;//装备门派

$wp30=3;//装备分类		
		

		
} elseif($npcc ==700){
//需要修改的变量

$wp1="【圣尊剑】";//装备名字
$wp2="西游圣级装备";//装备描述
//需要修改的变量

$wp14=0;//装备hp
$wp15=37015;//装备攻击
$wp16=37015;//装备魔攻
$wp17=0;//装备防御
//需要修改的变量
$wp18=109;//装备冰攻
$wp19=109;//装备火攻
$wp20=109;//装备雷攻
//需要修改的变量

$wp21=0;//装备冰防
$wp22=0;//装备火防
$wp23=0;//装备雷防
//需要修改的变量

$wp24=240;//装备等级
$wp25=10;//装备重量
$wp26=0;//装备绑定
//需要修改的变量

$wp27=1000;//装备价格
$wp28=0;//装备佩戴
$wp29=3;//装备门派

$wp30=3;//装备分类	


} else{

echo "<font color=black>没有这个装备id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}

?>




