<?php









$xlxq=($xldj+1)*($xldj+1)*($xldj+1)*($xldj+2)+200;	
if($xldj >=1&&$xldj <=20){
$xl02="（炼气）";
$xl03=$xldj."层";

$xl04=$xldj;
$xl06=4000+$xl04*1000;
$xl05="西游声望".$xl06;
$xl08=0;
$xl09=1000;
} elseif($xldj >=21&&$xldj <=40){
$xl02="（筑基）";
$xl04=$xldj-20;
$xl03=$xl04."层";
$xl06=5000+$xl04*2000;
$xl05="西游声望".$xl06;
$xl08=0;
$xl09=50000;
} elseif($xldj >=41&&$xldj <=60){
$xl02="（开光）";
$xl04=$xldj-40;
$xl03=$xl04."层";
$xl06=10000+$xl04*3000;
$xl05="西游声望".$xl06;
$xl08=0;
$xl09=1000000;
} elseif($xldj >=61&&$xldj <=80){
$xl02="（金丹）";
$xl04=$xldj-60;
$xl03=$xl04."层";
$xl06=20000+$xl04*4000;
$xl05="西游声望".$xl06;
$xl08=0;
$xl09=2000000;
} elseif($xldj >=81&&$xldj <=100){
$xl02="（元婴）";
$xl04=$xldj-80;
$xl03=$xl04."层";
$xl06=30000+$xl04*5000;
$xl05="西游声望".$xl06;
$xl08=0;
$xl09=5000000;
} elseif($xldj >=101&&$xldj <=120){
$xl02="（出窍）";
$xl04=$xldj-100;
$xl03=$xl04."层";
$xl06=40000+$xl04*6000;
$xl05="西游声望".$xl06;

$xl08=1+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=10000000;
} elseif($xldj >=121&&$xldj <=140){
$xl02="（合体）";
$xl04=$xldj-120;
$xl03=$xl04."层";
$xl06=50000+$xl04*7000;
$xl05="西游声望".$xl06;
$xl08=5+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=20000000;
} elseif($xldj >=141&&$xldj <=160){
$xl02="（渡劫）";
$xl04=$xldj-140;
$xl03=$xl04."层";
$xl06=60000+$xl04*8000;
$xl05="西游声望".$xl06;
$xl08=10+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=50000000;
} elseif($xldj >=161&&$xldj <=180){
$xl02="（寂灭）";
$xl04=$xldj-160;
$xl03=$xl04."层";
$xl06=70000+$xl04*9000;
$xl05="西游声望".$xl06;
$xl08=15+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=100000000;
} elseif($xldj >=181&&$xldj <=200){
$xl02="（大乘）";
$xl04=$xldj-180;
$xl03=$xl04."层";
$xl06=100000+$xl04*10000;
$xl05="西游声望".$xl06;
$xl08=30+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=200000000;

} elseif($xldj >=201&&$xldj <=220){
$xl02="（仙人）";
$xl04=$xldj-200;
$xl03=$xl04."层";
$xl06=100000+$xl04*10000;
$xl05="西游声望".$xl06;
$xl08=30+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=400000000;

} elseif($xldj >=221&&$xldj <=240){
$xl02="（散仙）";
$xl04=$xldj-220;
$xl03=$xl04."层";
$xl06=120000+$xl04*12000;
$xl05="西游声望".$xl06;
$xl08=40+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=600000000;

} elseif($xldj >=241&&$xldj <=260){
$xl02="（上仙）";
$xl04=$xldj-240;
$xl03=$xl04."层";
$xl06=140000+$xl04*14000;
$xl05="西游声望".$xl06;
$xl08=50+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=800000000;

} elseif($xldj >=261&&$xldj <=280){
$xl02="（地仙）";
$xl04=$xldj-260;
$xl03=$xl04."层";
$xl06=160000+$xl04*16000;
$xl05="西游声望".$xl06;
$xl08=60+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=1000000000;


} elseif($xldj >=281&&$xldj <=300){
$xl02="（天仙）";
$xl04=$xldj-280;
$xl03=$xl04."层";
$xl06=180000+$xl04*18000;
$xl05="西游声望".$xl06;
$xl08=70+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=1200000000;

} elseif($xldj >=301&&$xldj <=320){
$xl02="（金仙）";
$xl04=$xldj-300;
$xl03=$xl04."层";
$xl06=200000+$xl04*20000;
$xl05="西游声望".$xl06;
$xl08=80+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=1400000000;

} elseif($xldj >=321&&$xldj <=340){
$xl02="（玄仙）";
$xl04=$xldj-320;
$xl03=$xl04."层";
$xl06=220000+$xl04*22000;
$xl05="西游声望".$xl06;
$xl08=90+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=1600000000;


} elseif($xldj >=341&&$xldj <=360){
$xl02="（初神）";
$xl04=$xldj-340;
$xl03=$xl04."层";
$xl06=240000+$xl04*24000;
$xl05="西游声望".$xl06;
$xl08=100+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=1800000000;


} elseif($xldj >=361&&$xldj <=380){
$xl02="（偏神）";
$xl04=$xldj-360;
$xl03=$xl04."层";
$xl06=260000+$xl04*26000;
$xl05="西游声望".$xl06;
$xl08=110+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=2000000000;

} elseif($xldj >=381&&$xldj <=400){
$xl02="（神人）";
$xl04=$xldj-380;
$xl03=$xl04."层";
$xl06=280000+$xl04*28000;
$xl05="西游声望".$xl06;
$xl08=120+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=2200000000;

} elseif($xldj >=401&&$xldj <=420){
$xl02="（准神）";
$xl04=$xldj-400;
$xl03=$xl04."层";
$xl06=300000+$xl04*30000;
$xl05="西游声望".$xl06;
$xl08=110+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=2400000000;




} elseif($xldj >=421&&$xldj <=440){
$xl02="（神使）";
$xl04=$xldj-420;
$xl03=$xl04."层";
$xl06=320000+$xl04*32000;
$xl05="西游声望".$xl06;
$xl08=120+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=2600000000;

} elseif($xldj >=441&&$xldj <=460){
$xl02="（神将）";
$xl04=$xldj-440;
$xl03=$xl04."层";
$xl06=340000+$xl04*34000;
$xl05="西游声望".$xl06;
$xl08=130+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=2800000000;

} elseif($xldj >=461&&$xldj <=480){
$xl02="（上神）";
$xl04=$xldj-460;
$xl03=$xl04."层";
$xl06=360000+$xl04*36000;
$xl05="西游声望".$xl06;
$xl08=140+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=3000000000;

} elseif($xldj >=481&&$xldj <=500){
$xl02="（天神）";
$xl04=$xldj-480;
$xl03=$xl04."层";
$xl06=380000+$xl04*38000;
$xl05="西游声望".$xl06;
$xl08=150+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=3200000000;

} elseif($xldj >=501&&$xldj <=520){
$xl02="（神王）";
$xl04=$xldj-500;
$xl03=$xl04."层";
$xl06=400000+$xl04*40000;
$xl05="西游声望".$xl06;
$xl08=160+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=3400000000;

} elseif($xldj >=521&&$xldj <=540){
$xl02="（天尊）";
$xl04=$xldj-520;
$xl03=$xl04."层";
$xl06=500000+$xl04*50000;
$xl05="西游声望".$xl06;
$xl08=200+$xl04*1;
$xl07="〖金豆〗x".$xl08;
$xl09=4000000000;
} elseif($xldj ==541){
$xl02="（天尊）（封顶）";
} else{

	
$xlpd=2;
	
	
} 



if($xlfl ==1){
$xl01="【人物修炼（血）】";	
} elseif($xlfl ==2){
$xl01="【人物修炼（攻）】";	
} elseif($xlfl ==3){
$xl01="【人物修炼（魔）】";		
} elseif($xlfl ==4){	
$xl01="【人物修炼（防）】";	
} else{
} 

if($xlpd !=2){


$ms1=$xl01.$xl02.$xl03;


//数字转汉字
$yl=$xl09;
include("./pz/ylts.php");
$xl09ms=$ylxx;

//数字转汉字
$yl=$xlxq;
include("./pz/ylts.php");
$xlxqms=$ylxx;
$ms2=$xlxqms."修炼经验，".$xl09ms."银两，".$xl05.$xl07;
} else{
$ms1=$xl01."（天尊）20层";
$ms2="已达到至高无上的境界了";
	
	
} 












































?>




