<?php

if($wpidd ==1){
$ms1="〖仙魂枪〗";
$ms2="红宝石一x5,黄宝石一x5,蓝宝石一x5,银两100万";

} elseif($wpidd ==2){
$ms1="【白虎枪】";
$ms2="红宝石二x5,黄宝石二x5,蓝宝石二x5,银两200万";
} elseif($wpidd ==3){
$ms1="【白虎笑傲枪】";
$ms2="红宝石三x5,黄宝石三x5,蓝宝石三x5,宝象国声望15000,银两500万";
$ms3=4;
} elseif($wpidd ==4){
$ms1="【玄武枪】";
$ms2="红宝石三x5,黄宝石三x5,蓝宝石三x5,【金精】x5,【金犀角】x1,宝象国声望15000,银两500万";
$ms3=5;
} elseif($wpidd ==5){
$ms1="【玄武撼地枪】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=6;
} elseif($wpidd ==6){
$ms1="【朱雀枪】";
$ms2="红宝石四x5,黄宝石四x5,蓝宝石四x5,玄武石四x5,天宫声望120000,宝象国声望120000,乌鸡国声望120000,银两1500万";
$ms3=7;
} elseif($wpidd ==8){
$ms1="【应龙戟】（60）";
$ms2="〖金豆〗x5,将军府声望50000,银两1500万";
$ms3=9;
} elseif($wpidd ==9){
$ms1="【应龙戟】（80）";
$ms2="〖金豆〗x15,将军府声望70000,银两2000万";
$ms3=10;
} elseif($wpidd ==10){
$ms1="【应龙戟】（89）";
$ms2="〖金豆〗x40,将军府声望120000,银两5000万";
$ms3=11;
} elseif($wpidd ==11){
$ms1="【应龙戟】（99）";
$ms2="〖金豆〗x55,将军府声望200000,银两2亿5000万";
$ms3=16;



} elseif($wpidd ==15){

$ms1="〖仙魂叉〗";
$ms2="红宝石一x5,黄宝石一x5,蓝宝石一x5,银两100万";
} elseif($wpidd ==16){
$ms1="【龙鳞叉】";
$ms2="红宝石二x5,黄宝石二x5,蓝宝石二x5,银两200万";
} elseif($wpidd ==17){
$ms1="【龙鳞破天叉】";
$ms2="红宝石三x5,黄宝石三x5,蓝宝石三x5,宝象国声望15000,银两500万";
$ms3=18;
} elseif($wpidd ==18){
$ms1="【青龙叉】";
$ms2="红宝石三x5,黄宝石三x5,蓝宝石三x5,【金精】x5,【金犀角】x1,宝象国声望15000,银两500万";
$ms3=19;
} elseif($wpidd ==19){
$ms1="【青龙在天叉】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=6;
} elseif($wpidd ==20){
$ms1="【天龙叉】";
$ms2="红宝石四x5,黄宝石四x5,蓝宝石四x5,玄武石四x5,天宫声望120000,宝象国声望120000,乌鸡国声望120000,银两1500万";
$ms3=21;
} elseif($wpidd ==22){
$ms1="【五龙叉】（60）";
$ms2="〖金豆〗x5,龙宫声望50000,银两1500万";
$ms3=23;
} elseif($wpidd ==23){
$ms1="【五龙叉】（80）";
$ms2="〖金豆〗x15,龙宫声望70000,银两2000万";
$ms3=24;
} elseif($wpidd ==24){
$ms1="【五龙叉】（89）";
$ms2="〖金豆〗x40,龙宫声望120000,银两5000万";
$ms3=25;

} elseif($wpidd ==25){
$ms1="【五龙叉】（99）";
$ms2="〖金豆〗x55,龙宫声望200000,银两2亿5000万";
$ms3=26;



//////////////////


} elseif($wpidd ==29){

$ms1="〖仙魂棍〗";
$ms2="红宝石一x5,黄宝石一x5,蓝宝石一x5,银两100万";
} elseif($wpidd ==30){
$ms1="【七星棍】";
$ms2="红宝石二x5,黄宝石二x5,蓝宝石二x5,银两200万";
} elseif($wpidd ==31){
$ms1="【七星逐月棍】";
$ms2="红宝石三x5,黄宝石三x5,蓝宝石三x5,宝象国声望15000,银两500万";
$ms3=32;
} elseif($wpidd ==32){
$ms1="【无极棍】";
$ms2="红宝石三x5,黄宝石三x5,蓝宝石三x5,【金精】x5,【金犀角】x1,宝象国声望15000,银两500万";
$ms3=33;
} elseif($wpidd ==33){
$ms1="【无极无道棍】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=34;
} elseif($wpidd ==34){
$ms1="【太乙棍】";
$ms2="红宝石四x5,黄宝石四x5,蓝宝石四x5,玄武石四x5,天宫声望120000,宝象国声望120000,乌鸡国声望120000,银两1500万";
$ms3=35;
} elseif($wpidd ==36){
$ms1="【夸父棍】（60）";
$ms2="〖金豆〗x5,方寸山声望50000,银两1500万";
$ms3=37;
} elseif($wpidd ==37){
$ms1="【夸父棍】（80）";
$ms2="〖金豆〗x15,方寸山声望70000,银两2000万";
$ms3=38;
} elseif($wpidd ==38){
$ms1="【夸父棍】（89）";
$ms2="〖金豆〗x40,方寸山声望120000,银两5000万";
$ms3=39;
} elseif($wpidd ==39){
$ms1="【夸父棍】（99）";
$ms2="〖金豆〗x55,方寸山声望200000,银两2亿5000万";
$ms3=40;

///////////////////////
} elseif($wpidd ==43){

$ms1="〖仙魂杖〗";
$ms2="红宝石一x5,黄宝石一x5,蓝宝石一x5,银两100万";
} elseif($wpidd ==44){
$ms1="【伏虎杖】";
$ms2="红宝石二x5,黄宝石二x5,蓝宝石二x5,银两200万";
} elseif($wpidd ==45){
$ms1="【伏虎降龙杖】";
$ms2="红宝石三x5,黄宝石三x5,蓝宝石三x5,宝象国声望15000,银两500万";
$ms3=46;
} elseif($wpidd ==46){
$ms1="【金刚杖】";
$ms2="红宝石三x5,黄宝石三x5,蓝宝石三x5,【金精】x5,【金犀角】x1,宝象国声望15000,银两500万";
$ms3=47;
} elseif($wpidd ==47){
$ms1="【怒目金刚杖】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=48;
} elseif($wpidd ==48){
$ms1="【罗汉杖】";
$ms2="红宝石四x5,黄宝石四x5,蓝宝石四x5,玄武石四x5,天宫声望120000,宝象国声望120000,乌鸡国声望120000,银两1500万";
$ms3=49;
} elseif($wpidd ==50){
$ms1="【般若杖】（60）";
$ms2="〖金豆〗x5,普陀山声望50000,银两1500万";
$ms3=51;
} elseif($wpidd ==51){
$ms1="【般若杖】（80）";
$ms2="〖金豆〗x15,普陀山声望70000,银两2000万";
$ms3=52;
} elseif($wpidd ==52){
$ms1="【般若杖】（89）";
$ms2="〖金豆〗x40,普陀山声望120000,银两5000万";
$ms3=53;
} elseif($wpidd ==53){
$ms1="【般若杖】（99）";
$ms2="〖金豆〗x55,普陀山声望200000,银两2亿5000万";
$ms3=54;






///////////////////////
} elseif($wpidd ==57){

$ms1="〖仙魂剑〗";
$ms2="红宝石一x5,黄宝石一x5,蓝宝石一x5,银两100万";
} elseif($wpidd ==58){
$ms1="【碧海剑】";
$ms2="红宝石二x5,黄宝石二x5,蓝宝石二x5,银两200万";
} elseif($wpidd ==59){
$ms1="【碧海青天剑】";
$ms2="红宝石三x5,黄宝石三x5,蓝宝石三x5,宝象国声望15000,银两500万";
$ms3=60;
} elseif($wpidd ==60){
$ms1="【银沙剑】";
$ms2="红宝石三x5,黄宝石三x5,蓝宝石三x5,【金精】x5,【金犀角】x1,宝象国声望15000,银两500万";
$ms3=61;
} elseif($wpidd ==61){
$ms1="【银沙瀚海剑】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=62;
} elseif($wpidd ==62){
$ms1="【奔月剑】";
$ms2="红宝石四x5,黄宝石四x5,蓝宝石四x5,玄武石四x5,天宫声望120000,宝象国声望120000,乌鸡国声望120000,银两1500万";
$ms3=63;
} elseif($wpidd ==64){
$ms1="【碧落剑】（60）";
$ms2="〖金豆〗x5,月宫声望50000,银两1500万";
$ms3=65;
} elseif($wpidd ==65){
$ms1="【碧落剑】（80）";
$ms2="〖金豆〗x15,月宫声望70000,银两2000万";
$ms3=66;
} elseif($wpidd ==66){
$ms1="【碧落剑】（89）";
$ms2="〖金豆〗x40,月宫声望120000,银两5000万";
$ms3=67;
} elseif($wpidd ==67){
$ms1="【碧落剑】（99）";
$ms2="〖金豆〗x55,月宫声望200000,银两2亿5000万";
$ms3=68;



//仙魂

} elseif($wpidd ==102){
$ms1="〖仙魂头盔〗";
$ms2="红水晶二x5,黄水晶二x5,蓝水晶二x5,佛印石二x5,银两200万";


} elseif($wpidd ==71){
$ms1="〖仙魂战甲〗";
$ms2="红水晶二x5,黄水晶二x5,蓝水晶二x5,金刚石二x5,银两200万";

} elseif($wpidd ==134){
$ms1="〖仙魂战靴〗";
$ms2="红水晶二x5,黄水晶二x5,蓝水晶二x5,佛印石二x5,银两200万";

} elseif($wpidd ==166){
$ms1="〖仙魂之怒〗";
$ms2="红宝石二x5,黄宝石二x5,蓝宝石二x5,玄宝石二x5,银两200万";

} elseif($wpidd ==197){
$ms1="〖仙魂守护〗";
$ms2="红宝石二x5,黄宝石二x5,蓝宝石二x5,玄宝石二x5,银两200万";

//将军府衣服



} elseif($wpidd ==73){
$ms1="【白虎笑傲铠】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,金刚石三x5,宝象国声望15000,银两300万";
$ms3=78;
} elseif($wpidd ==78){
$ms1="【玄武铠甲】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,金刚石三x10,【火红毛皮】x2,【玉片衣】x2,银两500万";
$ms3=83;
} elseif($wpidd ==83){
$ms1="【玄武撼地甲】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,金刚石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=88;
} elseif($wpidd ==88){
$ms1="【朱雀战甲】";
$ms2="红水晶四20,黄水晶四x20,蓝水晶四x20,金刚石四x20,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=93;


//龙宫衣服





} elseif($wpidd ==75){
$ms1="【龙鳞破天铠】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,金刚石三x5,宝象国声望15000,银两300万";
$ms3=80;
} elseif($wpidd ==80){
$ms1="【青龙铠甲】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,金刚石三x10,【火红毛皮】x2,【玉片衣】x2,银两500万";
$ms3=85;
} elseif($wpidd ==85){
$ms1="【青龙在天甲】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,金刚石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=90;
} elseif($wpidd ==90){
$ms1="【天龙战甲】";
$ms2="红水晶四x20,黄水晶四x10,蓝水晶四x10,金刚石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=95;

//方寸山衣服


} elseif($wpidd ==74){
$ms1="【七星逐月铠】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,金刚石三x5,宝象国声望15000,银两300万";
$ms3=79;
} elseif($wpidd ==79){
$ms1="【无极铠甲】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,金刚石三x10,【火红毛皮】x2,【玉片衣】x2,银两500万";

$ms3=84;
} elseif($wpidd ==84){
$ms1="【无极无道甲】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,金刚石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=89;
} elseif($wpidd ==89){
$ms1="【太乙战甲】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,金刚石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=94;


//普陀山衣服


} elseif($wpidd ==76){
$ms1="【伏虎降龙铠】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,金刚石三x5,宝象国声望15000,银两300万";
$ms3=81;
} elseif($wpidd ==81){
$ms1="【金刚铠甲】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,金刚石三x10,【火红毛皮】x2,【玉片衣】x2,银两500万";
$ms3=86;

} elseif($wpidd ==86){
$ms1="【怒目金刚甲】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,金刚石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=91;
} elseif($wpidd ==91){
$ms1="【罗汉战甲】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,金刚石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=96;


//月宫衣服


} elseif($wpidd ==77){
$ms1="【碧海青天铠】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,金刚石三x5,宝象国声望15000,银两300万";
$ms3=82;
} elseif($wpidd ==82){
$ms1="【银沙铠甲】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,金刚石三x10,【火红毛皮】x2,【玉片衣】x2,银两500万";
$ms3=87;

} elseif($wpidd ==87){
$ms1="【银沙瀚海甲】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,金刚石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=92;
} elseif($wpidd ==92){
$ms1="【奔月战甲】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,金刚石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=97;




//将军府头盔



} elseif($wpidd ==104){
$ms1="【白虎笑傲盔】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,佛印石三x5,宝象国声望15000,银两300万";
$ms3=109;
} elseif($wpidd ==109){
$ms1="【玄武头盔】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,佛印石三x10,【骷髅头】x2,【银犀角】x2,银两500万";
$ms3=114;

} elseif($wpidd ==114){
$ms1="【玄武撼地盔】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,佛印石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=119;
} elseif($wpidd ==119){
$ms1="【朱雀头盔】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,佛印石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=124;


//方寸山头盔


} elseif($wpidd ==105){
$ms1="【七星逐月盔】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,佛印石三x5,宝象国声望15000,银两300万";
$ms3=110;
} elseif($wpidd ==110){
$ms1="【无极头盔】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,佛印石三x10,【骷髅头】x2,【银犀角】x2,银两500万";
$ms3=115;

} elseif($wpidd ==115){
$ms1="【无极无道盔】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,佛印石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=120;
} elseif($wpidd ==120){
$ms1="【太乙头盔】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,佛印石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=125;


//龙宫头盔





} elseif($wpidd ==106){
$ms1="【龙鳞破天盔】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,佛印石三x5,宝象国声望15000,银两300万";
$ms3=111;
} elseif($wpidd ==111){
$ms1="【青龙头盔】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,佛印石三x10,【骷髅头】x2,【银犀角】x2,银两500万";
$ms3=116;

} elseif($wpidd ==116){
$ms1="【青龙在天盔】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,佛印石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=121;
} elseif($wpidd ==121){
$ms1="【天龙头盔】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,佛印石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=126;



//普陀山头盔


} elseif($wpidd ==107){
$ms1="【伏虎降龙盔】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,佛印石三x5,宝象国声望15000,银两300万";
$ms3=112;
} elseif($wpidd ==112){
$ms1="【金刚头盔】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,佛印石三x10,【骷髅头】x2,【银犀角】x2,银两500万";
$ms3=117;

} elseif($wpidd ==117){
$ms1="【怒目金刚盔】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,佛印石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=122;
} elseif($wpidd ==122){
$ms1="【罗汉头盔】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,佛印石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=127;


//月宫头盔


} elseif($wpidd ==108){
$ms1="【碧海青天盔】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,佛印石三x5,宝象国声望15000,银两300万";
$ms3=113;
} elseif($wpidd ==113){
$ms1="【银沙头盔】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,佛印石三x10,【骷髅头】x2,【银犀角】x2,银两500万";
$ms3=118;

} elseif($wpidd ==118){
$ms1="【银沙瀚海盔】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,佛印石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=123;
} elseif($wpidd ==123){
$ms1="【奔月头盔】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,佛印石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=128;



//将军府鞋子



} elseif($wpidd ==136){
$ms1="【白虎笑傲靴】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=141;
} elseif($wpidd ==141){
$ms1="【玄武战靴】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【淡黄狐尾】x2,【猩红石】x2,银两500万";
$ms3=146;

} elseif($wpidd ==146){
$ms1="【玄武撼地靴】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=151;
} elseif($wpidd ==151){
$ms1="【朱雀战靴】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=156;


//方寸山鞋子


} elseif($wpidd ==137){
$ms1="【七星逐月靴】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=142;
} elseif($wpidd ==142){
$ms1="【无极战靴】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【淡黄狐尾】x2,【猩红石】x2,银两500万";
$ms3=147;

} elseif($wpidd ==147){
$ms1="【无极无道靴】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=152;
} elseif($wpidd ==152){
$ms1="【太乙战靴】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=157;


//龙宫靴子





} elseif($wpidd ==138){
$ms1="【龙鳞破天靴】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=143;
} elseif($wpidd ==143){
$ms1="【青龙战靴】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【淡黄狐尾】x2,【猩红石】x2,银两500万";
$ms3=148;

} elseif($wpidd ==148){
$ms1="【青龙在天靴】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=153;
} elseif($wpidd ==153){
$ms1="【天龙战靴】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=158;



//普陀山靴子


} elseif($wpidd ==139){
$ms1="【伏虎降龙靴】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=144;
} elseif($wpidd ==144){
$ms1="【金刚战靴】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【淡黄狐尾】x2,【猩红石】x2,银两500万";
$ms3=149;

} elseif($wpidd ==149){
$ms1="【怒目金刚靴】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=154;
} elseif($wpidd ==154){
$ms1="【罗汉战靴】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=159;


//月宫靴子


} elseif($wpidd ==140){
$ms1="【碧海青天靴】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=145;
} elseif($wpidd ==145){
$ms1="【银沙战靴】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【淡黄狐尾】x2,【猩红石】x2,银两500万";
$ms3=150;

} elseif($wpidd ==150){
$ms1="【银沙瀚海靴】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=155;
} elseif($wpidd ==155){
$ms1="【奔月战靴】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=160;




//将军府项链



} elseif($wpidd ==168){
$ms1="【白虎笑傲项链】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=173;
} elseif($wpidd ==173){
$ms1="【玄武项链】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【拔地鼠筋】x2,【天香碧玉竹】x2,银两500万";
$ms3=178;

} elseif($wpidd ==178){
$ms1="【玄武撼项链】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=183;
} elseif($wpidd ==183){
$ms1="【朱雀项链】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=188;


//方寸山项链


} elseif($wpidd ==169){
$ms1="【七星逐月项链】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=174;
} elseif($wpidd ==174){
$ms1="【无极项链】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【拔地鼠筋】x2,【天香碧玉竹】x2,银两500万";
$ms3=179;

} elseif($wpidd ==179){
$ms1="【无极无道项链】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=184;
} elseif($wpidd ==184){
$ms1="【太乙项链】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=189;


//龙宫项链





} elseif($wpidd ==170){
$ms1="【龙鳞破天项链】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=175;
} elseif($wpidd ==175){
$ms1="【青龙项链】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【拔地鼠筋】x2,【天香碧玉竹】x2,银两500万";
$ms3=180;

} elseif($wpidd ==180){
$ms1="【青龙在天项链】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=185;
} elseif($wpidd ==185){
$ms1="【天龙项链】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=190;



//普陀山项链


} elseif($wpidd ==171){
$ms1="【伏虎降龙项链】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=176;
} elseif($wpidd ==176){
$ms1="【金刚项链】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【拔地鼠筋】x2,【天香碧玉竹】x2,银两500万";
$ms3=181;

} elseif($wpidd ==181){
$ms1="【怒目金刚项链】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=186;
} elseif($wpidd ==186){
$ms1="【罗汉项链】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=191;


//月宫项链


} elseif($wpidd ==172){
$ms1="【碧海青天项链】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=177;
} elseif($wpidd ==177){
$ms1="【银沙项链】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【拔地鼠筋】x2,【天香碧玉竹】x2,银两500万";
$ms3=182;

} elseif($wpidd ==182){
$ms1="【银沙瀚海项链】";
$ms2="红水晶三x15,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=187;
} elseif($wpidd ==187){
$ms1="【奔月项链】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=192;





//将军府手镯



} elseif($wpidd ==199){
$ms1="【白虎笑傲手镯】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=204;
} elseif($wpidd ==204){
$ms1="【玄武手镯】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【玄铁手镯】x2,【黑晶】x2,银两500万";
$ms3=209;

} elseif($wpidd ==209){
$ms1="【玄武撼手镯】";
$ms2="红水晶三x10,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=214;
} elseif($wpidd ==214){
$ms1="【朱雀手镯】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=219;


//方寸山手镯


} elseif($wpidd ==200){
$ms1="【七星逐月手镯】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=205;
} elseif($wpidd ==205){
$ms1="【无极手镯】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【玄铁手镯】x2,【黑晶】x2,银两500万";
$ms3=210;

} elseif($wpidd ==210){
$ms1="【无极无道手镯】";
$ms2="红水晶三x10,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=215;
} elseif($wpidd ==215){
$ms1="【太乙手镯】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=220;


//龙宫手镯





} elseif($wpidd ==201){
$ms1="【龙鳞破天手镯】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=206;
} elseif($wpidd ==206){
$ms1="【青龙手镯】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【玄铁手镯】x2,【黑晶】x2,银两500万";
$ms3=211;

} elseif($wpidd ==211){
$ms1="【青龙在天手镯】";
$ms2="红水晶三x10,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=216;
} elseif($wpidd ==216){
$ms1="【天龙手镯】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=221;



//普陀山手镯


} elseif($wpidd ==202){
$ms1="【伏虎降龙手镯】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=207;
} elseif($wpidd ==207){
$ms1="【金刚手镯】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【玄铁手镯】x2,【黑晶】x2,银两500万";
$ms3=212;

} elseif($wpidd ==212){
$ms1="【怒目金刚手镯】";
$ms2="红水晶三x10,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=217;
} elseif($wpidd ==217){
$ms1="【罗汉手镯】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=222;


//月宫手镯


} elseif($wpidd ==203){
$ms1="【碧海青天手镯】";
$ms2="红水晶三x5,黄水晶三x5,蓝水晶三x5,玄武石三x5,宝象国声望15000,银两300万";
$ms3=208;
} elseif($wpidd ==208){
$ms1="【银沙手镯】";
$ms2="红水晶三x10,黄水晶三x10,蓝水晶三x10,玄武石三x10,【玄铁手镯】x2,【黑晶】x2,银两500万";
$ms3=213;

} elseif($wpidd ==213){
$ms1="【银沙瀚海手镯】";
$ms2="红水晶三x10,黄水晶三x15,蓝水晶三x15,玄武石三x15,【烈焰火羽】x3,【冰凌石】x3,乌鸡国声望15000,银两500万";
$ms3=218;
} elseif($wpidd ==218){
$ms1="【奔月手镯】";
$ms2="红水晶四x10,黄水晶四x10,蓝水晶四x10,玄武石四x10,【紫金】x5,【冰凌石】x5,【逆鳞】x5,天宫声望60000,乌鸡国声望60000,宝象国声望60000,银两1500万";
$ms3=223;

//小巨


} elseif($wpidd ==98){
$ms1="【刑天铁甲】";
$ms2="红水晶五x10,黄水晶五x10,蓝水晶五x10,金刚石五x10,天宫声望20000,乌鸡国声望20000,宝象国声望20000,银两2000万";
$ms3=236;
} elseif($wpidd ==129){
$ms1="【旱魃鬼面】";
$ms2="红水晶五x10,黄水晶五x10,蓝水晶五x10,佛印石五x10,天宫声望20000,乌鸡国声望20000,宝象国声望20000,银两2000万";
$ms3=130;
} elseif($wpidd ==161){
$ms1="【神皇之靴】";
$ms2="红水晶五x10,黄水晶五x10,蓝水晶五x10,玄武石五x10,天宫声望20000,乌鸡国声望20000,宝象国声望20000,银两2000万";
$ms3=162;
} elseif($wpidd ==235){
$ms1="【共工护符】";
$ms2="红宝石五x10,黄宝石五x10,蓝宝石五x10,金刚石五x10,天宫声望20000,乌鸡国声望20000,宝象国声望20000,银两2000万";
$ms3=193;
} elseif($wpidd ==224){
$ms1="【祝融戒指】";
$ms2="红宝石五x10,黄宝石五x10,蓝宝石五x10,佛印石五x10,天宫声望20000,乌鸡国声望20000,宝象国声望20000,银两2000万";
$ms3=237;

//大巨


} elseif($wpidd ==236){
$ms1="【巨灵宝甲】";
$ms2="红水晶五x50,黄水晶五x50,蓝水晶五x50,金刚石五x50,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两5000万";
$ms3=99;
} elseif($wpidd ==130){
$ms1="【巨灵头盔】";
$ms2="红水晶五x50,黄水晶五x50,蓝水晶五x50,佛印石五x50,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两5000万";
$ms3=131;
} elseif($wpidd ==162){
$ms1="【巨灵战靴】";
$ms2="红水晶五x50,黄水晶五x50,蓝水晶五x50,玄武石五x50,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两5000万";
$ms3=163;
} elseif($wpidd ==193){
$ms1="【巨灵项链】";
$ms2="红宝石五x50,黄宝石五x50,蓝宝石五x50,金刚石五x50,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两5000万";
$ms3=194;
} elseif($wpidd ==237){
$ms1="【巨灵手镯】";
$ms2="红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两5000万";
$ms3=232;
//法宝


} elseif($wpidd ==238){
$ms1="【阐气瓶】（2级）";
$ms2="法宝经验2万,修炼经验20万,银两500万";
$ms3=239;
} elseif($wpidd ==239){
$ms1="【阐气瓶】（3级）";
$ms2="法宝经验5万,修炼经验50万,银两700万";
$ms3=240;
} elseif($wpidd ==240){
$ms1="【阐气瓶】（4级）";
$ms2="法宝经验8万,修炼经验90万,银两900万";
$ms3=241;
} elseif($wpidd ==241){
$ms1="【阐气瓶】（5级）";
$ms2="法宝经验10万,修炼经验150万,银两1300万";
$ms3=242;


} elseif($wpidd ==242){
$ms1="【开天珠】（1级）";
$ms2="法宝经验15万,修炼经验210万,银两1800万";
$ms3=243;

} elseif($wpidd ==243){
$ms1="【开天珠】（2级）";
$ms2="法宝经验20万,修炼经验300万,银两2500万";
$ms3=244;

} elseif($wpidd ==244){
$ms1="【开天珠】（3级）";
$ms2="法宝经验25万,修炼经验400万,银两3600万";
$ms3=245;
} elseif($wpidd ==245){
$ms1="【开天珠】（4级）";
$ms2="法宝经验30万,修炼经验500万,银两5000万";
$ms3=246;
} elseif($wpidd ==246){
$ms1="【开天珠】（5级）";
$ms2="法宝经验35万,修炼经验600万,银两6000万";
$ms3=247;

} elseif($wpidd ==247){
$ms1="【定海珠】（1级）";
$ms2="法宝经验50万,修炼经验1000万,银两8000万";
$ms3=248;
} elseif($wpidd ==248){
$ms1="【定海珠】（2级）";
$ms2="法宝经验55万,修炼经验2000万,银两1亿";
$ms3=249;
} elseif($wpidd ==249){
$ms1="【定海珠】（3级）";
$ms2="法宝经验60万,修炼经验5000万,银两2亿";
$ms3=250;

} elseif($wpidd ==250){
$ms1="【定海珠】（4级）";
$ms2="法宝经验65万,修炼经验8000万,银两3亿";
$ms3=251;

} elseif($wpidd ==251){
$ms1="【定海珠】（5级）";
$ms2="法宝经验70万,修炼经验1亿,银两5亿";
$ms3=252;
} elseif($wpidd ==252){
$ms1="【乾坤圈】（1级）";
$ms2="法宝经验75万,修炼经验2亿,银两8亿";
$ms3=253;

} elseif($wpidd ==253){
$ms1="【乾坤圈】（2级）";
$ms2="法宝经验80万,修炼经验3亿,银两11亿";
$ms3=254;

} elseif($wpidd ==254){
$ms1="【乾坤圈】（3级）";
$ms2="法宝经验85万,修炼经验4亿,银两15亿";
$ms3=255;
} elseif($wpidd ==255){
$ms1="【乾坤圈】（4级）";
$ms2="法宝经验90万,修炼经验5亿,银两19亿";
$ms3=256;

} elseif($wpidd ==256){
$ms1="【乾坤圈】（5级）";
$ms2="法宝经验100万,修炼经验6亿,银两25亿";
$ms3=257;
} elseif($wpidd ==257){
$ms1="【金箍棒】（1级）";
$ms2="法宝经验200万,修炼经验10亿,银两40亿";
$ms3=258;
} elseif($wpidd ==258){
$ms1="【金箍棒】（2级）";
$ms2="法宝经验210万,修炼经验11亿,银两42亿";
$ms3=259;
} elseif($wpidd ==259){
$ms1="【金箍棒】（3级）";
$ms2="法宝经验220万,修炼经验12亿,银两44亿";
$ms3=260;
} elseif($wpidd ==260){
$ms1="【金箍棒】（4级）";
$ms2="法宝经验240万,修炼经验13亿,银两46亿";
$ms3=261;
} elseif($wpidd ==261){
$ms1="【金箍棒】（5级）";
$ms2="法宝经验250万,修炼经验14亿,银两48亿";
$ms3=262;


} elseif($wpidd ==262){
$ms1="【金箍棒】（6级）";
$ms2="法宝经验260万,修炼经验15亿,银两50亿";
$ms3=263;
} elseif($wpidd ==263){
$ms1="【金箍棒】（7级）";
$ms2="法宝经验280万,修炼经验16亿,银两52亿";
$ms3=264;

} elseif($wpidd ==264){
$ms1="【金箍棒】（8级）";
$ms2="法宝经验290万,修炼经验17亿,银两53亿";
$ms3=265;



} elseif($wpidd ==265){
$ms1="【金箍棒】（9级）";
$ms2="法宝经验300万,修炼经验18亿,银两56亿";
$ms3=266;

} elseif($wpidd ==266){
$ms1="【金箍棒】（10级）";
$ms2="法宝经验350万,修炼经验20亿,银两60亿";
$ms3=267;
} elseif($wpidd ==267){
$ms1="【金箍棒】（11级）";
$ms2="法宝经验370万,修炼经验22亿,银两63亿";
$ms3=268;

} elseif($wpidd ==268){
$ms1="【金箍棒】（12级）";
$ms2="法宝经验390万,修炼经验24亿,银两66亿";
$ms3=269;
} elseif($wpidd ==269){
$ms1="【金箍棒】（13级）";
$ms2="法宝经验410万,修炼经验26亿,银两69亿";
$ms3=270;
} elseif($wpidd ==270){
$ms1="【金箍棒】（14级）";
$ms2="法宝经验430万,修炼经验28亿,银两72亿";
$ms3=271;
} elseif($wpidd ==271){
$ms1="【金箍棒】（15级）";
$ms2="法宝经验440万,修炼经验30亿,银两75亿";
$ms3=272;


} elseif($wpidd ==272){
$ms1="【金箍棒】（16级）";
$ms2="法宝经验460万,修炼经验32亿,银两78亿";
$ms3=273;
} elseif($wpidd ==273){
$ms1="【金箍棒】（17级）";
$ms2="法宝经验480万,修炼经验34亿,银两81亿";
$ms3=274;

} elseif($wpidd ==274){
$ms1="【金箍棒】（18级）";
$ms2="法宝经验500万,修炼经验36亿,银两84亿";
$ms3=275;
} elseif($wpidd ==275){
$ms1="【金箍棒】（19级）";
$ms2="法宝经验520万,修炼经验38亿,银两87亿";
$ms3=276;
} elseif($wpidd ==276){
$ms1="【金箍棒】（20级）";
$ms2="法宝经验540万,修炼经验40亿,银两90亿";
$ms3=277;
} elseif($wpidd ==277){
$ms1="【如意金箍棒】（1级）";
$ms2="法宝经验600万,修炼经验50亿,银两100亿";
$ms3=278;


} elseif($wpidd ==278){
$ms1="【如意金箍棒】（2级）";
$ms2="法宝经验700万,修炼经验70亿,银两70亿";
$ms3=279;


} elseif($wpidd ==279){
$ms1="【如意金箍棒】（3级）";
$ms2="法宝经验800万,修炼经验80亿,银两80亿";
$ms3=280;

} elseif($wpidd ==280){
$ms1="【如意金箍棒】（4级）";
$ms2="法宝经验900万,修炼经验90亿,银两90亿";
$ms3=281;
} elseif($wpidd ==281){
$ms1="【如意金箍棒】（5级）";
$ms2="法宝经验1000万,修炼经验100亿,银两100亿";
$ms3=282;


} elseif($wpidd ==282){
$ms1="【如意金箍棒】（6级）";
$ms2="法宝经验1100万,修炼经验110亿,银两110亿";
$ms3=283;
} elseif($wpidd ==283){
$ms1="【如意金箍棒】（7级）";
$ms2="法宝经验1200万,修炼经验120亿,银两120亿";
$ms3=284;

} elseif($wpidd ==284){
$ms1="【如意金箍棒】（8级）";
$ms2="法宝经验1300万,修炼经验130亿,银两130亿";
$ms3=285;



} elseif($wpidd ==285){
$ms1="【如意金箍棒】（9级）";
$ms2="法宝经验1400万,修炼经验140亿,银两140亿";
$ms3=286;

} elseif($wpidd ==286){
$ms1="【如意金箍棒】（10级）";
$ms2="法宝经验1500万,修炼经验150亿,银两150亿";
$ms3=287;

} elseif($wpidd ==287){
$ms1="【如意金箍棒】（11级）";
$ms2="法宝经验1600万,修炼经验160亿,银两160亿";
$ms3=288;
} elseif($wpidd ==288){
$ms1="【如意金箍棒】（12级）";
$ms2="法宝经验1700万,修炼经验170亿,银两170亿";
$ms3=289;

} elseif($wpidd ==289){
$ms1="【如意金箍棒】（13级）";
$ms2="法宝经验1800万,修炼经验180亿,银两180亿";
$ms3=290;
} elseif($wpidd ==290){
$ms1="【如意金箍棒】（14级）";
$ms2="法宝经验1900万,修炼经验190亿,银两190亿";
$ms3=291;
} elseif($wpidd ==291){
$ms1="【如意金箍棒】（15级）";
$ms2="法宝经验2000万,修炼经验200亿,银两200亿";
$ms3=292;


} elseif($wpidd ==292){
$ms1="【如意金箍棒】（16级）";
$ms2="法宝经验2100万,修炼经验210亿,银两210亿";
$ms3=293;
} elseif($wpidd ==293){
$ms1="【如意金箍棒】（17级）";
$ms2="法宝经验2200万,修炼经验220亿,银两220亿";
$ms3=294;

} elseif($wpidd ==294){
$ms1="【如意金箍棒】（18级）";
$ms2="法宝经验2300万,修炼经验230亿,银两230亿";
$ms3=295;



} elseif($wpidd ==295){
$ms1="【如意金箍棒】（19级）";
$ms2="法宝经验2400万,修炼经验240亿,银两240亿";
$ms3=296;

} elseif($wpidd ==296){
$ms1="【如意金箍棒】（20级）";
$ms2="法宝经验3000万,修炼经验300亿,银两300亿";
$ms3=620;
} elseif($wpidd ==300){
$ms1="【一级魔化-章鱼哥】";
$ms2="银两1000万,〖魔化石〗x50,西游声望10万";
} elseif($wpidd ==303){
$ms1="【二级魔化-章鱼哥】";
$ms2="银两3000万,〖魔化石〗x200,西游声望20万";
} elseif($wpidd ==304){
$ms1="【三级魔化-章鱼哥】";
$ms2="银两5000万,〖魔化石〗x500,西游声望30万";
} elseif($wpidd ==305){
$ms1="【四级魔化-章鱼哥】";
$ms2="银两1亿,〖魔化石〗x600,西游声望40万";
} elseif($wpidd ==306){
$ms1="【五级魔化-章鱼哥】";
$ms2="银两2亿,〖魔化石〗x800,西游声望50万";
} elseif($wpidd ==307){
$ms1="【六级魔化-章鱼哥】";
$ms2="银两3亿,〖魔化石〗x1000,西游声望70万";
} elseif($wpidd ==308){
$ms1="【七级魔化-章鱼哥】";
$ms2="银两5亿,〖魔化石〗x1500,西游声望90万";

} elseif($wpidd ==309){
$ms1="【八级魔化-章鱼哥】";
$ms2="银两7亿,〖魔化石〗x2000,西游声望150万";

} elseif($wpidd ==310){
$ms1="【九级魔化-章鱼哥】";
$ms2="银两10亿,〖魔化石〗x3000,西游声望200万";

} elseif($wpidd ==311){
$ms1="【十级魔化-章鱼哥】";
$ms2="银两30亿,〖魔化石〗x5000,西游声望500万,〖金豆〗x300";





} elseif($wpidd ==301){
$ms1="【一级魔化-仙鹤】";
$ms2="银两1000万,〖魔化石〗x50,西游声望10万";
} elseif($wpidd ==313){
$ms1="【二级魔化-仙鹤】";
$ms2="银两3000万,〖魔化石〗x200,西游声望20万";
} elseif($wpidd ==314){
$ms1="【三级魔化-仙鹤】";
$ms2="银两5000万,〖魔化石〗x500,西游声望30万";
} elseif($wpidd ==315){
$ms1="【四级魔化-仙鹤】";
$ms2="银两1亿,〖魔化石〗x600,西游声望40万";
} elseif($wpidd ==316){
$ms1="【五级魔化-仙鹤】";
$ms2="银两2亿,〖魔化石〗x800,西游声望50万";
} elseif($wpidd ==317){
$ms1="【六级魔化-仙鹤】";
$ms2="银两3亿,〖魔化石〗x1000,西游声望70万";
} elseif($wpidd ==318){
$ms1="【七级魔化-仙鹤】";
$ms2="银两5亿,〖魔化石〗x1500,西游声望90万";

} elseif($wpidd ==319){
$ms1="【八级魔化-仙鹤】";
$ms2="银两7亿,〖魔化石〗x2000,西游声望150万";

} elseif($wpidd ==320){
$ms1="【九级魔化-仙鹤】";
$ms2="银两10亿,〖魔化石〗x3000,西游声望200万";

} elseif($wpidd ==321){
$ms1="【十级魔化-仙鹤】";
$ms2="银两30亿,〖魔化石〗x5000,西游声望500万,〖金豆〗x300";





} elseif($wpidd ==302){
$ms1="【一级魔化-五爪金龙】";
$ms2="银两1000万,〖魔化石〗x50,西游声望10万";
} elseif($wpidd ==323){
$ms1="【二级魔化-五爪金龙】";
$ms2="银两3000万,〖魔化石〗x200,西游声望20万";
} elseif($wpidd ==324){
$ms1="【三级魔化-五爪金龙】";
$ms2="银两5000万,〖魔化石〗x500,西游声望30万";
} elseif($wpidd ==325){
$ms1="【四级魔化-五爪金龙】";
$ms2="银两1亿,〖魔化石〗x600,西游声望40万";
} elseif($wpidd ==326){
$ms1="【五级魔化-五爪金龙】";
$ms2="银两2亿,〖魔化石〗x800,西游声望50万";

} elseif($wpidd ==327){

$ms1="【六级魔化-五爪金龙】";
$ms2="银两3亿,〖魔化石〗x1000,西游声望70万";
} elseif($wpidd ==328){
$ms1="【七级魔化-五爪金龙】";
$ms2="银两5亿,〖魔化石〗x1500,西游声望90万";

} elseif($wpidd ==329){
$ms1="【八级魔化-五爪金龙】";
$ms2="银两7亿,〖魔化石〗x2000,西游声望150万";

} elseif($wpidd ==330){
$ms1="【九级魔化-五爪金龙】";
$ms2="银两10亿,〖魔化石〗x3000,西游声望200万";

} elseif($wpidd ==331){
$ms1="【十级魔化-五爪金龙】";
$ms2="银两30亿,〖魔化石〗x5000,西游声望500万,〖金豆〗x300";









} elseif($wpidd ==14){
$ms1="【幻想枪Ⅰ】";
$ms2="〖金豆〗x60,西游声望200000,银两5亿5000万";
$ms3=400;
} elseif($wpidd ==101){
$ms1="【幻想战甲Ⅰ】";
$ms2="〖金豆〗x60,西游声望200000,银两5亿5000万";
$ms3=401;
} elseif($wpidd ==133){
$ms1="【幻想战盔Ⅰ】";
$ms2="〖金豆〗x60,西游声望200000,银两5亿5000万";
$ms3=402;
} elseif($wpidd ==165){
$ms1="【幻想战靴Ⅰ】";
$ms2="〖金豆〗x60,西游声望200000,银两5亿5000万";
$ms3=403;

} elseif($wpidd ==196){
$ms1="【幻想项链Ⅰ】";
$ms2="〖金豆〗x60,西游声望200000,银两5亿5000万";
$ms3=404;
} elseif($wpidd ==234){
$ms1="【幻想手镯Ⅰ】";
$ms2="〖金豆〗x60,西游声望200000,银两5亿5000万";
$ms3=405;


} elseif($wpidd ==400){
$ms1="【幻想枪ⅠⅠ】";
$ms2="〖金豆〗x80,西游声望250000,银两7亿5000万";
$ms3=421;
} elseif($wpidd ==401){
$ms1="【幻想战甲ⅠⅠ】";
$ms2="〖金豆〗x80,西游声望250000,银两7亿5000万";
$ms3=407;
} elseif($wpidd ==402){
$ms1="【幻想战盔ⅠⅠ】";
$ms2="〖金豆〗x80,西游声望250000,银两7亿5000万";
$ms3=408;
} elseif($wpidd ==403){
$ms1="【幻想战靴ⅠⅠ】";
$ms2="〖金豆〗x80,西游声望250000,银两7亿5000万";
$ms3=409;

} elseif($wpidd ==404){
$ms1="【幻想项链ⅠⅠ】";
$ms2="〖金豆〗x80,西游声望250000,银两7亿5000万";
$ms3=410;
} elseif($wpidd ==405){
$ms1="【幻想手镯ⅠⅠ】";
$ms2="〖金豆〗x80,西游声望250000,银两7亿5000万";
$ms3=411;


} elseif($wpidd ==28){
$ms1="【幻想叉Ⅰ】";
$ms2="〖金豆〗x60,西游声望200000,银两5亿5000万";
$ms3=412;

} elseif($wpidd ==42){
$ms1="【幻想棍Ⅰ】";
$ms2="〖金豆〗x60,西游声望200000,银两5亿5000万";
$ms3=413;
} elseif($wpidd ==56){
$ms1="【幻想仗Ⅰ】";
$ms2="〖金豆〗x60,西游声望200000,银两5亿5000万";
$ms3=414;
} elseif($wpidd ==70){
$ms1="【幻想剑Ⅰ】";
$ms2="〖金豆〗x60,西游声望200000,银两5亿5000万";
$ms3=415;




} elseif($wpidd ==412){
$ms1="【幻想叉ⅠⅠ】";
$ms2="〖金豆〗x80,西游声望250000,银两7亿5000万";
$ms3=422;

} elseif($wpidd ==413){
$ms1="【幻想棍ⅠⅠ】";
$ms2="〖金豆〗x80,西游声望250000,银两7亿5000万";
$ms3=423;
} elseif($wpidd ==414){
$ms1="【幻想仗ⅠⅠ】";
$ms2="〖金豆〗x80,西游声望250000,银两7亿5000万";
$ms3=424;
} elseif($wpidd ==415){
$ms1="【幻想剑ⅠⅠ】";
$ms2="〖金豆〗x80,西游声望250000,银两7亿5000万";
$ms3=425;





} elseif($wpidd ==421){
$ms1="【幻想枪ⅠⅠⅠ】";
$ms2="〖金豆〗x120,西游声望350000,银两15亿";
$ms3=438;
} elseif($wpidd ==422){
$ms1="【幻想叉ⅠⅠⅠ】";
$ms2="〖金豆〗x120,西游声望350000,银两15亿";
$ms3=439;

} elseif($wpidd ==423){
$ms1="【幻想棍ⅠⅠⅠ】";
$ms2="〖金豆〗x120,西游声望350000,银两15亿";
$ms3=440;
} elseif($wpidd ==424){
$ms1="【幻想仗ⅠⅠⅠ】";
$ms2="〖金豆〗x120,西游声望350000,银两15亿";
$ms3=441;
} elseif($wpidd ==425){
$ms1="【幻想剑ⅠⅠⅠ】";
$ms2="〖金豆〗x120,西游声望350000,银两15亿";
$ms3=442;






} elseif($wpidd ==407){
$ms1="【幻想战甲ⅠⅠⅠ】";
$ms2="〖金豆〗x120,西游声望350000,银两15亿";
$ms3=443;
} elseif($wpidd ==408){
$ms1="【幻想战盔ⅠⅠⅠ】";
$ms2="〖金豆〗x120,西游声望350000,银两15亿";
$ms3=444;
} elseif($wpidd ==409){
$ms1="【幻想战靴ⅠⅠⅠ】";
$ms2="〖金豆〗x120,西游声望350000,银两15亿";
$ms3=445;

} elseif($wpidd ==410){
$ms1="【幻想项链ⅠⅠⅠ】";
$ms2="〖金豆〗x120,西游声望350000,银两15亿";
$ms3=446;
} elseif($wpidd ==411){
$ms1="【幻想手镯ⅠⅠⅠ】";
$ms2="〖金豆〗x120,西游声望350000,银两15亿";
$ms3=447;













} elseif($wpidd ==97||$wpidd ==93||$wpidd ==94||$wpidd ==95||$wpidd ==96){
$ms1="【刑天铁甲】";
$ms2="〖金豆〗x50,西游声望150000,银两3亿5000万";
$ms3=236;
} elseif($wpidd ==124||$wpidd ==125||$wpidd ==126||$wpidd ==127||$wpidd ==128){
$ms1="【旱魃鬼面】";
$ms2="〖金豆〗x50,西游声望150000,银两3亿5000万";
$ms3=130;

} elseif($wpidd ==156||$wpidd ==157||$wpidd ==158||$wpidd ==159||$wpidd ==160){
$ms1="【神皇之靴】";
$ms2="〖金豆〗x50,西游声望150000,银两3亿5000万";
$ms3=162;

} elseif($wpidd ==188||$wpidd ==189||$wpidd ==190||$wpidd ==191||$wpidd ==192){
$ms1="【共工护符】";
$ms2="〖金豆〗x50,西游声望150000,银两3亿5000万";
$ms3=193;

} elseif($wpidd ==219||$wpidd ==220||$wpidd ==221||$wpidd ==222||$wpidd ==223){
$ms1="【祝融戒指】";
$ms2="〖金豆〗x50,西游声望150000,银两3亿5000万";
$ms3=237;



} elseif($wpidd ==7){
$ms1="【元帅戟】";
$ms2="〖金豆〗x80,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两7亿";
$ms3=416;
} elseif($wpidd ==21){
$ms1="【龙王叉】";
$ms2="〖金豆〗x80,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两7亿";
$ms3=417;
} elseif($wpidd ==35){
$ms1="【天尊棍】";
$ms2="〖金豆〗x80,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两7亿";
$ms3=418;
} elseif($wpidd ==49){
$ms1="【菩萨仗】";
$ms2="〖金豆〗x80,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两7亿";
$ms3=419;
} elseif($wpidd ==63){
$ms1="【王母剑】";
$ms2="〖金豆〗x80,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两7亿";
$ms3=420;

} elseif($wpidd ==12){
$ms1="【元帅戟】";
$ms2="〖金豆〗x10,红宝石五x10,黄宝石五x10,蓝宝石五x10,佛印石五x10,天宫声望5000,乌鸡国声望5000,宝象国声望5000,银两2亿";
$ms3=416;
} elseif($wpidd ==26){
$ms1="【龙王叉】";
$ms2="〖金豆〗x10,红宝石五x10,黄宝石五x10,蓝宝石五x10,佛印石五x10,天宫声望5000,乌鸡国声望5000,宝象国声望5000,银两2亿";
$ms3=417;
} elseif($wpidd ==40){
$ms1="【天尊棍】";
$ms2="〖金豆〗x10,红宝石五x10,黄宝石五x10,蓝宝石五x10,佛印石五x10,天宫声望5000,乌鸡国声望5000,宝象国声望5000,银两2亿";
$ms3=418;
} elseif($wpidd ==54){
$ms1="【菩萨仗】";
$ms2="〖金豆〗x10,红宝石五x10,黄宝石五x10,蓝宝石五x10,佛印石五x10,天宫声望5000,乌鸡国声望5000,宝象国声望5000,银两2亿";
$ms3=419;
} elseif($wpidd ==68){
$ms1="【王母剑】";
$ms2="〖金豆〗x10,红宝石五x10,黄宝石五x10,蓝宝石五x10,佛印石五x10,天宫声望5000,乌鸡国声望5000,宝象国声望5000,银两2亿";
$ms3=420;

} elseif($wpidd ==337){
$ms1="【心有灵犀】（婚戒）";
$ms2="〖金豆〗x20,红宝石四x20,黄宝石四x20,蓝宝石四x20,金刚石四x20,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两5亿";
$ms3=432;
} elseif($wpidd ==338){
$ms1="【心有灵犀】（婚链）";
$ms2="〖金豆〗x20,红宝石四x20,黄宝石四x20,蓝宝石四x20,金刚石四x20,天宫声望50000,乌鸡国声望50000,宝象国声望50000,银两5亿";
$ms3=433;


} elseif($wpidd ==432){
$ms1="【山盟海誓】（婚戒）";
$ms2="〖金豆〗x50,红宝石五x10,黄宝石五x10,蓝宝石五x10,玄武石五x10,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两15亿";
$ms3=434;
} elseif($wpidd ==433){
$ms1="【山盟海誓】（婚链）";
$ms2="〖金豆〗x50,红宝石五x10,黄宝石五x10,蓝宝石五x10,玄武石五x10,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两15亿";
$ms3=435;



} elseif($wpidd ==434){
$ms1="【海枯石烂】（婚戒）";
$ms2="〖金豆〗x100,红宝石五x50,黄宝石五x50,蓝宝石五x50,玄武石五x50,夫妻声望100000,天宫声望200000,乌鸡国声望200000,宝象国声望200000,银两20亿";
$ms3=554;
} elseif($wpidd ==435){
$ms1="【海枯石烂】（婚链）";
$ms2="〖金豆〗x100,红宝石五x50,黄宝石五x50,蓝宝石五x50,玄武石五x50,夫妻声望100000,天宫声望200000,乌鸡国声望200000,宝象国声望200000,银两20亿";
$ms3=555;

} elseif($wpidd ==554){
$ms1="【天作之合】（婚戒）";
$ms2="〖金豆〗x200,红宝石六x50,黄宝石六x50,蓝宝石六x50,玄武石六x50,夫妻声望200000,天宫声望300000,乌鸡国声望300000,宝象国声望300000,银两40亿";
$ms3=556;
} elseif($wpidd ==555){
$ms1="【天作之合】（婚链）";
$ms2="〖金豆〗x200,红宝石六x50,黄宝石六x50,蓝宝石六x50,玄武石六x50,夫妻声望200000,天宫声望300000,乌鸡国声望300000,宝象国声望300000,银两40亿";
$ms3=557;













} elseif($wpidd ==99){
$ms1="【诛仙战甲】";
$ms2="〖金豆〗x200,红水晶五x50,黄水晶五x50,蓝水晶五x50,金刚石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=448;
} elseif($wpidd ==131){
$ms1="【诛仙头盔】";
$ms2="〖金豆〗x200,红水晶五x50,黄水晶五x50,蓝水晶五x50,佛印石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=449;
} elseif($wpidd ==163){
$ms1="【诛仙战靴】";
$ms2="〖金豆〗x200,红水晶五x50,黄水晶五x50,蓝水晶五x50,玄武石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=450;
} elseif($wpidd ==194){
$ms1="【诛仙项链】";
$ms2="〖金豆〗x200,红宝石五x50,黄宝石五x50,蓝宝石五x50,金刚石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=451;
} elseif($wpidd ==232){
$ms1="【诛仙手镯】";
$ms2="〖金豆〗x200,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=452;





} elseif($wpidd ==99){
$ms1="【诛仙战甲】";
$ms2="〖金豆〗x200,红水晶五x50,黄水晶五x50,蓝水晶五x50,金刚石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=448;
} elseif($wpidd ==131){
$ms1="【诛仙头盔】";
$ms2="〖金豆〗x200,红水晶五x50,黄水晶五x50,蓝水晶五x50,佛印石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=449;
} elseif($wpidd ==163){
$ms1="【诛仙战靴】";
$ms2="〖金豆〗x200,红水晶五x50,黄水晶五x50,蓝水晶五x50,玄武石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=450;
} elseif($wpidd ==194){
$ms1="【诛仙项链】";
$ms2="〖金豆〗x200,红宝石五x50,黄宝石五x50,蓝宝石五x50,金刚石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=451;
} elseif($wpidd ==232){
$ms1="【诛仙手镯】";
$ms2="〖金豆〗x200,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=452;



} elseif($wpidd ==416){
$ms1="【诛仙枪】";
$ms2="〖金豆〗x200,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=453;
} elseif($wpidd ==417){
$ms1="【诛仙叉】";
$ms2="〖金豆〗x200,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=454;
} elseif($wpidd ==418){
$ms1="【诛仙棍】";
$ms2="〖金豆〗x200,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=455;
} elseif($wpidd ==419){
$ms1="【诛仙仗】";
$ms2="〖金豆〗x200,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=456;
} elseif($wpidd ==420){
$ms1="【诛仙剑】";
$ms2="〖金豆〗x200,红宝石五x50,黄宝石五x50,蓝宝石五x50,佛印石五x50,天宫声望100000,乌鸡国声望100000,宝象国声望100000,银两20亿";
$ms3=457;




} elseif($wpidd ==443){
$ms1="【诛仙战甲】";
$ms2="〖金豆〗x200,西游声望350000,银两20亿";
$ms3=448;
} elseif($wpidd ==444){
$ms1="【诛仙战盔】";
$ms2="〖金豆〗x200,西游声望350000,银两20亿";
$ms3=449;
} elseif($wpidd ==445){
$ms1="【诛仙战靴】";
$ms2="〖金豆〗x200,西游声望350000,银两20亿";
$ms3=450;

} elseif($wpidd ==446){
$ms1="【诛仙项链】";
$ms2="〖金豆〗x200,西游声望350000,银两20亿";
$ms3=451;
} elseif($wpidd ==447){
$ms1="【诛仙手镯】";
$ms2="〖金豆〗x200,西游声望350000,银两20亿";
$ms3=452;



} elseif($wpidd ==438){
$ms1="【诛仙枪】";
$ms2="〖金豆〗x200,西游声望350000,银两20亿";
$ms3=453;
} elseif($wpidd ==439){
$ms1="【诛仙叉】";
$ms2="〖金豆〗x200,西游声望350000,银两20亿";
$ms3=454;

} elseif($wpidd ==440){
$ms1="【诛仙棍】";
$ms2="〖金豆〗x200,西游声望350000,银两20亿";
$ms3=455;
} elseif($wpidd ==441){
$ms1="【诛仙仗】";
$ms2="〖金豆〗x200,西游声望350000,银两20亿";
$ms3=456;
} elseif($wpidd ==442){
$ms1="【诛仙剑】";
$ms2="〖金豆〗x200,西游声望350000,银两20亿";
$ms3=457;



//宠物装备

} elseif($wpidd ==426){
$ms1="〖大兽爪〗";
$ms2="〖装备图纸〗（宠物）x1,西游声望1万,银两1000万";
$ms3=458;
} elseif($wpidd ==427){
$ms1="〖大兽甲〗";
$ms2="〖装备图纸〗（宠物）x1,西游声望1万,银两1000万";
$ms3=459;
} elseif($wpidd ==428){
$ms1="〖大兽盔〗";
$ms2="〖装备图纸〗（宠物）x1,西游声望1万,银两1000万";
$ms3=460;
} elseif($wpidd ==429){
$ms1="〖大兽靴〗";
$ms2="〖装备图纸〗（宠物）x1,西游声望1万,银两1000万";
$ms3=461;
} elseif($wpidd ==430){
$ms1="〖大兽链〗";
$ms2="〖装备图纸〗（宠物）x1,西游声望1万,银两1000万";
$ms3=462;
} elseif($wpidd ==431){
$ms1="〖大兽镯〗";
$ms2="〖装备图纸〗（宠物）x1,西游声望1万,银两1000万";
$ms3=463;




} elseif($wpidd ==436){
$ms1="【一生所爱の婚戒】（典藏版）";
$ms2="【喜鹊令】";
$ms3=558;

} elseif($wpidd ==437){
$ms1="【一生所爱の婚戒】（典藏版）";
$ms2="【喜鹊令】";
$ms3=559;












} elseif($wpidd ==458){
$ms1="〖顽兽爪〗";
$ms2="〖装备图纸〗（宠物）x3,西游声望2万,银两5000万";
$ms3=464;
} elseif($wpidd ==459){
$ms1="〖顽兽甲〗";
$ms2="〖装备图纸〗（宠物）x3,西游声望2万,银两5000万";
$ms3=465;
} elseif($wpidd ==460){
$ms1="〖顽兽盔〗";
$ms2="〖装备图纸〗（宠物）x3,西游声望2万,银两5000万";
$ms3=466;
} elseif($wpidd ==461){
$ms1="〖顽兽靴〗";
$ms2="〖装备图纸〗（宠物）x3,西游声望2万,银两5000万";
$ms3=467;
} elseif($wpidd ==462){
$ms1="〖顽兽链〗";
$ms2="〖装备图纸〗（宠物）x3,西游声望2万,银两5000万";
$ms3=468;
} elseif($wpidd ==463){
$ms1="〖顽兽镯〗";
$ms2="〖装备图纸〗（宠物）x3,西游声望2万,银两5000万";
$ms3=469;


} elseif($wpidd ==464){
$ms1="〖猛兽爪〗";
$ms2="〖装备图纸〗（宠物）x8,西游声望5万,银两1亿";
$ms3=470;
} elseif($wpidd ==465){
$ms1="〖猛兽甲〗";
$ms2="〖装备图纸〗（宠物）x8,西游声望5万,银两1亿";
$ms3=471;
} elseif($wpidd ==466){
$ms1="〖猛兽盔〗";
$ms2="〖装备图纸〗（宠物）x8,西游声望5万,银两1亿";
$ms3=472;
} elseif($wpidd ==467){
$ms1="〖猛兽靴〗";
$ms2="〖装备图纸〗（宠物）x8,西游声望5万,银两1亿";
$ms3=473;
} elseif($wpidd ==468){
$ms1="〖猛兽链〗";
$ms2="〖装备图纸〗（宠物）x8,西游声望5万,银两1亿";
$ms3=474;
} elseif($wpidd ==469){
$ms1="〖猛兽镯〗";
$ms2="〖装备图纸〗（宠物）x8,西游声望5万,银两1亿";
$ms3=475;

} elseif($wpidd ==470){
$ms1="〖神兽兽爪〗";
$ms2="〖金豆〗x20,〖装备图纸〗（宠物）x15,西游声望8万,银两2亿";
$ms3=476;
} elseif($wpidd ==471){
$ms1="〖神兽兽甲〗";
$ms2="〖金豆〗x20,〖装备图纸〗（宠物）x15,西游声望8万,银两2亿";
$ms3=477;
} elseif($wpidd ==472){
$ms1="〖神兽兽盔〗";
$ms2="〖金豆〗x20,〖装备图纸〗（宠物）x15,西游声望8万,银两2亿";
$ms3=478;
} elseif($wpidd ==473){
$ms1="〖神兽兽靴〗";
$ms2="〖金豆〗x20,〖装备图纸〗（宠物）x15,西游声望8万,银两2亿";
$ms3=479;
} elseif($wpidd ==474){
$ms1="〖神兽兽链〗";
$ms2="〖金豆〗x20,〖装备图纸〗（宠物）x15,西游声望8万,银两2亿";
$ms3=480;
} elseif($wpidd ==475){
$ms1="〖神兽兽镯〗";
$ms2="〖金豆〗x20,〖装备图纸〗（宠物）x15,西游声望8万,银两2亿";
$ms3=481;




} elseif($wpidd ==476){
$ms1="〖圣兽兽爪〗";
$ms2="〖金豆〗x50,〖装备图纸〗（宠物）x20,西游声望12万,银两5亿";
$ms3=482;
} elseif($wpidd ==477){
$ms1="〖圣兽兽甲〗";
$ms2="〖金豆〗x50,〖装备图纸〗（宠物）x20,西游声望12万,银两5亿";
$ms3=483;
} elseif($wpidd ==478){
$ms1="〖圣兽兽盔〗";
$ms2="〖金豆〗x50,〖装备图纸〗（宠物）x20,西游声望12万,银两5亿";
$ms3=484;
} elseif($wpidd ==479){
$ms1="〖圣兽兽靴〗";
$ms2="〖金豆〗x50,〖装备图纸〗（宠物）x20,西游声望12万,银两5亿";
$ms3=485;
} elseif($wpidd ==480){
$ms1="〖圣兽兽链〗";
$ms2="〖金豆〗x50,〖装备图纸〗（宠物）x20,西游声望12万,银两5亿";
$ms3=486;
} elseif($wpidd ==481){
$ms1="〖圣兽兽镯〗";
$ms2="〖金豆〗x50,〖装备图纸〗（宠物）x20,西游声望12万,银两5亿";
$ms3=487;

} elseif($wpidd ==482){
$ms1="〖玛雅兽爪〗";
$ms2="〖金豆〗x100,〖装备图纸〗（宠物）x50,西游声望20万,银两10亿";
$ms3=488;
} elseif($wpidd ==483){
$ms1="〖玛雅兽甲〗";
$ms2="〖金豆〗x100,〖装备图纸〗（宠物）x50,西游声望20万,银两10亿";
$ms3=489;
} elseif($wpidd ==484){
$ms1="〖玛雅兽盔〗";
$ms2="〖金豆〗x100,〖装备图纸〗（宠物）x50,西游声望20万,银两10亿";
$ms3=490;
} elseif($wpidd ==485){
$ms1="〖玛雅兽靴〗";
$ms2="〖金豆〗x100,〖装备图纸〗（宠物）x50,西游声望20万,银两10亿";
$ms3=491;
} elseif($wpidd ==486){
$ms1="〖玛雅兽链〗";
$ms2="〖金豆〗x100,〖装备图纸〗（宠物）x50,西游声望20万,银两10亿";
$ms3=492;
} elseif($wpidd ==487){
$ms1="〖玛雅兽镯〗";
$ms2="〖金豆〗x100,〖装备图纸〗（宠物）x50,西游声望20万,银两10亿";
$ms3=493;








} elseif($wpidd ==448){
$ms1="【圣灵战甲】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x20,西游声望35万,银两25亿";
$ms3=504;
} elseif($wpidd ==449){
$ms1="【圣灵战盔】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x20,西游声望35万,银两25亿";
$ms3=505;
} elseif($wpidd ==450){
$ms1="【圣灵战靴】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x20,西游声望35万,银两25亿";
$ms3=506;

} elseif($wpidd ==451){
$ms1="【圣灵项链】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x20,西游声望35万,银两25亿";
$ms3=507;
} elseif($wpidd ==452){
$ms1="【圣灵手镯】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x20,西游声望35万,银两25亿";
$ms3=508;



} elseif($wpidd ==453){
$ms1="【圣灵枪】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x20,西游声望35万,银两25亿";
$ms3=509;
} elseif($wpidd ==454){
$ms1="【圣灵叉】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x20,西游声望35万,银两25亿";
$ms3=510;

} elseif($wpidd ==455){
$ms1="【圣灵棍】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x20,西游声望35万,银两25亿";
$ms3=511;
} elseif($wpidd ==456){
$ms1="【圣灵仗】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x20,西游声望35万,银两25亿";
$ms3=512;
} elseif($wpidd ==457){
$ms1="【圣灵剑】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x20,西游声望35万,银两25亿";
$ms3=513;




} elseif($wpidd ==504){
$ms1="【圣灵战甲Ⅰ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x30,西游声望40万,银两30亿";
$ms3=514;
} elseif($wpidd ==505){
$ms1="【圣灵战盔Ⅰ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x30,西游声望40万,银两30亿";
$ms3=515;
} elseif($wpidd ==506){
$ms1="【圣灵战靴Ⅰ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x30,西游声望40万,银两30亿";
$ms3=516;

} elseif($wpidd ==507){
$ms1="【圣灵项链Ⅰ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x30,西游声望40万,银两30亿";
$ms3=517;
} elseif($wpidd ==508){
$ms1="【圣灵手镯Ⅰ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x30,西游声望40万,银两30亿";
$ms3=518;



} elseif($wpidd ==509){
$ms1="【圣灵枪Ⅰ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x30,西游声望40万,银两30亿";
$ms3=519;
} elseif($wpidd ==510){
$ms1="【圣灵叉Ⅰ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x30,西游声望40万,银两30亿";
$ms3=520;

} elseif($wpidd ==511){
$ms1="【圣灵棍Ⅰ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x30,西游声望40万,银两30亿";
$ms3=521;
} elseif($wpidd ==512){
$ms1="【圣灵仗Ⅰ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x30,西游声望40万,银两30亿";
$ms3=522;
} elseif($wpidd ==513){
$ms1="【圣灵剑Ⅰ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x30,西游声望40万,银两30亿";
$ms3=523;




} elseif($wpidd ==514){
$ms1="【圣灵战甲ⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x50,西游声望40万,银两35亿";
$ms3=524;
} elseif($wpidd ==515){
$ms1="【圣灵战盔ⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x50,西游声望40万,银两35亿";
$ms3=525;
} elseif($wpidd ==516){
$ms1="【圣灵战靴ⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x50,西游声望40万,银两35亿";
$ms3=526;

} elseif($wpidd ==517){
$ms1="【圣灵项链ⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x50,西游声望40万,银两35亿";
$ms3=527;
} elseif($wpidd ==518){
$ms1="【圣灵手镯ⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x50,西游声望40万,银两35亿";
$ms3=528;



} elseif($wpidd ==519){
$ms1="【圣灵枪ⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x50,西游声望40万,银两35亿";
$ms3=529;
} elseif($wpidd ==520){
$ms1="【圣灵叉ⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x50,西游声望40万,银两35亿";
$ms3=530;

} elseif($wpidd ==521){
$ms1="【圣灵棍ⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x50,西游声望40万,银两35亿";
$ms3=531;
} elseif($wpidd ==522){
$ms1="【圣灵仗ⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x50,西游声望40万,银两35亿";
$ms3=532;
} elseif($wpidd ==523){
$ms1="【圣灵剑ⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x50,西游声望40万,银两35亿";
$ms3=533;



} elseif($wpidd ==524){
$ms1="【圣灵战甲ⅠⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x70,西游声望45万,银两40亿";
$ms3=534;
} elseif($wpidd ==525){
$ms1="【圣灵战盔ⅠⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x70,西游声望45万,银两40亿";
$ms3=535;
} elseif($wpidd ==526){
$ms1="【圣灵战靴ⅠⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x70,西游声望45万,银两40亿";
$ms3=536;

} elseif($wpidd ==527){
$ms1="【圣灵项链ⅠⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x70,西游声望45万,银两40亿";
$ms3=537;
} elseif($wpidd ==528){
$ms1="【圣灵手镯ⅠⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x70,西游声望45万,银两40亿";
$ms3=538;



} elseif($wpidd ==529){
$ms1="【圣灵枪ⅠⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x70,西游声望45万,银两40亿";
$ms3=539;
} elseif($wpidd ==530){
$ms1="【圣灵叉ⅠⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x70,西游声望45万,银两40亿";
$ms3=540;

} elseif($wpidd ==531){
$ms1="【圣灵棍ⅠⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x70,西游声望45万,银两40亿";
$ms3=541;
} elseif($wpidd ==532){
$ms1="【圣灵仗ⅠⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x70,西游声望45万,银两40亿";
$ms3=542;
} elseif($wpidd ==533){
$ms1="【圣灵剑ⅠⅠⅠ】";
$ms2="〖金豆〗x200,〖圣灵锻造图纸〗x70,西游声望45万,银两40亿";
$ms3=543;


} elseif($wpidd ==534){
$ms1="【圣灵☯天元甲】";
$ms2="〖金豆〗x300,〖圣灵锻造图纸〗x100,西游声望50万,银两50亿";
$ms3=544;
} elseif($wpidd ==535){
$ms1="【圣灵☯天元盔】";
$ms2="〖金豆〗x300,〖圣灵锻造图纸〗x100,西游声望50万,银两50亿";
$ms3=545;
} elseif($wpidd ==536){
$ms1="【圣灵☯天元靴】";
$ms2="〖金豆〗x300,〖圣灵锻造图纸〗x100,西游声望50万,银两50亿";
$ms3=546;

} elseif($wpidd ==537){
$ms1="【圣灵☯天元链】";
$ms2="〖金豆〗x300,〖圣灵锻造图纸〗x100,西游声望50万,银两50亿";
$ms3=547;
} elseif($wpidd ==538){
$ms1="【圣灵☯天元镯】";
$ms2="〖金豆〗x300,〖圣灵锻造图纸〗x100,西游声望50万,银两50亿";
$ms3=548;



} elseif($wpidd ==539){
$ms1="【圣灵☯天元枪】";
$ms2="〖金豆〗x300,〖圣灵锻造图纸〗x100,西游声望50万,银两50亿";
$ms3=549;
} elseif($wpidd ==540){
$ms1="【圣灵☯天元叉】";
$ms2="〖金豆〗x300,〖圣灵锻造图纸〗x100,西游声望50万,银两50亿";
$ms3=550;

} elseif($wpidd ==541){
$ms1="【圣灵☯天元棍】";
$ms2="〖金豆〗x300,〖圣灵锻造图纸〗x100,西游声望50万,银两50亿";
$ms3=551;
} elseif($wpidd ==542){
$ms1="【圣灵☯天元仗】";
$ms2="〖金豆〗x300,〖圣灵锻造图纸〗x100,西游声望50万,银两50亿";
$ms3=552;
} elseif($wpidd ==543){
$ms1="【圣灵☯天元剑】";
$ms2="〖金豆〗x300,〖圣灵锻造图纸〗x100,西游声望50万,银两50亿";
$ms3=553;





} elseif($wpidd ==333){
$ms1="【镇东神兽】青龙☯仙";
$ms2="〖金豆〗x100,〖玄天残叶〗x100,〖神兽仙魄〗x100,西游声望20万,银两30亿";
$ms3=562;

} elseif($wpidd ==334){
$ms1="【镇东神兽】白虎☯仙";
$ms2="〖金豆〗x100,〖玄天残叶〗x100,〖神兽仙魄〗x100,西游声望20万,银两30亿";
$ms3=563;

} elseif($wpidd ==335){
$ms1="【镇东神兽】朱雀☯仙";
$ms2="〖金豆〗x100,〖玄天残叶〗x100,〖神兽仙魄〗x100,西游声望20万,银两30亿";
$ms3=564;

} elseif($wpidd ==336){
$ms1="【镇东神兽】玄武☯仙";
$ms2="〖金豆〗x100,〖玄天残叶〗x100,〖神兽仙魄〗x100,西游声望20万,银两30亿";
$ms3=565;

} elseif($wpidd ==562){
$ms1="【筋斗云】☯（血）";
$ms2="〖金豆〗x200,〖祥云残片〗x200,〖大圣仙魄〗x200,西游声望30万,银两50亿";
$ms3=566;

} elseif($wpidd ==563){
$ms1="【筋斗云】☯（攻）";
$ms2="〖金豆〗x200,〖祥云残片〗x200,〖大圣仙魄〗x200,西游声望30万,银两50亿";
$ms3=567;

} elseif($wpidd ==564){
$ms1="【筋斗云】☯（魔）";
$ms2="〖金豆〗x200,〖祥云残片〗x200,〖大圣仙魄〗x200,西游声望30万,银两50亿";
$ms3=568;

} elseif($wpidd ==565){
$ms1="【筋斗云】☯（防）";
$ms2="〖金豆〗x200,〖祥云残片〗x200,〖大圣仙魄〗x200,西游声望30万,银两50亿";
$ms3=569;

} elseif($wpidd ==570){
$ms1="【锦缎披风】";
$ms2="〖金豆〗x50,〖祥云残片〗x50,〖大圣仙魄〗x50,西游声望20万,银两20亿";
$ms3=572;

} elseif($wpidd ==572){
$ms1="【恶魔披风】";
$ms2="〖金豆〗x100,〖祥云残片〗x100,〖大圣仙魄〗x100,西游声望40万,银两40亿";
$ms3=573;
} elseif($wpidd ==573){
$ms1="【王者披风】";
$ms2="〖金豆〗x150,〖祥云残片〗x150,〖大圣仙魄〗x150,西游声望50万,银两50亿";
$ms3=574;

} elseif($wpidd ==574){
$ms1="【金甲披风】";
$ms2="〖金豆〗x200,〖祥云残片〗x200,〖大圣仙魄〗x200,西游声望70万,银两70亿";
$ms3=575;

} elseif($wpidd ==575){
$ms1="【大圣披风】";
$ms2="〖金豆〗x300,〖祥云残片〗x300,〖大圣仙魄〗x300,西游声望100万,银两100亿";
$ms3=576;



} elseif($wpidd ==544){
$ms1="【噬魂仙甲】";
$ms2="〖金豆〗x500,〖噬魂锻造图纸〗x100,西游声望100万,银两100亿";
$ms3=578;
} elseif($wpidd ==545){
$ms1="【噬魂仙盔】";
$ms2="〖金豆〗x500,〖噬魂锻造图纸〗x100,西游声望100万,银两100亿";
$ms3=579;
} elseif($wpidd ==546){
$ms1="【噬魂仙靴】";
$ms2="〖金豆〗x500,〖噬魂锻造图纸〗x100,西游声望100万,银两100亿";
$ms3=580;

} elseif($wpidd ==547){
$ms1="【噬魂仙链】";
$ms2="〖金豆〗x500,〖噬魂锻造图纸〗x100,西游声望100万,银两100亿";
$ms3=581;
} elseif($wpidd ==548){
$ms1="【噬魂仙镯】";
$ms2="〖金豆〗x500,〖噬魂锻造图纸〗x100,西游声望100万,银两100亿";
$ms3=582;



} elseif($wpidd ==549){
$ms1="【噬魂仙枪】";
$ms2="〖金豆〗x500,〖噬魂锻造图纸〗x100,西游声望100万,银两100亿";
$ms3=583;
} elseif($wpidd ==550){
$ms1="【噬魂仙叉】";
$ms2="〖金豆〗x500,〖噬魂锻造图纸〗x100,西游声望100万,银两100亿";
$ms3=584;

} elseif($wpidd ==551){
$ms1="【噬魂仙棍】";
$ms2="〖金豆〗x500,〖噬魂锻造图纸〗x100,西游声望100万,银两100亿";
$ms3=585;
} elseif($wpidd ==552){
$ms1="【噬魂仙仗】";
$ms2="〖金豆〗x500,〖噬魂锻造图纸〗x100,西游声望100万,银两100亿";
$ms3=586;
} elseif($wpidd ==553){
$ms1="【噬魂仙剑】";
$ms2="〖金豆〗x500,〖噬魂锻造图纸〗x100,西游声望100万,银两100亿";
$ms3=587;


} elseif($wpidd ==556){
$ms1="【天赐良缘の婚戒】";
$ms2="〖金豆〗x500,红宝石六x200,黄宝石六x200,蓝宝石六x200,玄武石六x200,夫妻声望50万,天宫声望50万,乌鸡国声望50万,宝象国声望50万,银两100亿";
$ms3=590;
} elseif($wpidd ==557){
$ms1="【天赐良缘の婚链】";
$ms2="〖金豆〗x500,红宝石六x200,黄宝石六x200,蓝宝石六x200,玄武石六x200,夫妻声望50万,天宫声望50万,乌鸡国声望50万,宝象国声望50万,银两100亿";
$ms3=591;

} elseif($wpidd ==558){
$ms1="【缘定今生の婚戒】（典藏版）";
$ms2="〖七夕令〗";
$ms3=588;

} elseif($wpidd ==559){
$ms1="【缘定今生の婚链】（典藏版）";
$ms2="〖七夕令〗";
$ms3=589;

} elseif($wpidd ==576){
$ms1="【玄☯仙披风】";
$ms2="〖金豆〗x500,〖祥云残片〗x500,〖大圣仙魄〗x500,西游声望100万,银两100亿";
$ms3=592;






} elseif($wpidd ==578){
$ms1="【帝王仙甲】";
$ms2="〖金豆〗x500,〖帝王之心〗x200,〖帝王之血〗x200,〖帝王之魂〗x200,西游声望200万,银两200亿";
$ms3=593;
} elseif($wpidd ==579){
$ms1="【帝王仙盔】";
$ms2="〖金豆〗x500,〖帝王之心〗x200,〖帝王之血〗x200,〖帝王之魂〗x200,西游声望200万,银两200亿";
$ms3=594;
} elseif($wpidd ==580){
$ms1="【帝王仙靴】";
$ms2="〖金豆〗x500,〖帝王之心〗x200,〖帝王之血〗x200,〖帝王之魂〗x200,西游声望200万,银两200亿";
$ms3=595;

} elseif($wpidd ==581){
$ms1="【帝王仙链】";
$ms2="〖金豆〗x500,〖帝王之心〗x200,〖帝王之血〗x200,〖帝王之魂〗x200,西游声望200万,银两200亿";
$ms3=596;
} elseif($wpidd ==582){
$ms1="【帝王仙镯】";
$ms2="〖金豆〗x500,〖帝王之心〗x200,〖帝王之血〗x200,〖帝王之魂〗x200,西游声望200万,银两200亿";
$ms3=597;



} elseif($wpidd ==583){
$ms1="【帝王仙枪】";
$ms2="〖金豆〗x500,〖帝王之心〗x200,〖帝王之血〗x200,〖帝王之魂〗x200,西游声望200万,银两200亿";
$ms3=598;
} elseif($wpidd ==584){
$ms1="【帝王仙叉】";
$ms2="〖金豆〗x500,〖帝王之心〗x200,〖帝王之血〗x200,〖帝王之魂〗x200,西游声望200万,银两200亿";
$ms3=599;

} elseif($wpidd ==585){
$ms1="【帝王仙棍】";
$ms2="〖金豆〗x500,〖帝王之心〗x200,〖帝王之血〗x200,〖帝王之魂〗x200,西游声望200万,银两200亿";
$ms3=600;
} elseif($wpidd ==586){
$ms1="【帝王仙仗】";
$ms2="〖金豆〗x500,〖帝王之心〗x200,〖帝王之血〗x200,〖帝王之魂〗x200,西游声望200万,银两200亿";
$ms3=601;
} elseif($wpidd ==587){
$ms1="【帝王仙剑】";
$ms2="〖金豆〗x500,〖帝王之心〗x200,〖帝王之血〗x200,〖帝王之魂〗x200,西游声望200万,银两200亿";
$ms3=602;







} elseif($wpidd ==562){
$ms1="【镇东神兽】青龙☯神";
$ms2="〖金豆〗x200,〖玄天残叶〗x200,〖神兽仙魄〗x200,西游声望50万,银两50亿";
$ms3=603;

} elseif($wpidd ==563){
$ms1="【镇东神兽】白虎☯神";
$ms2="〖金豆〗x200,〖玄天残叶〗x200,〖神兽仙魄〗x200,西游声望50万,银两50亿";
$ms3=604;

} elseif($wpidd ==564){
$ms1="【镇东神兽】朱雀☯神";
$ms2="〖金豆〗x200,〖玄天残叶〗x200,〖神兽仙魄〗x200,西游声望50万,银两50亿";
$ms3=605;

} elseif($wpidd ==565){
$ms1="【镇东神兽】玄武☯神";
$ms2="〖金豆〗x200,〖玄天残叶〗x200,〖神兽仙魄〗x200,西游声望50万,银两50亿";
$ms3=606;


} elseif($wpidd ==566){
$ms1="【镇东神兽】青龙☯至尊";
$ms2="〖金豆〗x300,〖玄天残叶〗x300,〖神兽仙魄〗x300,西游声望100万,银两100亿";
$ms3=607;

} elseif($wpidd ==567){
$ms1="【镇东神兽】白虎☯至尊";
$ms2="〖金豆〗x300,〖玄天残叶〗x300,〖神兽仙魄〗x300,西游声望100万,银两100亿";
$ms3=608;

} elseif($wpidd ==568){
$ms1="【镇东神兽】朱雀☯至尊";
$ms2="〖金豆〗x300,〖玄天残叶〗x300,〖神兽仙魄〗x300,西游声望100万,银两100亿";
$ms3=609;

} elseif($wpidd ==569){
$ms1="【镇东神兽】玄武☯至尊";
$ms2="〖金豆〗x300,〖玄天残叶〗x300,〖神兽仙魄〗x300,西游声望100万,银两100亿";
$ms3=610;


} elseif($wpidd ==607){
$ms1="【天尊神兽】（青龙）";
$ms2="〖金豆〗x300,〖玄天残叶〗x500,〖神兽仙魄〗x500,西游声望200万,银两200亿";
$ms3=611;

} elseif($wpidd ==608){
$ms1="【天尊神兽】（白虎）";
$ms2="〖金豆〗x300,〖玄天残叶〗x500,〖神兽仙魄〗x500,西游声望200万,银两200亿";
$ms3=612;

} elseif($wpidd ==609){
$ms1="【天尊神兽】（朱雀）";
$ms2="〖金豆〗x300,〖玄天残叶〗x500,〖神兽仙魄〗x500,西游声望200万,银两200亿";
$ms3=613;

} elseif($wpidd ==610){
$ms1="【天尊神兽】（玄武）";
$ms2="〖金豆〗x300,〖玄天残叶〗x500,〖神兽仙魄〗x500,西游声望200万,银两200亿";
$ms3=614;


} elseif($wpidd ==590){
$ms1="【天仙之恋の婚戒】";
$ms2="〖金豆〗x500,红宝石六x500,黄宝石六x500,蓝宝石六x500,玄武石六x500,夫妻声望200万,天宫声望100万,乌鸡国声望100万,宝象国声望100万,银两100亿";
$ms3=615;
} elseif($wpidd ==591){
$ms1="【天仙之恋の婚链】";
$ms2="〖金豆〗x500,红宝石六x500,黄宝石六x500,蓝宝石六x500,玄武石六x500,夫妻声望200万,天宫声望100万,乌鸡国声望100万,宝象国声望100万,银两100亿";
$ms3=616;


} elseif($wpidd ==588){
$ms1="【天尊之恋の婚戒】（典藏版）";
$ms2="〖七夕令〗x2";
$ms3=617;

} elseif($wpidd ==589){
$ms1="【天尊之恋の婚链】（典藏版）";
$ms2="〖七夕令〗x2,";
$ms3=618;

} elseif($wpidd ==592){
$ms1="【天尊の披风】";
$ms2="〖金豆〗x500,〖祥云残片〗x500,〖大圣仙魄〗x500,西游声望300万,银两300亿";
$ms3=619;




} elseif($wpidd ==621){
$ms1="【小天使の神翼】";
$ms2="〖时装碎片〗x200,〖时装契约〗x200,西游声望200万,〖时装凭证〗x2,银两200亿";
$ms3=631;
} elseif($wpidd ==622){
$ms1="【小天使の神杖】";
$ms2="〖时装碎片〗x200,〖时装契约〗x200,西游声望200万,〖时装凭证〗x2,银两200亿";
$ms3=632;
} elseif($wpidd ==623){
$ms1="【小天使の神盾】";
$ms2="〖时装碎片〗x200,〖时装契约〗x200,西游声望200万,〖时装凭证〗x2,银两200亿";
$ms3=633;
} elseif($wpidd ==624){
$ms1="【小天使の神镜】";
$ms2="〖时装碎片〗x200,〖时装契约〗x200,西游声望200万,〖时装凭证〗x2,银两200亿";
$ms3=634;
} elseif($wpidd ==625){
$ms1="【小天使の神服】";
$ms2="〖时装碎片〗x200,〖时装契约〗x200,西游声望200万,〖时装凭证〗x2,银两200亿";
$ms3=635;
} elseif($wpidd ==626){
$ms1="【小天使の神靴】";
$ms2="〖时装碎片〗x200,〖时装契约〗x200,西游声望200万,〖时装凭证〗x2,银两200亿";
$ms3=636;
} elseif($wpidd ==627){
$ms1="【小天使の神戒】";
$ms2="〖时装碎片〗x200,〖时装契约〗x200,西游声望200万,〖时装凭证〗x2,银两200亿";
$ms3=637;
} elseif($wpidd ==628){
$ms1="【小天使の神链】";
$ms2="〖时装碎片〗x200,〖时装契约〗x200,西游声望200万,〖时装凭证〗x2,银两200亿";
$ms3=638;
} elseif($wpidd ==629){
$ms1="【小天使の神袍】";
$ms2="〖时装碎片〗x200,〖时装契约〗x200,西游声望200万,〖时装凭证〗x2,银两200亿";
$ms3=639;
} elseif($wpidd ==630){
$ms1="【小天使の烈火灼魂】";
$ms2="〖时装碎片〗x200,〖时装契约〗x200,西游声望200万,〖时装凭证〗x2,银两200亿";
$ms3=640;


} elseif($wpidd ==631){
$ms1="【黑骑士の火翼】";
$ms2="〖时装碎片〗x300,〖时装契约〗x300,西游声望300万,〖时装凭证〗x3,银两300亿";
$ms3=641;
} elseif($wpidd ==632){
$ms1="【黑骑士の火杖】";
$ms2="〖时装碎片〗x300,〖时装契约〗x300,西游声望300万,〖时装凭证〗x3,银两300亿";
$ms3=642;
} elseif($wpidd ==633){
$ms1="【黑骑士の火盾】";
$ms2="〖时装碎片〗x300,〖时装契约〗x300,西游声望300万,〖时装凭证〗x3,银两300亿";
$ms3=643;
} elseif($wpidd ==634){
$ms1="【黑骑士の火镜】";
$ms2="〖时装碎片〗x300,〖时装契约〗x300,西游声望300万,〖时装凭证〗x3,银两300亿";
$ms3=644;
} elseif($wpidd ==635){
$ms1="【黑骑士の火服】";
$ms2="〖时装碎片〗x300,〖时装契约〗x300,西游声望300万,〖时装凭证〗x3,银两300亿";
$ms3=645;
} elseif($wpidd ==636){
$ms1="【黑骑士の火靴】";
$ms2="〖时装碎片〗x300,〖时装契约〗x300,西游声望300万,〖时装凭证〗x3,银两300亿";
$ms3=646;
} elseif($wpidd ==637){
$ms1="【黑骑士の火戒】";
$ms2="〖时装碎片〗x300,〖时装契约〗x300,西游声望300万,〖时装凭证〗x3,银两300亿";
$ms3=647;
} elseif($wpidd ==638){
$ms1="【黑骑士の火链】";
$ms2="〖时装碎片〗x300,〖时装契约〗x300,西游声望300万,〖时装凭证〗x3,银两300亿";
$ms3=648;
} elseif($wpidd ==639){
$ms1="【黑骑士の火袍】";
$ms2="〖时装碎片〗x300,〖时装契约〗x300,西游声望300万,〖时装凭证〗x3,银两300亿";
$ms3=649;
} elseif($wpidd ==640){
$ms1="【黑骑士の三角勋章】";
$ms2="〖时装碎片〗x300,〖时装契约〗x300,西游声望300万,〖时装凭证〗x3,银两300亿";
$ms3=650;



} elseif($wpidd ==641){
$ms1="【猎天使の天灵羽】";
$ms2="〖时装碎片〗x400,〖时装契约〗x400,西游声望400万,〖时装凭证〗x4,银两400亿";
$ms3=651;
} elseif($wpidd ==642){
$ms1="【猎天使の天灵镰】";
$ms2="〖时装碎片〗x400,〖时装契约〗x400,西游声望400万,〖时装凭证〗x4,银两400亿";
$ms3=652;
} elseif($wpidd ==643){
$ms1="【猎天使の天灵盾】";
$ms2="〖时装碎片〗x400,〖时装契约〗x400,西游声望400万,〖时装凭证〗x4,银两400亿";
$ms3=653;
} elseif($wpidd ==644){
$ms1="【猎天使の天灵镜】";
$ms2="〖时装碎片〗x400,〖时装契约〗x400,西游声望400万,〖时装凭证〗x4,银两400亿";
$ms3=654;
} elseif($wpidd ==645){
$ms1="【猎天使の天灵服】";
$ms2="〖时装碎片〗x400,〖时装契约〗x400,西游声望400万,〖时装凭证〗x4,银两400亿";
$ms3=655;
} elseif($wpidd ==646){
$ms1="【猎天使の天灵靴】";
$ms2="〖时装碎片〗x400,〖时装契约〗x400,西游声望400万,〖时装凭证〗x4,银两400亿";
$ms3=656;
} elseif($wpidd ==647){
$ms1="【猎天使の天灵戒】";
$ms2="〖时装碎片〗x400,〖时装契约〗x400,西游声望400万,〖时装凭证〗x4,银两400亿";
$ms3=657;
} elseif($wpidd ==648){
$ms1="【猎天使の天灵链】";
$ms2="〖时装碎片〗x400,〖时装契约〗x400,西游声望400万,〖时装凭证〗x4,银两400亿";
$ms3=658;
} elseif($wpidd ==649){
$ms1="【猎天使の天灵袍】";
$ms2="〖时装碎片〗x400,〖时装契约〗x400,西游声望400万,〖时装凭证〗x4,银两400亿";
$ms3=659;
} elseif($wpidd ==650){
$ms1="【猎天使の星辰勋章】";
$ms2="〖时装碎片〗x400,〖时装契约〗x400,西游声望400万,〖时装凭证〗x4,银两400亿";
$ms3=660;



} elseif($wpidd ==651){
$ms1="【死神の星海翼】";
$ms2="〖时装碎片〗x500,〖时装契约〗x500,西游声望500万,〖时装凭证〗x5,银两500亿";
$ms3=661;
} elseif($wpidd ==652){
$ms1="【死神の星海镰】";
$ms2="〖时装碎片〗x500,〖时装契约〗x500,西游声望500万,〖时装凭证〗x5,银两500亿";
$ms3=662;
} elseif($wpidd ==653){
$ms1="【死神の星海盾】";
$ms2="〖时装碎片〗x500,〖时装契约〗x500,西游声望500万,〖时装凭证〗x5,银两500亿";
$ms3=663;
} elseif($wpidd ==654){
$ms1="【死神の星海镜】";
$ms2="〖时装碎片〗x500,〖时装契约〗x500,西游声望500万,〖时装凭证〗x5,银两500亿";
$ms3=664;
} elseif($wpidd ==655){
$ms1="【死神の星海服】";
$ms2="〖时装碎片〗x500,〖时装契约〗x500,西游声望500万,〖时装凭证〗x5,银两500亿";
$ms3=665;
} elseif($wpidd ==656){
$ms1="【死神の星海靴】";
$ms2="〖时装碎片〗x500,〖时装契约〗x500,西游声望500万,〖时装凭证〗x5,银两500亿";
$ms3=666;
} elseif($wpidd ==657){
$ms1="【死神の星海戒】";
$ms2="〖时装碎片〗x500,〖时装契约〗x500,西游声望500万,〖时装凭证〗x5,银两500亿";
$ms3=667;
} elseif($wpidd ==658){
$ms1="【死神の星海链】";
$ms2="〖时装碎片〗x500,〖时装契约〗x500,西游声望500万,〖时装凭证〗x5,银两500亿";
$ms3=668;
} elseif($wpidd ==659){
$ms1="【死神の星海袍】";
$ms2="〖时装碎片〗x500,〖时装契约〗x500,西游声望500万,〖时装凭证〗x5,银两500亿";
$ms3=669;
} elseif($wpidd ==660){
$ms1="【死神の无尽勋章】";
$ms2="〖时装碎片〗x500,〖时装契约〗x500,西游声望500万,〖时装凭证〗x5,银两500亿";
$ms3=670;


} elseif($wpidd ==593){
$ms1="【仙尊甲】";
$ms2="〖仙佑石〗x500,〖仙晶砂〗x500,〖仙器魂〗x500,〖金豆〗x500,西游声望500万,银两500亿";
$ms3=671;
} elseif($wpidd ==594){
$ms1="【仙尊盔】";
$ms2="〖仙佑石〗x500,〖仙晶砂〗x500,〖仙器魂〗x500,〖金豆〗x500,西游声望500万,银两500亿";
$ms3=672;
} elseif($wpidd ==595){
$ms1="【仙尊靴】";
$ms2="〖仙佑石〗x500,〖仙晶砂〗x500,〖仙器魂〗x500,〖金豆〗x500,西游声望500万,银两500亿";
$ms3=673;
} elseif($wpidd ==596){
$ms1="【仙尊链】";
$ms2="〖仙佑石〗x500,〖仙晶砂〗x500,〖仙器魂〗x500,〖金豆〗x500,西游声望500万,银两500亿";
$ms3=674;
} elseif($wpidd ==597){
$ms1="【仙尊镯】";
$ms2="〖仙佑石〗x500,〖仙晶砂〗x500,〖仙器魂〗x500,〖金豆〗x500,西游声望500万,银两500亿";
$ms3=675;
} elseif($wpidd ==598){
$ms1="【仙尊枪】";
$ms2="〖仙佑石〗x500,〖仙晶砂〗x500,〖仙器魂〗x500,〖金豆〗x500,西游声望500万,银两500亿";
$ms3=676;
} elseif($wpidd ==599){
$ms1="【仙尊叉】";
$ms2="〖仙佑石〗x500,〖仙晶砂〗x500,〖仙器魂〗x500,〖金豆〗x500,西游声望500万,银两500亿";
$ms3=677;
} elseif($wpidd ==600){
$ms1="【仙尊棍】";
$ms2="〖仙佑石〗x500,〖仙晶砂〗x500,〖仙器魂〗x500,〖金豆〗x500,西游声望500万,银两500亿";
$ms3=678;
} elseif($wpidd ==601){
$ms1="【仙尊杖】";
$ms2="〖仙佑石〗x500,〖仙晶砂〗x500,〖仙器魂〗x500,〖金豆〗x500,西游声望500万,银两500亿";
$ms3=679;
} elseif($wpidd ==602){
$ms1="【仙尊剑】";
$ms2="〖仙佑石〗x500,〖仙晶砂〗x500,〖仙器魂〗x500,〖金豆〗x500,西游声望500万,银两500亿";
$ms3=680;
} elseif($wpidd ==671){
$ms1="【神尊甲】";
$ms2="〖神佑石〗x500,〖神晶砂〗x500,〖神器魂〗x500,〖金豆〗x600,〖紫星币〗x10,西游声望600万,银两500亿";
$ms3=681;
} elseif($wpidd ==672){
$ms1="【神尊盔】";
$ms2="〖神佑石〗x500,〖神晶砂〗x500,〖神器魂〗x500,〖金豆〗x600,〖紫星币〗x10,西游声望600万,银两500亿";
$ms3=682;
} elseif($wpidd ==673){
$ms1="【神尊靴】";
$ms2="〖神佑石〗x500,〖神晶砂〗x500,〖神器魂〗x500,〖金豆〗x600,〖紫星币〗x10,西游声望600万,银两500亿";
$ms3=683;
} elseif($wpidd ==674){
$ms1="【神尊链】";
$ms2="〖神佑石〗x500,〖神晶砂〗x500,〖神器魂〗x500,〖金豆〗x600,〖紫星币〗x10,西游声望600万,银两500亿";
$ms3=684;
} elseif($wpidd ==675){
$ms1="【神尊镯】";
$ms2="〖神佑石〗x500,〖神晶砂〗x500,〖神器魂〗x500,〖金豆〗x600,〖紫星币〗x10,西游声望600万,银两500亿";
$ms3=685;
} elseif($wpidd ==676){
$ms1="【神尊枪】";
$ms2="〖神佑石〗x500,〖神晶砂〗x500,〖神器魂〗x500,〖金豆〗x600,〖紫星币〗x10,西游声望600万,银两500亿";
$ms3=686;
} elseif($wpidd ==677){
$ms1="【神尊叉】";
$ms2="〖神佑石〗x500,〖神晶砂〗x500,〖神器魂〗x500,〖金豆〗x600,〖紫星币〗x10,西游声望600万,银两500亿";
$ms3=687;
} elseif($wpidd ==678){
$ms1="【神尊棍】";
$ms2="〖神佑石〗x500,〖神晶砂〗x500,〖神器魂〗x500,〖金豆〗x600,〖紫星币〗x10,西游声望600万,银两500亿";
$ms3=688;
} elseif($wpidd ==679){
$ms1="【神尊杖】";
$ms2="〖神佑石〗x500,〖神晶砂〗x500,〖神器魂〗x500,〖金豆〗x600,〖紫星币〗x10,西游声望600万,银两500亿";
$ms3=689;
} elseif($wpidd ==680){
$ms1="【神尊剑】";
$ms2="〖神佑石〗x500,〖神晶砂〗x500,〖神器魂〗x500,〖金豆〗x600,〖紫星币〗x10,西游声望600万,银两500亿";
$ms3=690;
} elseif($wpidd ==681){
$ms1="【圣尊甲】";
$ms2="〖圣佑石〗x500,〖圣晶砂〗x500,〖圣器魂〗x500,〖金豆〗x800,〖紫星币〗x20,西游声望800万,银两500亿";
$ms3=691;
} elseif($wpidd ==682){
$ms1="【圣尊盔】";
$ms2="〖圣佑石〗x500,〖圣晶砂〗x500,〖圣器魂〗x500,〖金豆〗x800,〖紫星币〗x20,西游声望800万,银两500亿";
$ms3=692;
} elseif($wpidd ==683){
$ms1="【圣尊靴】";
$ms2="〖圣佑石〗x500,〖圣晶砂〗x500,〖圣器魂〗x500,〖金豆〗x800,〖紫星币〗x20,西游声望800万,银两500亿";
$ms3=693;
} elseif($wpidd ==684){
$ms1="【圣尊链】";
$ms2="〖圣佑石〗x500,〖圣晶砂〗x500,〖圣器魂〗x500,〖金豆〗x800,〖紫星币〗x20,西游声望800万,银两500亿";
$ms3=694;
} elseif($wpidd ==685){
$ms1="【圣尊镯】";
$ms2="〖圣佑石〗x500,〖圣晶砂〗x500,〖圣器魂〗x500,〖金豆〗x800,〖紫星币〗x20,西游声望800万,银两500亿";
$ms3=695;
} elseif($wpidd ==686){
$ms1="【圣尊枪】";
$ms2="〖圣佑石〗x500,〖圣晶砂〗x500,〖圣器魂〗x500,〖金豆〗x800,〖紫星币〗x20,西游声望800万,银两500亿";
$ms3=696;
} elseif($wpidd ==687){
$ms1="【圣尊叉】";
$ms2="〖圣佑石〗x500,〖圣晶砂〗x500,〖圣器魂〗x500,〖金豆〗x800,〖紫星币〗x20,西游声望800万,银两500亿";
$ms3=697;
} elseif($wpidd ==688){
$ms1="【圣尊棍】";
$ms2="〖圣佑石〗x500,〖圣晶砂〗x500,〖圣器魂〗x500,〖金豆〗x800,〖紫星币〗x20,西游声望800万,银两500亿";
$ms3=698;
} elseif($wpidd ==689){
$ms1="【圣尊杖】";
$ms2="〖圣佑石〗x500,〖圣晶砂〗x500,〖圣器魂〗x500,〖金豆〗x800,〖紫星币〗x20,西游声望800万,银两500亿";
$ms3=699;
} elseif($wpidd ==690){
$ms1="【圣尊剑】";
$ms2="〖圣佑石〗x500,〖圣晶砂〗x500,〖圣器魂〗x500,〖金豆〗x800,〖紫星币〗x20,西游声望800万,银两500亿";
$ms3=700;


} elseif($wpidd ==691){
$ms1="【混沌天尊甲】";
$ms2="〖混沌天佑石〗x500,〖混沌天晶砂〗x500,〖混沌天器魂〗x500,〖金豆〗x1100,〖紫星币〗x30,西游声望1100万,银两550亿";
$ms3=701;
} elseif($wpidd ==692){
$ms1="【混沌天尊盔】";
$ms2="〖混沌天佑石〗x500,〖混沌天晶砂〗x500,〖混沌天器魂〗x500,〖金豆〗x1100,〖紫星币〗x30,西游声望1100万,银两550亿";
$ms3=702;
} elseif($wpidd ==693){
$ms1="【混沌天尊靴】";
$ms2="〖混沌天佑石〗x500,〖混沌天晶砂〗x500,〖混沌天器魂〗x500,〖金豆〗x1100,〖紫星币〗x30,西游声望1100万,银两550亿";
$ms3=703;
} elseif($wpidd ==694){
$ms1="【混沌天尊链】";
$ms2="〖混沌天佑石〗x500,〖混沌天晶砂〗x500,〖混沌天器魂〗x500,〖金豆〗x1100,〖紫星币〗x30,西游声望1100万,银两550亿";
$ms3=704;
} elseif($wpidd ==695){
$ms1="【混沌天尊镯】";
$ms2="〖混沌天佑石〗x500,〖混沌天晶砂〗x500,〖混沌天器魂〗x500,〖金豆〗x1100,〖紫星币〗x30,西游声望1100万,银两550亿";
$ms3=705;
} elseif($wpidd ==696){
$ms1="【混沌天尊枪】";
$ms2="〖混沌天佑石〗x500,〖混沌天晶砂〗x500,〖混沌天器魂〗x500,〖金豆〗x1100,〖紫星币〗x30,西游声望1100万,银两550亿";
$ms3=706;
} elseif($wpidd ==697){
$ms1="【混沌天尊叉】";
$ms2="〖混沌天佑石〗x500,〖混沌天晶砂〗x500,〖混沌天器魂〗x500,〖金豆〗x1100,〖紫星币〗x30,西游声望1100万,银两550亿";
$ms3=707;
} elseif($wpidd ==698){
$ms1="【混沌天尊棍】";
$ms2="〖混沌天佑石〗x500,〖混沌天晶砂〗x500,〖混沌天器魂〗x500,〖金豆〗x1100,〖紫星币〗x30,西游声望1100万,银两550亿";
$ms3=708;
} elseif($wpidd ==699){
$ms1="【混沌天尊杖】";
$ms2="〖混沌天佑石〗x500,〖混沌天晶砂〗x500,〖混沌天器魂〗x500,〖金豆〗x1100,〖紫星币〗x30,西游声望1100万,银两550亿";
$ms3=709;
} elseif($wpidd ==700){
$ms1="【混沌天尊剑】";
$ms2="〖混沌天佑石〗x500,〖混沌天晶砂〗x500,〖混沌天器魂〗x500,〖金豆〗x1100,〖紫星币〗x30,西游声望1100万,银两550亿";
$ms3=710;

} elseif($wpidd ==701){
$ms1="【混沌神尊甲】";
$ms2="〖混沌神佑石〗x500,〖混沌神晶砂〗x500,〖混沌神器魂〗x500,〖金豆〗x1500,〖紫星币〗x50,西游声望1500万,银两600亿";
$ms3=711;
} elseif($wpidd ==702){
$ms1="【混沌神尊盔】";
$ms2="〖混沌神佑石〗x500,〖混沌神晶砂〗x500,〖混沌神器魂〗x500,〖金豆〗x1500,〖紫星币〗x50,西游声望1500万,银两600亿";
$ms3=712;
} elseif($wpidd ==703){
$ms1="【混沌神尊靴】";
$ms2="〖混沌神佑石〗x500,〖混沌神晶砂〗x500,〖混沌神器魂〗x500,〖金豆〗x1500,〖紫星币〗x50,西游声望1500万,银两600亿";
$ms3=713;
} elseif($wpidd ==704){
$ms1="【混沌神尊链】";
$ms2="〖混沌神佑石〗x500,〖混沌神晶砂〗x500,〖混沌神器魂〗x500,〖金豆〗x1500,〖紫星币〗x50,西游声望1500万,银两600亿";
$ms3=714;
} elseif($wpidd ==705){
$ms1="【混沌神尊镯】";
$ms2="〖混沌神佑石〗x500,〖混沌神晶砂〗x500,〖混沌神器魂〗x500,〖金豆〗x1500,〖紫星币〗x50,西游声望1500万,银两600亿";
$ms3=715;
} elseif($wpidd ==706){
$ms1="【混沌神尊枪】";
$ms2="〖混沌神佑石〗x500,〖混沌神晶砂〗x500,〖混沌神器魂〗x500,〖金豆〗x1500,〖紫星币〗x50,西游声望1500万,银两600亿";
$ms3=716;
} elseif($wpidd ==707){
$ms1="【混沌神尊叉】";
$ms2="〖混沌神佑石〗x500,〖混沌神晶砂〗x500,〖混沌神器魂〗x500,〖金豆〗x1500,〖紫星币〗x50,西游声望1500万,银两600亿";
$ms3=717;
} elseif($wpidd ==708){
$ms1="【混沌神尊棍】";
$ms2="〖混沌神佑石〗x500,〖混沌神晶砂〗x500,〖混沌神器魂〗x500,〖金豆〗x1500,〖紫星币〗x50,西游声望1500万,银两600亿";
$ms3=718;
} elseif($wpidd ==709){
$ms1="【混沌神尊杖】";
$ms2="〖混沌神佑石〗x500,〖混沌神晶砂〗x500,〖混沌神器魂〗x500,〖金豆〗x1500,〖紫星币〗x50,西游声望1500万,银两600亿";
$ms3=719;
} elseif($wpidd ==710){
$ms1="【混沌神尊剑】";
$ms2="〖混沌神佑石〗x500,〖混沌神晶砂〗x500,〖混沌神器魂〗x500,〖金豆〗x1500,〖紫星币〗x50,西游声望1500万,银两600亿";
$ms3=720;
} elseif($wpidd ==711){
$ms1="【混沌圣尊甲】";
$ms2="〖混沌圣佑石〗x500,〖混沌圣晶砂〗x500,〖混沌圣器魂〗x500,〖金豆〗x2000,〖紫星币〗x60,西游声望2000万,银两650亿";
$ms3=721;
} elseif($wpidd ==712){
$ms1="【混沌圣尊盔】";
$ms2="〖混沌圣佑石〗x500,〖混沌圣晶砂〗x500,〖混沌圣器魂〗x500,〖金豆〗x2000,〖紫星币〗x60,西游声望2000万,银两650亿";
$ms3=722;
} elseif($wpidd ==713){
$ms1="【混沌圣尊靴】";
$ms2="〖混沌圣佑石〗x500,〖混沌圣晶砂〗x500,〖混沌圣器魂〗x500,〖金豆〗x2000,〖紫星币〗x60,西游声望2000万,银两650亿";
$ms3=723;
} elseif($wpidd ==714){
$ms1="【混沌圣尊链】";
$ms2="〖混沌圣佑石〗x500,〖混沌圣晶砂〗x500,〖混沌圣器魂〗x500,〖金豆〗x2000,〖紫星币〗x60,西游声望2000万,银两650亿";
$ms3=724;
} elseif($wpidd ==715){
$ms1="【混沌圣尊镯】";
$ms2="〖混沌圣佑石〗x500,〖混沌圣晶砂〗x500,〖混沌圣器魂〗x500,〖金豆〗x2000,〖紫星币〗x60,西游声望2000万,银两650亿";
$ms3=725;
} elseif($wpidd ==716){
$ms1="【混沌圣尊枪】";
$ms2="〖混沌圣佑石〗x500,〖混沌圣晶砂〗x500,〖混沌圣器魂〗x500,〖金豆〗x2000,〖紫星币〗x60,西游声望2000万,银两650亿";
$ms3=726;
} elseif($wpidd ==717){
$ms1="【混沌圣尊叉】";
$ms2="〖混沌圣佑石〗x500,〖混沌圣晶砂〗x500,〖混沌圣器魂〗x500,〖金豆〗x2000,〖紫星币〗x60,西游声望2000万,银两650亿";
$ms3=727;
} elseif($wpidd ==718){
$ms1="【混沌圣尊棍】";
$ms2="〖混沌圣佑石〗x500,〖混沌圣晶砂〗x500,〖混沌圣器魂〗x500,〖金豆〗x2000,〖紫星币〗x60,西游声望2000万,银两650亿";
$ms3=728;
} elseif($wpidd ==719){
$ms1="【混沌圣尊杖】";
$ms2="〖混沌圣佑石〗x500,〖混沌圣晶砂〗x500,〖混沌圣器魂〗x500,〖金豆〗x2000,〖紫星币〗x60,西游声望2000万,银两650亿";
$ms3=729;
} elseif($wpidd ==720){
$ms1="【混沌圣尊剑】";
$ms2="〖混沌圣佑石〗x500,〖混沌圣晶砂〗x500,〖混沌圣器魂〗x500,〖金豆〗x2000,〖紫星币〗x60,西游声望2000万,银两650亿";
$ms3=730;


} elseif($wpidd ==721){
$ms1="【鸿蒙天尊甲】";
$ms2="〖鸿蒙天佑石〗x500,〖鸿蒙天晶砂〗x500,〖鸿蒙天器魂〗x500,〖金豆〗x2600,〖紫星币〗x70,西游声望2500万,银两700亿";
$ms3=731;
} elseif($wpidd ==722){
$ms1="【鸿蒙天尊盔】";
$ms2="〖鸿蒙天佑石〗x500,〖鸿蒙天晶砂〗x500,〖鸿蒙天器魂〗x500,〖金豆〗x2600,〖紫星币〗x70,西游声望2500万,银两700亿";
$ms3=732;
} elseif($wpidd ==723){
$ms1="【鸿蒙天尊靴】";
$ms2="〖鸿蒙天佑石〗x500,〖鸿蒙天晶砂〗x500,〖鸿蒙天器魂〗x500,〖金豆〗x2600,〖紫星币〗x70,西游声望2500万,银两700亿";
$ms3=733;
} elseif($wpidd ==724){
$ms1="【鸿蒙天尊链】";
$ms2="〖鸿蒙天佑石〗x500,〖鸿蒙天晶砂〗x500,〖鸿蒙天器魂〗x500,〖金豆〗x2600,〖紫星币〗x70,西游声望2500万,银两700亿";
$ms3=734;
} elseif($wpidd ==725){
$ms1="【鸿蒙天尊镯】";
$ms2="〖鸿蒙天佑石〗x500,〖鸿蒙天晶砂〗x500,〖鸿蒙天器魂〗x500,〖金豆〗x2600,〖紫星币〗x70,西游声望2500万,银两700亿";
$ms3=735;
} elseif($wpidd ==726){
$ms1="【鸿蒙天尊枪】";
$ms2="〖鸿蒙天佑石〗x500,〖鸿蒙天晶砂〗x500,〖鸿蒙天器魂〗x500,〖金豆〗x2600,〖紫星币〗x70,西游声望2500万,银两700亿";
$ms3=736;
} elseif($wpidd ==727){
$ms1="【鸿蒙天尊叉】";
$ms2="〖鸿蒙天佑石〗x500,〖鸿蒙天晶砂〗x500,〖鸿蒙天器魂〗x500,〖金豆〗x2600,〖紫星币〗x70,西游声望2500万,银两700亿";
$ms3=737;
} elseif($wpidd ==728){
$ms1="【鸿蒙天尊棍】";
$ms2="〖鸿蒙天佑石〗x500,〖鸿蒙天晶砂〗x500,〖鸿蒙天器魂〗x500,〖金豆〗x2600,〖紫星币〗x70,西游声望2500万,银两700亿";
$ms3=738;
} elseif($wpidd ==729){
$ms1="【鸿蒙天尊杖】";
$ms2="〖鸿蒙天佑石〗x500,〖鸿蒙天晶砂〗x500,〖鸿蒙天器魂〗x500,〖金豆〗x2600,〖紫星币〗x70,西游声望2500万,银两700亿";
$ms3=739;
} elseif($wpidd ==730){
$ms1="【鸿蒙天尊剑】";
$ms2="〖鸿蒙天佑石〗x500,〖鸿蒙天晶砂〗x500,〖鸿蒙天器魂〗x500,〖金豆〗x2600,〖紫星币〗x70,西游声望2500万,银两700亿";
$ms3=740;

} elseif($wpidd ==731){
$ms1="【鸿蒙神尊甲】";
$ms2="〖鸿蒙神佑石〗x500,〖鸿蒙神晶砂〗x500,〖鸿蒙神器魂〗x500,〖金豆〗x3300,〖紫星币〗x80,西游声望3000万,银两750亿";
$ms3=741;
} elseif($wpidd ==732){
$ms1="【鸿蒙神尊盔】";
$ms2="〖鸿蒙神佑石〗x500,〖鸿蒙神晶砂〗x500,〖鸿蒙神器魂〗x500,〖金豆〗x3300,〖紫星币〗x80,西游声望3000万,银两750亿";
$ms3=742;
} elseif($wpidd ==733){
$ms1="【鸿蒙神尊靴】";
$ms2="〖鸿蒙神佑石〗x500,〖鸿蒙神晶砂〗x500,〖鸿蒙神器魂〗x500,〖金豆〗x3300,〖紫星币〗x80,西游声望3000万,银两750亿";
$ms3=743;
} elseif($wpidd ==734){
$ms1="【鸿蒙神尊链】";
$ms2="〖鸿蒙神佑石〗x500,〖鸿蒙神晶砂〗x500,〖鸿蒙神器魂〗x500,〖金豆〗x3300,〖紫星币〗x80,西游声望3000万,银两750亿";
$ms3=744;
} elseif($wpidd ==735){
$ms1="【鸿蒙神尊镯】";
$ms2="〖鸿蒙神佑石〗x500,〖鸿蒙神晶砂〗x500,〖鸿蒙神器魂〗x500,〖金豆〗x3300,〖紫星币〗x80,西游声望3000万,银两750亿";
$ms3=745;
} elseif($wpidd ==736){
$ms1="【鸿蒙神尊枪】";
$ms2="〖鸿蒙神佑石〗x500,〖鸿蒙神晶砂〗x500,〖鸿蒙神器魂〗x500,〖金豆〗x3300,〖紫星币〗x80,西游声望3000万,银两750亿";
$ms3=746;
} elseif($wpidd ==737){
$ms1="【鸿蒙神尊叉】";
$ms2="〖鸿蒙神佑石〗x500,〖鸿蒙神晶砂〗x500,〖鸿蒙神器魂〗x500,〖金豆〗x3300,〖紫星币〗x80,西游声望3000万,银两750亿";
$ms3=747;
} elseif($wpidd ==738){
$ms1="【鸿蒙神尊棍】";
$ms2="〖鸿蒙神佑石〗x500,〖鸿蒙神晶砂〗x500,〖鸿蒙神器魂〗x500,〖金豆〗x3300,〖紫星币〗x80,西游声望3000万,银两750亿";
$ms3=748;
} elseif($wpidd ==739){
$ms1="【鸿蒙神尊杖】";
$ms2="〖鸿蒙神佑石〗x500,〖鸿蒙神晶砂〗x500,〖鸿蒙神器魂〗x500,〖金豆〗x3300,〖紫星币〗x80,西游声望3000万,银两750亿";
$ms3=749;
} elseif($wpidd ==740){
$ms1="【鸿蒙神尊剑】";
$ms2="〖鸿蒙神佑石〗x500,〖鸿蒙神晶砂〗x500,〖鸿蒙神器魂〗x500,〖金豆〗x3300,〖紫星币〗x80,西游声望3000万,银两750亿";
$ms3=750;


} elseif($wpidd ==741){
$ms1="【鸿蒙圣尊甲】";
$ms2="〖鸿蒙圣佑石〗x500,〖鸿蒙圣晶砂〗x500,〖鸿蒙圣器魂〗x500,〖金豆〗x4000,〖紫星币〗x100,西游声望4000万,银两800亿";
$ms3=751;
} elseif($wpidd ==742){
$ms1="【鸿蒙圣尊盔】";
$ms2="〖鸿蒙圣佑石〗x500,〖鸿蒙圣晶砂〗x500,〖鸿蒙圣器魂〗x500,〖金豆〗x4000,〖紫星币〗x100,西游声望4000万,银两800亿";
$ms3=752;
} elseif($wpidd ==743){
$ms1="【鸿蒙圣尊靴】";
$ms2="〖鸿蒙圣佑石〗x500,〖鸿蒙圣晶砂〗x500,〖鸿蒙圣器魂〗x500,〖金豆〗x4000,〖紫星币〗x100,西游声望4000万,银两800亿";
$ms3=753;
} elseif($wpidd ==744){
$ms1="【鸿蒙圣尊链】";
$ms2="〖鸿蒙圣佑石〗x500,〖鸿蒙圣晶砂〗x500,〖鸿蒙圣器魂〗x500,〖金豆〗x4000,〖紫星币〗x100,西游声望4000万,银两800亿";
$ms3=754;
} elseif($wpidd ==745){
$ms1="【鸿蒙圣尊镯】";
$ms2="〖鸿蒙圣佑石〗x500,〖鸿蒙圣晶砂〗x500,〖鸿蒙圣器魂〗x500,〖金豆〗x4000,〖紫星币〗x100,西游声望4000万,银两800亿";
$ms3=755;
} elseif($wpidd ==746){
$ms1="【鸿蒙圣尊枪】";
$ms2="〖鸿蒙圣佑石〗x500,〖鸿蒙圣晶砂〗x500,〖鸿蒙圣器魂〗x500,〖金豆〗x4000,〖紫星币〗x100,西游声望4000万,银两800亿";
$ms3=756;
} elseif($wpidd ==747){
$ms1="【鸿蒙圣尊叉】";
$ms2="〖鸿蒙圣佑石〗x500,〖鸿蒙圣晶砂〗x500,〖鸿蒙圣器魂〗x500,〖金豆〗x4000,〖紫星币〗x100,西游声望4000万,银两800亿";
$ms3=757;
} elseif($wpidd ==748){
$ms1="【鸿蒙圣尊棍】";
$ms2="〖鸿蒙圣佑石〗x500,〖鸿蒙圣晶砂〗x500,〖鸿蒙圣器魂〗x500,〖金豆〗x4000,〖紫星币〗x100,西游声望4000万,银两800亿";
$ms3=758;
} elseif($wpidd ==749){
$ms1="【鸿蒙圣尊杖】";
$ms2="〖鸿蒙圣佑石〗x500,〖鸿蒙圣晶砂〗x500,〖鸿蒙圣器魂〗x500,〖金豆〗x4000,〖紫星币〗x100,西游声望4000万,银两800亿";
$ms3=759;
} elseif($wpidd ==750){
$ms1="【鸿蒙圣尊剑】";
$ms2="〖鸿蒙圣佑石〗x500,〖鸿蒙圣晶砂〗x500,〖鸿蒙圣器魂〗x500,〖金豆〗x4000,〖紫星币〗x100,西游声望4000万,银两800亿";
$ms3=760;






} else{
$ms1="暂时无法升级";
$ms2="暂时无法升级";

}




?>




