<?php
if($npcc==201){//〖小生命丹〗
//---------------------------------------------------------//
$wwpmz="〖小生命丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=100;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==203){

//---------------------------------------------------------//
$wwpmz="〖中生命丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 //
//---------------------------------------------------------//



} elseif($npcc ==204){

//---------------------------------------------------------//
$wwpmz="〖大生命丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==205){

//---------------------------------------------------------//
$wwpmz="〖小积分丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==206){

//---------------------------------------------------------//
$wwpmz="〖积分体力丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==207){

//---------------------------------------------------------//
$wwpmz="〖积分中生命丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=300;          //设置限制使用得到值              

 //
//---------------------------------------------------------//
} elseif($npcc ==208){

//---------------------------------------------------------//
$wwpmz="〖积分大生命丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==209){

//---------------------------------------------------------//
$wwpmz="〖积分超级体力丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//
} elseif($npcc ==210){

//---------------------------------------------------------//
$wwpmz="〖神秘体力丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==211){

//---------------------------------------------------------//
$wwpmz="〖冰火丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=100;          //设置限制使用得到值              

 //
//---------------------------------------------------------//
} elseif($npcc ==212){

//---------------------------------------------------------//
$wwpmz="〖鬼面丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=100;          //设置限制使用得到值              

 //
//---------------------------------------------------------//
} elseif($npcc ==213){

//---------------------------------------------------------//
$wwpmz="〖混世丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=100;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==214){

//---------------------------------------------------------//
$wwpmz="〖金银丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==215){

//---------------------------------------------------------//
$wwpmz="〖金兜丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==216){

//---------------------------------------------------------//
$wwpmz="〖魔牛丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==217){

//---------------------------------------------------------//
$wwpmz="〖凤仙丸〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=300;          //设置限制使用得到值              

 //
//---------------------------------------------------------//
} elseif($npcc ==218){

//---------------------------------------------------------//
$wwpmz="〖麒麟丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=100;          //设置限制使用得到值              

 //
//---------------------------------------------------------//
} elseif($npcc ==219){

//---------------------------------------------------------//
$wwpmz="〖玉华丸〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=300;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==220){

//---------------------------------------------------------//
$wwpmz="〖金平丸〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=300;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==221){

//---------------------------------------------------------//
$wwpmz="〖龙虎豹胎丸〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=100;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==222){

//---------------------------------------------------------//
$wwpmz="〖血河丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==223){

//---------------------------------------------------------//
$wwpmz="〖白巫丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==224){

//---------------------------------------------------------//
$wwpmz="〖玲珑丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==225){

//---------------------------------------------------------//
$wwpmz="〖朱紫丸〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=300;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==226){

//---------------------------------------------------------//
$wwpmz="〖比丘丸〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=100;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==227){

//---------------------------------------------------------//
$wwpmz="〖比丘丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==228){

//---------------------------------------------------------//
$wwpmz="〖天法丸〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==229){

//---------------------------------------------------------//
$wwpmz="〖天竺丸〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==230){

//---------------------------------------------------------//
$wwpmz="【公测生命丹】";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=300;          //设置限制使用得到值              

 //
//---------------------------------------------------------//



} elseif($npcc ==231){
//---------------------------------------------------------//
$wwpmz="【公测攻击丹】";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=120;          //设置限制使用得到值              

 //
//---------------------------------------------------------//
} elseif($npcc ==232){
//---------------------------------------------------------//
$wwpmz="【公测防御丹】";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=250;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==233){
//---------------------------------------------------------//
$wwpmz="【公测魔攻丹】";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=120;          //设置限制使用得到值              

 //
//---------------------------------------------------------//











} elseif($npcc ==532){
//---------------------------------------------------------//
$wwpmz="〖冰晶丹〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=120;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

//---------------------------------------------------------//

} elseif($npcc ==533){
//---------------------------------------------------------//
$wwpmz="〖花果丹〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=120;          //设置限制使用得到值              

 //
//---------------------------------------------------------//



//---------------------------------------------------------//
} elseif($npcc ==534){
//---------------------------------------------------------//
$wwpmz="〖瑶池丹〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//



} elseif($npcc ==535){

//---------------------------------------------------------//
$wwpmz="〖老君丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 //
//---------------------------------------------------------//






} elseif($npcc ==536){
//---------------------------------------------------------//
$wwpmz="〖金刚经〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=300;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

//---------------------------------------------------------//

} elseif($npcc ==537){
//---------------------------------------------------------//
$wwpmz="〖法华经〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=300;          //设置限制使用得到值              

 //
//---------------------------------------------------------//



//---------------------------------------------------------//
} elseif($npcc ==538){
//---------------------------------------------------------//
$wwpmz="〖地藏经〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 //
//---------------------------------------------------------//



} elseif($npcc ==539){

//---------------------------------------------------------//
$wwpmz="〖严华经〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//




} elseif($npcc ==540){
//---------------------------------------------------------//
$wwpmz="〖莲花金丹〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

//---------------------------------------------------------//

} elseif($npcc ==541){
//---------------------------------------------------------//
$wwpmz="〖黑龙金丹〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 //
//---------------------------------------------------------//








} elseif($npcc ==542){
//---------------------------------------------------------//
$wwpmz="〖修炼攻击仙丹〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=600;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

//---------------------------------------------------------//

} elseif($npcc ==543){
//---------------------------------------------------------//
$wwpmz="〖修炼魔攻仙丹〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=600;          //设置限制使用得到值              

 //
//---------------------------------------------------------//



//---------------------------------------------------------//
} elseif($npcc ==544){
//---------------------------------------------------------//
$wwpmz="〖修炼防御仙丹〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=600;          //设置限制使用得到值              

 //
//---------------------------------------------------------//



} elseif($npcc ==545){

//---------------------------------------------------------//
$wwpmz="〖修炼生命仙丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//





} elseif($npcc ==546){
//---------------------------------------------------------//
$wwpmz="〖攻之龙丹〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

//---------------------------------------------------------//

} elseif($npcc ==547){
//---------------------------------------------------------//
$wwpmz="〖魔之龙丹〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//



//---------------------------------------------------------//
} elseif($npcc ==548){
//---------------------------------------------------------//
$wwpmz="〖防之龙丹〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//



} elseif($npcc ==549){

//---------------------------------------------------------//
$wwpmz="〖血之龙丹〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=3000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//




} elseif($npcc ==745){

//---------------------------------------------------------//
$wwpmz="〖凤梨月饼〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==746){

//---------------------------------------------------------//
$wwpmz="〖玫瑰月饼〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1200;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==747){

//---------------------------------------------------------//
$wwpmz="〖莲蓉月饼〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1400;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==748){

//---------------------------------------------------------//
$wwpmz="〖椰蓉月饼〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1500;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==749){

//---------------------------------------------------------//
$wwpmz="〖蓝莓月饼〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1600;          //设置限制使用得到值              

 //
//---------------------------------------------------------//



} elseif($npcc ==750){

//---------------------------------------------------------//
$wwpmz="〖桂花月饼〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1800;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==751){

//---------------------------------------------------------//
$wwpmz="〖葡萄月饼〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=2000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==752){
//---------------------------------------------------------//
$wwpmz="〖五仁月饼〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 //

} elseif($npcc ==753){
//---------------------------------------------------------//
$wwpmz="〖双黄月饼〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=700;          //设置限制使用得到值              

 //
} elseif($npcc ==754){
//---------------------------------------------------------//
$wwpmz="〖冰皮月饼〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=900;          //设置限制使用得到值              

 //

} elseif($npcc ==755){
//---------------------------------------------------------//
$wwpmz="〖水果月饼〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=1100;          //设置限制使用得到值              

 //

} elseif($npcc ==756){
//---------------------------------------------------------//
$wwpmz="〖红豆沙月饼〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=1500;          //设置限制使用得到值              

 //

} elseif($npcc ==757){
//---------------------------------------------------------//
$wwpmz="〖黄金月饼〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 //

} elseif($npcc ==758){
//---------------------------------------------------------//
$wwpmz="〖云腿月饼〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=700;          //设置限制使用得到值              

 //
 
 } elseif($npcc ==759){
//---------------------------------------------------------//
$wwpmz="〖水蜜桃月饼〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=900;          //设置限制使用得到值              

 //
 
 
 
 
  } elseif($npcc ==760){
//---------------------------------------------------------//
$wwpmz="〖哈密瓜月饼〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=1100;          //设置限制使用得到值              

 //
 
   } elseif($npcc ==761){
//---------------------------------------------------------//
$wwpmz="〖草莓月饼〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=1500;          //设置限制使用得到值              

 //
 
 
 } elseif($npcc ==762){
//---------------------------------------------------------//
$wwpmz="〖鲜花月饼〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

  
 } elseif($npcc ==763){
//---------------------------------------------------------//
$wwpmz="〖七彩月饼〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=700;          //设置限制使用得到值              

  } elseif($npcc ==764){
//---------------------------------------------------------//
$wwpmz="〖榄仁烧鸡月饼〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=900;          //设置限制使用得到值              

   } elseif($npcc ==765){
//---------------------------------------------------------//
$wwpmz="〖奶油椰丝月饼〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=1100;          //设置限制使用得到值              

 
    } elseif($npcc ==766){
//---------------------------------------------------------//
$wwpmz="〖叉烧腊肠月饼〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=1500;          //设置限制使用得到值              

 
 
 
 
 

} elseif($npcc ==767){

//---------------------------------------------------------//
$wwpmz="〖嫦娥月饼〗（血）";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=6000;          //设置限制使用得到值        
 //
//---------------------------------------------------------//

//---------------------------------------------------------//


} elseif($npcc ==768){
//---------------------------------------------------------//
$wwpmz="〖嫦娥月饼〗（攻）";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=4000;          //设置限制使用得到值         



} elseif($npcc ==769){
//---------------------------------------------------------//
$wwpmz="〖嫦娥月饼〗（魔）";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=4000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


 
     } elseif($npcc ==770){
//---------------------------------------------------------//
$wwpmz="〖嫦娥月饼〗（防）";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=3000;          //设置限制使用得到值              

 
 
 } elseif($npcc ==868){
//---------------------------------------------------------//
$wwpmz="〖鲜果蛋糕〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值        
 //
//---------------------------------------------------------//
  } elseif($npcc ==869){
//---------------------------------------------------------//
$wwpmz="〖奶油蛋糕〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=700;          //设置限制使用得到值        
 //
//---------------------------------------------------------//
 
   } elseif($npcc ==870){
//---------------------------------------------------------//
$wwpmz="〖草莓蛋糕〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=900;          //设置限制使用得到值        
 //
//---------------------------------------------------------//
 
 
    } elseif($npcc ==871){
//---------------------------------------------------------//
$wwpmz="〖焦糖蛋糕〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1200;          //设置限制使用得到值        
 //
//---------------------------------------------------------//
 
 
} elseif($npcc ==872){
//---------------------------------------------------------//
$wwpmz="〖香椰子蛋糕〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1500;          //设置限制使用得到值        
 //
//---------------------------------------------------------//
 
 
 } elseif($npcc ==873){
//---------------------------------------------------------//
$wwpmz="〖曲奇饼干〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值         
 
  } elseif($npcc ==874){
//---------------------------------------------------------//
$wwpmz="〖蛋卷饼干〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=700;          //设置限制使用得到值         
 
  } elseif($npcc ==875){
//---------------------------------------------------------//
$wwpmz="〖夹心饼干〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=900;          //设置限制使用得到值         
 
 
  } elseif($npcc ==876){
//---------------------------------------------------------//
$wwpmz="〖芝麻饼干〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=1200;          //设置限制使用得到值         
 
 
  } elseif($npcc ==877){
//---------------------------------------------------------//
$wwpmz="〖杏仁饼干〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=1500;          //设置限制使用得到值         

} elseif($npcc ==878){
//---------------------------------------------------------//
$wwpmz="〖奶油面包〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

} elseif($npcc ==879){
//---------------------------------------------------------//
$wwpmz="〖奶香面包〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=700;          //设置限制使用得到值              

} elseif($npcc ==880){
//---------------------------------------------------------//
$wwpmz="〖抹茶面包〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=900;          //设置限制使用得到值              

} elseif($npcc ==881){
//---------------------------------------------------------//
$wwpmz="〖椰蓉面包〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=1200;          //设置限制使用得到值          


} elseif($npcc ==882){
//---------------------------------------------------------//
$wwpmz="〖毛毛虫面包〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=1500;          //设置限制使用得到值        

 } elseif($npcc ==883){
//---------------------------------------------------------//
$wwpmz="〖酥圈巧克力〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 } elseif($npcc ==884){
//---------------------------------------------------------//
$wwpmz="〖浓夫巧克力〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=700;          //设置限制使用得到值              

 } elseif($npcc ==885){
//---------------------------------------------------------//
$wwpmz="〖米雪巧克力〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=900;          //设置限制使用得到值              

 } elseif($npcc ==886){
//---------------------------------------------------------//
$wwpmz="〖乐荷巧克力〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=1200;          //设置限制使用得到值        

 } elseif($npcc ==887){
//---------------------------------------------------------//
$wwpmz="〖香雪巧克力〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=1500;          //设置限制使用得到值        



} elseif($npcc ==888){

//---------------------------------------------------------//
$wwpmz="〖麦乐堡蛋糕〗（血）";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值        
 //
//---------------------------------------------------------//

//---------------------------------------------------------//


} elseif($npcc ==889){
//---------------------------------------------------------//
$wwpmz="〖麦乐堡蛋糕〗（攻）";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值         



} elseif($npcc ==890){
//---------------------------------------------------------//
$wwpmz="〖麦乐堡蛋糕〗（魔）";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


 
     } elseif($npcc ==891){
//---------------------------------------------------------//
$wwpmz="〖麦乐堡蛋糕〗（防）";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值              




} elseif($npcc ==1012){

//---------------------------------------------------------//
$wwpmz="〖棒棒糖〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值        
 //
//---------------------------------------------------------//


} elseif($npcc ==1013){

//---------------------------------------------------------//
$wwpmz="〖杏仁糖〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=800;          //设置限制使用得到值        
 //
//---------------------------------------------------------//

} elseif($npcc ==1014){

//---------------------------------------------------------//
$wwpmz="〖米花糖〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值        
 //
//---------------------------------------------------------//

} elseif($npcc ==1015){

//---------------------------------------------------------//
$wwpmz="〖水果糖〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1300;          //设置限制使用得到值        
 //
//---------------------------------------------------------//


} elseif($npcc ==1016){
//---------------------------------------------------------//
$wwpmz="〖棉花糖〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值         

} elseif($npcc ==1017){
//---------------------------------------------------------//
$wwpmz="〖牛皮糖〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=700;          //设置限制使用得到值         

} elseif($npcc ==1018){
//---------------------------------------------------------//
$wwpmz="〖咖啡糖〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=900;          //设置限制使用得到值         

} elseif($npcc ==1019){
//---------------------------------------------------------//
$wwpmz="〖可乐糖〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=1200;          //设置限制使用得到值       


} elseif($npcc ==1020){
//---------------------------------------------------------//
$wwpmz="〖太妃糖〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

} elseif($npcc ==1021){
//---------------------------------------------------------//
$wwpmz="〖胡桃糖〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=700;          //设置限制使用得到值     

} elseif($npcc ==1022){
//---------------------------------------------------------//
$wwpmz="〖南瓜糖〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=900;          //设置限制使用得到值     


} elseif($npcc ==1023){
//---------------------------------------------------------//
$wwpmz="〖榴莲糖〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=1200;          //设置限制使用得到值     


     } elseif($npcc ==1024){
//---------------------------------------------------------//
$wwpmz="〖狮子糖〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

     } elseif($npcc ==1025){
//---------------------------------------------------------//
$wwpmz="〖绵羊糖〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=700;          //设置限制使用得到值     

     } elseif($npcc ==1026){
//---------------------------------------------------------//
$wwpmz="〖大象糖〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=900;          //设置限制使用得到值    

     } elseif($npcc ==1027){
//---------------------------------------------------------//
$wwpmz="〖老虎塘〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=1200;          //设置限制使用得到值    


} elseif($npcc ==1028){

//---------------------------------------------------------//
$wwpmz="〖甜蜜梅心棒〗";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值        
 //
//---------------------------------------------------------//

//---------------------------------------------------------//


} elseif($npcc ==1029){
//---------------------------------------------------------//
$wwpmz="〖云朵棉花糖〗";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值         



} elseif($npcc ==1030){
//---------------------------------------------------------//
$wwpmz="〖浪漫酒心糖〗";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


 
     } elseif($npcc ==1031){
//---------------------------------------------------------//
$wwpmz="〖大白兔奶糖〗";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值       



} elseif($npcc ==1065){

//---------------------------------------------------------//
$wwpmz="〖良品烤火鸡〗（血）";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值        
 //
//---------------------------------------------------------//

} elseif($npcc ==1066){

//---------------------------------------------------------//
$wwpmz="〖上品烤火鸡〗（血）";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=800;          //设置限制使用得到值        
 //
//---------------------------------------------------------//




} elseif($npcc ==1067){

//---------------------------------------------------------//
$wwpmz="〖精品烤火鸡〗（血）";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值        
 //
//---------------------------------------------------------//

} elseif($npcc ==1068){

//---------------------------------------------------------//
$wwpmz="〖极品烤火鸡〗（血）";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=1300;          //设置限制使用得到值        
 //
//---------------------------------------------------------//


} elseif($npcc ==1069){
//---------------------------------------------------------//
$wwpmz="〖良品烤火鸡〗（攻）";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值         

} elseif($npcc ==1070){
//---------------------------------------------------------//
$wwpmz="〖上品烤火鸡〗（攻）";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=800;          //设置限制使用得到值         

} elseif($npcc ==1071){
//---------------------------------------------------------//
$wwpmz="〖精品烤火鸡〗（攻）";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值         


} elseif($npcc ==1072){
//---------------------------------------------------------//
$wwpmz="〖极品烤火鸡〗（攻）";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=1300;          //设置限制使用得到值         

} elseif($npcc ==1073){
//---------------------------------------------------------//
$wwpmz="〖良品烤火鸡〗（魔）";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


} elseif($npcc ==1074){
//---------------------------------------------------------//
$wwpmz="〖上品烤火鸡〗（魔）";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=800;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==1075){
//---------------------------------------------------------//
$wwpmz="〖精品烤火鸡〗（魔）";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

} elseif($npcc ==1076){
//---------------------------------------------------------//
$wwpmz="〖极品烤火鸡〗（魔）";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=1300;          //设置限制使用得到值              

 //
//---------------------------------------------------------//

 } elseif($npcc ==1077){
//---------------------------------------------------------//
$wwpmz="〖良品烤火鸡〗（防）";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=500;          //设置限制使用得到值       

 } elseif($npcc ==1078){
//---------------------------------------------------------//
$wwpmz="〖上品烤火鸡〗（防）";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=800;          //设置限制使用得到值       

 } elseif($npcc ==1079){
//---------------------------------------------------------//
$wwpmz="〖精品烤火鸡〗（防）";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=1000;          //设置限制使用得到值       

 } elseif($npcc ==1080){
//---------------------------------------------------------//
$wwpmz="〖极品烤火鸡〗（防）";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=1300;          //设置限制使用得到值       



} elseif($npcc ==1081){

//---------------------------------------------------------//
$wwpmz="〖极品烤全羊〗（血）";//物品的名字                             // 
$wwpmz1="HP";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="血";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值        
 //
//---------------------------------------------------------//

//---------------------------------------------------------//


} elseif($npcc ==1082){
//---------------------------------------------------------//
$wwpmz="〖极品烤全羊〗（攻）";//物品的名字                             // 
$wwpmz1="攻击";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max攻击";
$wpzz3="攻击";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值         



} elseif($npcc ==1083){
//---------------------------------------------------------//
$wwpmz="〖极品烤全羊〗（魔）";//物品的名字                             // 
$wwpmz1="魔攻";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max魔攻";
$wpzz3="魔攻";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值              

 //
//---------------------------------------------------------//


 
     } elseif($npcc ==1084){
//---------------------------------------------------------//
$wwpmz="〖极品烤全羊〗（防）";//物品的名字                             // 
$wwpmz1="防御";          //设置限制使用得到值               //
$wpzz1="玩家信息";
$wpzz2="max防御";
$wpzz3="防御";
$xzcs=200;          //设置限制使用次数                      //
$max=5000;          //设置限制使用得到值       





































} else{

}

?>


