<?php


$wpdz1[]="〖百年魔珠〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=331;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率


$wpdz1[]="红宝石一";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=22;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="红水晶一";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=23;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="蓝宝石一";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=24;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="蓝水晶一";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=25;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="黄宝石一";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=26;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="黄水晶一";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=27;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="金刚石一";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=28;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="佛印石一";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=29;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="玄武石一";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=30;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率






?>


