<?php


$wpdz1[]="〖百年魔珠〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=331;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率


$wpdz1[]="红宝石二";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=31;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="红水晶二";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=32;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="蓝宝石二";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=33;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="蓝水晶二";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=34;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="黄宝石二";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=35;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="黄水晶二";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=36;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="金刚石二";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=37;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="佛印石二";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=38;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="玄武石二";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=39;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率






?>


