<?php

include("./wj/fbmz.php");//调用ini缓存位置
echo "<font color=black>恭喜你！完成了".$fbmz."</font>"."<br>";

$inina1=$inina;

////////////////完成副本奖励//////////////////


if($npcc ==1){//冰晶塔（普通）
//经验加
$jy1=1000000;
//
//加银加
$yl1=1000000;
//
//加英雄牌
//
$sl=1;
//
//

} elseif ($npcc ==2) {//冰晶塔（困难）

//经验加
$jy1=2000000;
//
//加银加
$yl1=2000000;
//
//加英雄牌
//
$sl=2;
//
//
} elseif ($npcc ==3) {//冰晶塔（梦魇）

//经验加
$jy1=4000000;
//
//加银加
$yl1=4000000;
//
//加英雄牌
//
$sl=3;
//
//


} elseif ($npcc ==4) {//变异竹林副本【普通】";
//经验加
$jy1=1000000;
//
//加银加
$yl1=1000000;
//
//加英雄牌
//
$sl=1;
//
//
} elseif ($npcc ==5) {//变异竹林副本【困难】";
//经验加
$jy1=2000000;
//
//加银加
$yl1=2000000;
//
//加英雄牌
//
$sl=2;
//
//

} elseif ($npcc ==6) {//变异竹林副本【梦魇】";
//经验加
$jy1=5000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=3;
//
//
} elseif ($npcc ==7) {//压龙洞副本【普通】";
//经验加
$jy1=2000000;
//
//加银加
$yl1=2000000;
//
//加英雄牌
//
$sl=1;
//
//
} elseif ($npcc ==8) {//压龙洞副本【困难】";
//经验加
$jy1=4000000;
//
//加银加
$yl1=4000000;
//
//加英雄牌
//
$sl=2;
//
//
} elseif ($npcc ==9) {//压龙洞副本【梦魇】";
//经验加
$jy1=8000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=3;
//
//

} elseif ($npcc ==10) {//莲花洞副本【普通】";
//经验加
$jy1=3000000;
//
//加银加
$yl1=3000000;
//
//加英雄牌
//
$sl=1;
//
//
} elseif ($npcc ==11) {//莲花洞副本【困难】";
//经验加
$jy1=5000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=2;
//
//
} elseif ($npcc ==12) {//莲花洞副本【梦魇】";
//经验加
$jy1=10000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=3;
//
//
} elseif ($npcc ==13) {//波月洞副本【普通】";
//经验加
$jy1=3000000;
//
//加银加
$yl1=3000000;
//
//加英雄牌
//
$sl=1;
//
//
} elseif ($npcc ==14) {//波月洞副本【困难】";
//经验加
$jy1=5000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=2;
//
//
} elseif ($npcc ==15) {//波月洞副本【梦魇】";
//经验加
$jy1=8000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=3;
//
//
} elseif ($npcc ==16) {//白骨陵墓副本【普通】";
//经验加
$jy1=2000000;
//
//加银加
$yl1=2000000;
//
//加英雄牌
//
$sl=1;
//
//
} elseif ($npcc ==17) {//白骨陵墓副本【困难】";
//经验加
$jy1=3000000;
//
//加银加
$yl1=3000000;
//
//加英雄牌
//
$sl=2;
//
//
} elseif ($npcc ==18) {//白骨陵墓副本【梦魇】";
//经验加
$jy1=5000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=3;
//
//
} elseif ($npcc ==19) {//水帘洞天副本【普通】";
//经验加
$jy1=2000000;
//
//加银加
$yl1=2000000;
//
//加英雄牌
//
$sl=1;
//
//
} elseif ($npcc ==20) {//水帘洞天副本【困难】";
//经验加
$jy1=3000000;
//
//加银加
$yl1=3000000;
//
//加英雄牌
//
$sl=2;
//
//
} elseif ($npcc ==21) {//水帘洞天副本【梦魇】";
//经验加
$jy1=4000000;
//
//加银加
$yl1=4000000;
//
//加英雄牌
//
$sl=3;
//
//
} elseif ($npcc ==22) {//斩妖台副本【普通】";
//经验加
$jy1=3000000;
//
//加银加
$yl1=3000000;
//
//加英雄牌
//
$sl=1;
//
//
} elseif ($npcc ==23) {//斩妖台副本【困难】";
//经验加
$jy1=4000000;
//
//加银加
$yl1=4000000;
//
//加英雄牌
//
$sl=2;
//
//
} elseif ($npcc ==24) {//斩妖台副本【梦魇】";
//经验加
$jy1=7000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=3;
//
//
} elseif ($npcc ==25) {//枉死城副本【普通】";
//经验加
$jy1=2000000;
//
//加银加
$yl1=2000000;
//
//加英雄牌
//
$sl=1;
//
//
} elseif ($npcc ==26) {//枉死城副本【困难】";
//经验加
$jy1=3000000;
//
//加银加
$yl1=3000000;
//
//加英雄牌
//
$sl=2;
//
//
} elseif ($npcc ==27) {//枉死城副本【梦魇】";
//经验加
$jy1=5000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=3;

//
//


} elseif ($npcc ==28) {//老君炉副本【普通】";
//经验加
$jy1=3000000;
//
//加银加
$yl1=3000000;
//
//加英雄牌
//
$sl=1;
//
//
} elseif ($npcc ==29) {//老君炉副本【困难】";
//经验加
$jy1=5000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=2;
//
//
} elseif ($npcc ==30) {//老君炉副本【梦魇】";
//经验加
$jy1=10000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=3;
//
//







} elseif ($npcc ==31) {
//$fbmz = "冰晶塔副本【地狱】";
//经验加
$jy1=5000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=3;
//
//
} elseif ($npcc ==32) {
//$fbmz = "变异竹林副本【地狱】";
//经验加
$jy1=6000000;
//
//加银加
$yl1=6000000;
//
//加英雄牌
//
$sl=3;
//
//
} elseif ($npcc ==33) {
//$fbmz = "压龙洞副本【地狱】";
//经验加
$jy1=9000000;
//
//加银加
$yl1=6000000;
//
//加英雄牌
//
$sl=3;
//
//
} elseif ($npcc ==34) {
//$fbmz = "莲花洞副本【地狱】";
//经验加
$jy1=11000000;
//
//加银加
$yl1=6000000;
//
//加英雄牌
//
$sl=3;
//
//
} elseif ($npcc ==35) {
//$fbmz = "波月洞副本【地狱】";

//经验加
$jy1=9000000;
//
//加银加
$yl1=6000000;
//
//加英雄牌
//
$sl=3;
//
//

} elseif ($npcc ==36) {
//$fbmz = "白骨陵墓副本【地狱】";

//经验加
$jy1=6000000;
//
//加银加
$yl1=6000000;
//
//加英雄牌
//
$sl=3;
//
//
} elseif ($npcc ==37) {
//$fbmz = "水帘洞天副本【地狱】";
//经验加
$jy1=5000000;
//
//加银加
$yl1=5000000;
//
//加英雄牌
//
$sl=3;
//
//

} elseif ($npcc ==38) {
//$fbmz = "斩妖台副本【地狱】";
//经验加
$jy1=8000000;
//
//加银加
$yl1=6000000;
//
//加英雄牌
//
$sl=3;
//
//

} elseif ($npcc ==39) {
//$fbmz = "枉死城副本【地狱】";

//经验加
$jy1=6000000;
//
//加银加
$yl1=6000000;
//
//加英雄牌
//
$sl=3;

//
//
} elseif ($npcc ==40) {
//$fbmz = "老君炉副本【地狱】";


//经验加
$jy1=11000000;
//
//加银加
$yl1=6000000;
//
//加英雄牌
//
$sl=3;
//
//




} elseif ($npcc ==41) {//金兜洞副本【普通】";
//经验加
$jy1=4000000;
//加银加
$yl1=4000000;
//加英雄牌
$sl=1;
} elseif ($npcc ==42) {//金兜洞副本【困难】";
//经验加
$jy1=6000000;
//加银加
$yl1=6000000;
//加英雄牌
$sl=2;
} elseif ($npcc ==43) {//金兜洞副本【梦魇】";
//经验加
$jy1=12000000;
//加银加
$yl1=7000000;
//加英雄牌
$sl=3;
} elseif ($npcc ==44) {//金兜洞副本【地狱】";
//经验加
$jy1=15000000;
//加银加
$yl1=8000000;
//加英雄牌
$sl=4;


} elseif ($npcc ==45) {//瑶池副本【普通】";
//经验加
$jy1=2000000;
//加银加
$yl1=2000000;
//加英雄牌
$sl=1;
} elseif ($npcc ==46) {//瑶池副本【困难】";
//经验加
$jy1=3000000;
//加银加
$yl1=3000000;
//加英雄牌
$sl=2;
} elseif ($npcc ==47) {//瑶池副本【梦魇】";
//经验加
$jy1=4000000;
//加银加
$yl1=4000000;
//加英雄牌
$sl=3;
} elseif ($npcc ==48) {//瑶池副本【地狱】";
//经验加
$jy1=5000000;
//加银加
$yl1=5000000;
//加英雄牌
$sl=4;




} elseif ($npcc ==49) {//通天水府副本【普通】";
//经验加
$jy1=5000000;
//加银加
$yl1=5000000;
//加英雄牌
$sl=1;
} elseif ($npcc ==50) {//通天水府副本【困难】";
//经验加
$jy1=7000000;
//加银加
$yl1=7000000;
//加英雄牌
$sl=2;
} elseif ($npcc ==51) {//通天水府副本【梦魇】";
//经验加
$jy1=15000000;
//加银加
$yl1=8000000;
//加英雄牌
$sl=3;
} elseif ($npcc ==52) {//通天水府副本【地狱】";
//经验加
$jy1=20000000;
//加银加
$yl1=10000000;
//加英雄牌
$sl=4;


} elseif ($npcc ==53) {//芭蕉洞副本【普通】";
//经验加
$jy1=10000000;
//加银加
$yl1=10000000;
//加英雄牌
$sl=1;
} elseif ($npcc ==54) {//芭蕉洞副本【困难】";
//经验加
$jy1=15000000;
//加银加
$yl1=15000000;
//加英雄牌
$sl=2;
} elseif ($npcc ==55) {//芭蕉洞副本【梦魇】";
//经验加
$jy1=20000000;
//加银加
$yl1=25000000;
//加英雄牌
$sl=3;
} elseif ($npcc ==56) {//芭蕉洞副本【地狱】";
//经验加
$jy1=30000000;
//加银加
$yl1=30000000;
//加英雄牌
$sl=4;







} elseif ($npcc ==57) {//小雷音寺副本【普通】";
//经验加
$jy1=15000000;
//加银加
$yl1=15000000;
//加英雄牌
$sl=1;
} elseif ($npcc ==58) {//小雷音寺副本【困难】";
//经验加
$jy1=25000000;
//加银加
$yl1=25000000;
//加英雄牌
$sl=2;
} elseif ($npcc ==59) {//小雷音寺副本【梦魇】";
//经验加
$jy1=30000000;
//加银加
$yl1=30000000;
//加英雄牌
$sl=3;
} elseif ($npcc ==60) {//小雷音寺副本【地狱】";
//经验加
$jy1=50000000;
//加银加
$yl1=50000000;
//加英雄牌
$sl=4;



} elseif ($npcc ==61) {//盘丝洞副本【普通】";
//经验加
$jy1=30000000;
//加银加
$yl1=30000000;
//加英雄牌
$sl=1;
} elseif ($npcc ==62) {//盘丝洞副本【困难】";
//经验加
$jy1=50000000;
//加银加
$yl1=50000000;
//加英雄牌
$sl=2;
} elseif ($npcc ==63) {//盘丝洞副本【梦魇】";
//经验加
$jy1=70000000;
//加银加
$yl1=70000000;
//加英雄牌
$sl=3;
} elseif ($npcc ==64) {//盘丝洞副本【地狱】";
//经验加
$jy1=100000000;
//加银加
$yl1=100000000;
//加英雄牌
$sl=4;


} elseif ($npcc ==65) {//狮驼洞副本【普通】";
//经验加
$jy1=100000000;
//加银加
$yl1=100000000;
//加英雄牌
$sl=1;
} elseif ($npcc ==66) {//狮驼洞副本【困难】";
//经验加
$jy1=150000000;
//加银加
$yl1=150000000;
//加英雄牌
$sl=2;
} elseif ($npcc ==67) {//狮驼洞副本【梦魇】";
//经验加
$jy1=200000000;
//加银加
$yl1=200000000;
//加英雄牌
$sl=3;
} elseif ($npcc ==68) {//狮驼洞副本【地狱】";
//经验加
$jy1=300000000;
//加银加
$yl1=300000000;
//加英雄牌
$sl=4;




} elseif ($npcc ==69) {//无底洞副本【普通】";
//经验加
$jy1=200000000;
//加银加
$yl1=200000000;
//加英雄牌
$sl=1;
} elseif ($npcc ==70) {//无底洞副本【困难】";
//经验加
$jy1=300000000;
//加银加
$yl1=300000000;
//加英雄牌
$sl=2;
} elseif ($npcc ==71) {//无底洞副本【梦魇】";
//经验加
$jy1=400000000;
//加银加
$yl1=400000000;
//加英雄牌
$sl=3;
} elseif ($npcc ==72) {//无底洞副本【地狱】";
//经验加
$jy1=500000000;
//加银加
$yl1=500000000;
//加英雄牌
$sl=4;





} else{
$sl="";
}




if ($sl!="") {





//经验
$jy=$jy1;	
include("./pz/ini_pzz023.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////
$wwpsl=$yl1; 
include("./pz/ini_pz03.php");//调用ini缓存位置
//////////////////////////////////////////////////银两增加/////////////////////////////////////////

//爆物品
$wpdz1="";//初始
$wpdz2="";//初始
$wpdz3="";//初始
$wpdz4="";//初始
$wpdz5="";//初始



$wpdz1[]="【英雄牌】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=394;//物品id
$wpdz4[]=$sl;//	量
$wpdz5[]=1;//	重量
$m=count($wpdz1,0); 
$ccm=$m;

$ii=-1;
$wpbv3=0;
for($d=0;$d<$ccm;$d++){
$ii=$ii+1;
$wpbv3=$wpbv3+1;
if ($wpbv3==1) {//符合条件爆出
include("./sql/mysql.php");//调用数据库连接 
} else{
}
if ($wpdz2[$ii]==3) {//装备
$jjmz=$wpdz1[$ii];
$wwpfl=$wpdz2[$ii];//物品分类
$zbid1=$wpdz3[$ii];//物品id
$zbzl1=$wpdz5[$ii];//物品重量
include("./pz/ini_pzz011.php");
$kcrl=$zbzl1+$kcrl;
} else{//物品


$wpmz=$wpdz1[$ii];
$wwpfl=$wpdz2[$ii];//物品分类
$wpid=$wpdz3[$ii];//物品id
$wpkc=$wpdz4[$ii];//	需要量
$wpzl=$wpdz5[$ii];//物品重量


$manzu1=$manzu1."<font color=black>获得：".$wpmz."x".$wpkc.$dbpd1."</font>"."<br>";
include("./pz/ini_pz01.php");//缓存位置
include("./pz/ini_pzz024.php");//增加
//背包容量变更加
$kcrl=$wpkc*$wpzl+$kcrl;


}
}
if ($kcrl!="") {
include("./pz/ini_pzz09.php");
echo $manzu1;
} else{
}












} else{
echo "<font color=black>对不起！完成副本领取奖励遭遇异常联系gm解决此问题</font>"."<br>";
}






















?>


