<?php




if ($bossdj==1) {
$bossdjdv=20;
} elseif ($bossdj==2) {
$bossdjdv=30;
} elseif ($bossdj==3) {
$bossdjdv=50;
} elseif ($bossdj==4) {
$bossdjdv=80;
} else {
$bossdjdv=30;
	
	
	
}
$wpdz1="";//初始
$wpdz2="";//初始
$wpdz3="";//初始
$wpdz4="";//初始
$wpdz5="";//初始
$wpdz6="";//初始
$wpdz7="";//初始




/*
$jry= date('m')*1;
$jrr= date('d')*1;

if ($jry==9&&$jrr==24) {


echo"<font color=red>小轩：中秋节日快乐！游戏的同时别忘了多陪陪家人和孩子哦~~~~活动物品双倍掉落中~~~美滋滋~~~</font></a>"."<br>";


$wpdz1[]="【糯米粉】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=741;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖香甜桂花〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=742;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖玉兔蜜糖〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=743;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

} else {
	
	
	


$wpdz1[]="【糯米粉】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=741;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖香甜桂花〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=742;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖玉兔蜜糖〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=743;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
	
	
	
	
	

}



*/







/*
//活动掉落
//爆物品
$wpdz1="";//初始
$wpdz2="";//初始
$wpdz3="";//初始
$wpdz4="";//初始
$wpdz5="";//初始
$wpdz6="";//初始
$wpdz7="";//初始

$wpdz1[]="【比翼图纸】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=506;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=5;//	多少爆率


$wpdz1[]="【才子印记】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=500;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率


$wpdz1[]="【才子印记】（碎片）";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=501;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

//活动掉落
*/


/*



//活动掉落
//爆物品
$wpdz1="";//初始
$wpdz2="";//初始
$wpdz3="";//初始
$wpdz4="";//初始
$wpdz5="";//初始
$wpdz6="";//初始
$wpdz7="";//初始


$wpdz1[]="〖万能字〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=563;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=3;//	多少爆率

$wpdz1[]="【清】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=558;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="【凉】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=559;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="【一】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=560;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="【夏】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=561;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



*/

/*

$wpdz1[]="【喜鹊蛋】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=591;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=70;//	多少爆率


$wpdz1[]="【小喜鹊】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=592;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=5;//	多少爆率












$wpdz1[]="〖至尊宝密令〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=613;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=3;//	多少爆率



$wpdz1[]="〖金甲圣衣〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=609;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖七彩祥云〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=610;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖紫霞眼泪〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=611;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



$wpdz1[]="〖紧箍咒〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=612;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖七夕万能字〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=657;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=3;//	多少爆率

$wpdz1[]="【甜】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=630;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="【蜜】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=631;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="【七】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=632;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="【夕】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=633;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖鸳鸯帕〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=634;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖姻缘草〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=635;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=3;//	多少爆率

$wpdz1[]="〖银心铃〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=636;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

*/

/*
//活动掉落
//爆物品
$wpdz1="";//初始
$wpdz2="";//初始
$wpdz3="";//初始
$wpdz4="";//初始
$wpdz5="";//初始
$wpdz6="";//初始
$wpdz7="";//初始
//随机
$bz= rand(1, 2);
$wpdz1[]="〖女神同桌〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=688;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

//随机
$bz= rand(1, 2);
$wpdz1[]="【粉笔】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=684;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
//随机
$bz= rand(1, 2);
$wpdz1[]="【橡皮擦】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=685;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
//随机
$bz= rand(1, 2);
$wpdz1[]="【铅笔】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=686;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


//随机
$bz= rand(1, 2);
$wpdz1[]="【墨水】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=687;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

*/


/*
$wpdz1[]="〖万能字〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=563;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=3;//	多少爆率

$wpdz1[]="【清】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=558;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="【凉】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=559;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="【一】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=560;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="【夏】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=561;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖至尊宝密令〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=613;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=3;//	多少爆率



$wpdz1[]="〖金甲圣衣〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=609;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖七彩祥云〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=610;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖紫霞眼泪〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=611;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



$wpdz1[]="〖紧箍咒〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=612;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率





//随机
$bz= rand(1, 2);
$wpdz1[]="【粉笔】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=684;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
//随机
$bz= rand(1, 2);
$wpdz1[]="【橡皮擦】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=685;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
//随机
$bz= rand(1, 2);
$wpdz1[]="【铅笔】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=686;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


//随机
$bz= rand(1, 2);
$wpdz1[]="【墨水】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=687;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


//随机
$bz= rand(1, 2);
$wpdz1[]="〖女神同桌〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=688;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率




$wpdz1[]="〖鸳鸯帕〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=634;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖姻缘草〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=635;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=3;//	多少爆率

$wpdz1[]="〖银心铃〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=636;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖七夕万能字〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=657;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=3;//	多少爆率

$wpdz1[]="【甜】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=630;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="【蜜】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=631;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="【七】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=632;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="【夕】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=633;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="【喜鹊蛋】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=591;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=70;//	多少爆率


$wpdz1[]="【小喜鹊】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=592;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=5;//	多少爆率


*/
/*

$wpdz1[]="〖国庆藏宝图〗（金图）";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=841;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率



$wpdz1[]="〖国庆愉快卡〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=845;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖国庆万能字〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=836;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率


$wpdz1[]="【国庆金铲】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=837;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=3;//	多少爆率


$wpdz1[]="【欢】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=832;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="【度】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=833;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="【国】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=834;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="【庆】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=835;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

*/
/*
$bz= rand(1, 2);
$wpdz1[]="〖鸟蛋〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=894;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=5;//	多少爆率
$bz= rand(1, 2);
$wpdz1[]="〖奶油〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=895;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
$bz= rand(1, 2);
$wpdz1[]="〖白糖〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=896;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$bz= rand(1, 2);
$wpdz1[]="〖牛奶〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=897;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$bz= rand(1, 2);

$wpdz1[]="〖面粉〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=898;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$bz= rand(1, 2);

$wpdz1[]="〖黄油〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=899;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$bz= rand(1, 2);

$wpdz1[]="〖小麦粉〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=900;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$bz= rand(1, 2);

$wpdz1[]="〖巧克力酱〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=901;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$bz= rand(1, 2);

$wpdz1[]="〖可可粉〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=902;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$bz= rand(1, 2);
$wpdz1[]="〖力娇酒〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=903;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$bz= rand(1, 2);
$wpdz1[]="〖半〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=922;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
$bz= rand(1, 2);

$wpdz1[]="〖周〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=923;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$bz= rand(1, 2);



$wpdz1[]="〖庆〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=924;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$bz= rand(1, 2);


$wpdz1[]="〖年〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=925;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$bz= rand(1, 2);


$wpdz1[]="〖典〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=926;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$bz= rand(1, 2);
$wpdz1[]="〖原料购物票〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=904;//物品id
$wpdz4[]=$bz;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=5;//	多少爆率
*/


$wpdz1[]="【面粉】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=946;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="【红枣】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=947;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="【栗子】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=948;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


$wpdz1[]="【杏仁】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=949;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖小公主の材料票〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=950;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=2;//	多少爆率

$wpdz1[]="〖小公主の仙竹〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=951;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="【黑沃土】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=942;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="【仙玉露】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=943;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

/*
$wpdz1[]="【万】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1004;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="【圣】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1005;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="【节】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1006;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="【快】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1007;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="【乐】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1008;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="【万圣节捣蛋劵】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1046;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=5;//	多少爆率


*/

/*
$wpdz1[]="【烤火鸡】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1059;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="【南瓜饼】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1060;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="【红莓酱】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1061;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="【甜山芋】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1062;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="【玉蜀黎】";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1063;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖感恩票〗";//名字
$wpdz2[]=6;//物品分类
$wpdz3[]=1064;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

*/














?>


