<?php

if($tzid==1){//【心心】
$tzhp=100;//血量
$tzgj=100;//攻击
$tzmg=100;//魔攻
$tzfy=100;//防御
$tzbg=1;//冰攻
$tzhg=1;//火攻
$tzlg=1;//雷攻
$tzbf=1;//冰防
$tzhf=1;//火防
$tzlf=1;//雷防

} elseif($tzid==2){	//【灵犀】
$tzhp=10000;//血量
$tzgj=2000;//攻击
$tzmg=2000;//魔攻
$tzfy=2100;//防御
$tzbg=2;//冰攻
$tzhg=2;//火攻
$tzlg=2;//雷攻
$tzbf=2;//冰防
$tzhf=2;//火防
$tzlf=2;//雷防

} elseif($tzid==3){	//【海誓】
$tzhp=10000;//血量
$tzgj=5000;//攻击
$tzmg=5000;//魔攻
$tzfy=4500;//防御
$tzbg=5;//冰攻
$tzhg=5;//火攻
$tzlg=5;//雷攻
$tzbf=5;//冰防
$tzhf=5;//火防
$tzlf=5;//雷防


} elseif($tzid==4){	//【比翼】
$tzhp=30000;//血量
$tzgj=10000;//攻击
$tzmg=10000;//魔攻
$tzfy=12000;//防御
$tzbg=8;//冰攻
$tzhg=8;//火攻
$tzlg=8;//雷攻
$tzbf=8;//冰防
$tzhf=8;//火防
$tzlf=8;//雷防

} elseif($tzid==5){	//【幻想套（灵级）】2件
$tzhp=10000;//血量
$tzgj=5000;//攻击
$tzmg=5000;//魔攻
$tzfy=5000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==6){	//【幻想套（灵级）】3件
$tzhp=12000;//血量
$tzgj=5500;//攻击
$tzmg=5500;//魔攻
$tzfy=5500;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=1;//冰防
$tzhf=1;//火防
$tzlf=1;//雷防


} elseif($tzid==7){	//【幻想套（灵级）】4件
$tzhp=15000;//血量
$tzgj=6100;//攻击
$tzmg=6100;//魔攻
$tzfy=6100;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=3;//冰防
$tzhf=3;//火防
$tzlf=3;//雷防

} elseif($tzid==8){	//【幻想套（灵级）】5件
$tzhp=20000;//血量
$tzgj=6800;//攻击
$tzmg=6800;//魔攻
$tzfy=6800;//防御
$tzbg=5;//冰攻
$tzhg=5;//火攻
$tzlg=5;//雷攻
$tzbf=5;//冰防
$tzhf=5;//火防
$tzlf=5;//雷防

} elseif($tzid==9){	//【幻想套（灵级）】6件
$tzhp=50000;//血量
$tzgj=10000;//攻击
$tzmg=10000;//魔攻
$tzfy=10000;//防御
$tzbg=10;//冰攻
$tzhg=10;//火攻
$tzlg=10;//雷攻
$tzbf=10;//冰防
$tzhf=10;//火防
$tzlf=10;//雷防



} elseif($tzid==10){	//【幻想套（仙级）】2件
$tzhp=20000;//血量
$tzgj=10000;//攻击
$tzmg=10000;//魔攻
$tzfy=10000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==11){	//【幻想套（仙级）】3件
$tzhp=22000;//血量
$tzgj=6000;//攻击
$tzmg=6000;//魔攻
$tzfy=6000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=2;//冰防
$tzhf=2;//火防
$tzlf=2;//雷防


} elseif($tzid==12){	//【幻想套（仙级）】4件
$tzhp=30000;//血量
$tzgj=8000;//攻击
$tzmg=8000;//魔攻
$tzfy=8000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=5;//冰防
$tzhf=5;//火防
$tzlf=5;//雷防

} elseif($tzid==13){	//【幻想套（仙级）】5件
$tzhp=40000;//血量
$tzgj=10000;//攻击
$tzmg=10000;//魔攻
$tzfy=10000;//防御
$tzbg=7;//冰攻
$tzhg=7;//火攻
$tzlg=7;//雷攻
$tzbf=7;//冰防
$tzhf=7;//火防
$tzlf=7;//雷防

} elseif($tzid==14){	//【幻想套（仙级）】6件
$tzhp=80000;//血量
$tzgj=30000;//攻击
$tzmg=30000;//魔攻
$tzfy=30000;//防御
$tzbg=15;//冰攻
$tzhg=15;//火攻
$tzlg=15;//雷攻
$tzbf=15;//冰防
$tzhf=15;//火防
$tzlf=15;//雷防




} elseif($tzid==15){	//【幻想套（神级）】2件
$tzhp=30000;//血量
$tzgj=20000;//攻击
$tzmg=20000;//魔攻
$tzfy=20000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==16){	//【幻想套（神级）】3件
$tzhp=35000;//血量
$tzgj=25000;//攻击
$tzmg=25000;//魔攻
$tzfy=25000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=3;//冰防
$tzhf=3;//火防
$tzlf=3;//雷防


} elseif($tzid==17){	//【幻想套（神级）】4件
$tzhp=50000;//血量
$tzgj=35000;//攻击
$tzmg=35000;//魔攻
$tzfy=35000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=7;//冰防
$tzhf=7;//火防
$tzlf=7;//雷防

} elseif($tzid==18){	//【幻想套（神级）】5件
$tzhp=70000;//血量
$tzgj=50000;//攻击
$tzmg=50000;//魔攻
$tzfy=50000;//防御
$tzbg=10;//冰攻
$tzhg=10;//火攻
$tzlg=10;//雷攻
$tzbf=10;//冰防
$tzhf=10;//火防
$tzlf=10;//雷防

} elseif($tzid==19){	//【幻想套（神级）】6件
$tzhp=100000;//血量
$tzgj=80000;//攻击
$tzmg=80000;//魔攻
$tzfy=80000;//防御
$tzbg=20;//冰攻
$tzhg=20;//火攻
$tzlg=20;//雷攻
$tzbf=20;//冰防
$tzhf=20;//火防
$tzlf=20;//雷防





} elseif($tzid==20){	//【幻想套（圣级）】2件
$tzhp=50000;//血量
$tzgj=30000;//攻击
$tzmg=30000;//魔攻
$tzfy=30000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==21){	//【幻想套（圣级）】3件
$tzhp=70000;//血量
$tzgj=40000;//攻击
$tzmg=40000;//魔攻
$tzfy=40000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=5;//冰防
$tzhf=5;//火防
$tzlf=5;//雷防


} elseif($tzid==22){	//【幻想套（圣级）】4件
$tzhp=90000;//血量
$tzgj=50000;//攻击
$tzmg=50000;//魔攻
$tzfy=50000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=10;//冰防
$tzhf=10;//火防
$tzlf=10;//雷防

} elseif($tzid==23){	//【幻想套（圣级）】5件
$tzhp=120000;//血量
$tzgj=80000;//攻击
$tzmg=80000;//魔攻
$tzfy=80000;//防御
$tzbg=15;//冰攻
$tzhg=15;//火攻
$tzlg=15;//雷攻
$tzbf=15;//冰防
$tzhf=15;//火防
$tzlf=15;//雷防

} elseif($tzid==24){	//【幻想套（圣级）】6件
$tzhp=200000;//血量
$tzgj=150000;//攻击
$tzmg=150000;//魔攻
$tzfy=150000;//防御
$tzbg=25;//冰攻
$tzhg=25;//火攻
$tzlg=25;//雷攻
$tzbf=25;//冰防
$tzhf=25;//火防
$tzlf=25;//雷防




} elseif($tzid==25){	//【诛仙】2件
$tzhp=100000;//血量
$tzgj=60000;//攻击
$tzmg=60000;//魔攻
$tzfy=60000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==26){	//【诛仙】3件
$tzhp=120000;//血量
$tzgj=70000;//攻击
$tzmg=70000;//魔攻
$tzfy=70000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=8;//冰防
$tzhf=8;//火防
$tzlf=8;//雷防


} elseif($tzid==27){	//【诛仙】4件
$tzhp=180000;//血量
$tzgj=100000;//攻击
$tzmg=100000;//魔攻
$tzfy=100000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=15;//冰防
$tzhf=15;//火防
$tzlf=15;//雷防

} elseif($tzid==28){	//【诛仙】5件
$tzhp=250000;//血量
$tzgj=150000;//攻击
$tzmg=150000;//魔攻
$tzfy=150000;//防御
$tzbg=20;//冰攻
$tzhg=20;//火攻
$tzlg=20;//雷攻
$tzbf=20;//冰防
$tzhf=20;//火防
$tzlf=20;//雷防

} elseif($tzid==29){	//【诛仙】6件
$tzhp=400000;//血量
$tzgj=300000;//攻击
$tzmg=300000;//魔攻
$tzfy=300000;//防御
$tzbg=30;//冰攻
$tzhg=30;//火攻
$tzlg=30;//雷攻
$tzbf=30;//冰防
$tzhf=30;//火防
$tzlf=30;//雷防





} elseif($tzid==30){	//【圣灵套】2件
$tzhp=150000;//血量
$tzgj=80000;//攻击
$tzmg=80000;//魔攻
$tzfy=80000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==31){	//【圣灵套】3件
$tzhp=170000;//血量
$tzgj=100000;//攻击
$tzmg=100000;//魔攻
$tzfy=100000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=10;//冰防
$tzhf=10;//火防
$tzlf=10;//雷防


} elseif($tzid==32){	//【圣灵套】4件
$tzhp=250000;//血量
$tzgj=140000;//攻击
$tzmg=140000;//魔攻
$tzfy=140000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=20;//冰防
$tzhf=20;//火防
$tzlf=20;//雷防

} elseif($tzid==33){	//【圣灵套】5件
$tzhp=300000;//血量
$tzgj=180000;//攻击
$tzmg=180000;//魔攻
$tzfy=180000;//防御
$tzbg=25;//冰攻
$tzhg=25;//火攻
$tzlg=25;//雷攻
$tzbf=25;//冰防
$tzhf=25;//火防
$tzlf=25;//雷防

} elseif($tzid==34){	//【圣灵套】6件
$tzhp=500000;//血量
$tzgj=350000;//攻击
$tzmg=350000;//魔攻
$tzfy=350000;//防御
$tzbg=35;//冰攻
$tzhg=35;//火攻
$tzlg=35;//雷攻
$tzbf=35;//冰防
$tzhf=35;//火防
$tzlf=35;//雷防




} elseif($tzid==35){	//【圣灵套（灵级）】2件
$tzhp=200000;//血量
$tzgj=100000;//攻击
$tzmg=100000;//魔攻
$tzfy=100000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==36){	//【圣灵套（灵级）】3件
$tzhp=230000;//血量
$tzgj=120000;//攻击
$tzmg=120000;//魔攻
$tzfy=120000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=12;//冰防
$tzhf=12;//火防
$tzlf=12;//雷防


} elseif($tzid==37){	//【圣灵套（灵级）】4件
$tzhp=300000;//血量
$tzgj=160000;//攻击
$tzmg=160000;//魔攻
$tzfy=160000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=23;//冰防
$tzhf=23;//火防
$tzlf=23;//雷防

} elseif($tzid==38){	//【圣灵套（灵级）】5件
$tzhp=350000;//血量
$tzgj=200000;//攻击
$tzmg=200000;//魔攻
$tzfy=200000;//防御
$tzbg=26;//冰攻
$tzhg=26;//火攻
$tzlg=26;//雷攻
$tzbf=26;//冰防
$tzhf=26;//火防
$tzlf=26;//雷防

} elseif($tzid==39){	//【圣灵套（灵级）】6件
$tzhp=600000;//血量
$tzgj=400000;//攻击
$tzmg=400000;//魔攻
$tzfy=400000;//防御
$tzbg=40;//冰攻
$tzhg=40;//火攻
$tzlg=40;//雷攻
$tzbf=40;//冰防
$tzhf=40;//火防
$tzlf=40;//雷防



} elseif($tzid==40){	//【圣灵套（仙级）】2件
$tzhp=250000;//血量
$tzgj=130000;//攻击
$tzmg=130000;//魔攻
$tzfy=130000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==41){	//【圣灵套（仙级）】3件
$tzhp=300000;//血量
$tzgj=160000;//攻击
$tzmg=160000;//魔攻
$tzfy=160000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=15;//冰防
$tzhf=15;//火防
$tzlf=15;//雷防


} elseif($tzid==42){	//【圣灵套（仙级）】4件
$tzhp=350000;//血量
$tzgj=200000;//攻击
$tzmg=200000;//魔攻
$tzfy=200000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=25;//冰防
$tzhf=25;//火防
$tzlf=25;//雷防

} elseif($tzid==43){	//【圣灵套（仙级）】5件
$tzhp=450000;//血量
$tzgj=300000;//攻击
$tzmg=300000;//魔攻
$tzfy=300000;//防御
$tzbg=30;//冰攻
$tzhg=30;//火攻
$tzlg=30;//雷攻
$tzbf=30;//冰防
$tzhf=30;//火防
$tzlf=30;//雷防

} elseif($tzid==44){	//【圣灵套（仙级）】6件
$tzhp=700000;//血量
$tzgj=450000;//攻击
$tzmg=450000;//魔攻
$tzfy=450000;//防御
$tzbg=45;//冰攻
$tzhg=45;//火攻
$tzlg=45;//雷攻
$tzbf=45;//冰防
$tzhf=45;//火防
$tzlf=45;//雷防



} elseif($tzid==45){	//【圣灵套（神级）】2件
$tzhp=400000;//血量
$tzgj=200000;//攻击
$tzmg=200000;//魔攻
$tzfy=200000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==46){	//【圣灵套（神级）】3件
$tzhp=5000000;//血量
$tzgj=250000;//攻击
$tzmg=250000;//魔攻
$tzfy=250000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=20;//冰防
$tzhf=20;//火防
$tzlf=20;//雷防


} elseif($tzid==47){	//【圣灵套（神级）】4件
$tzhp=600000;//血量
$tzgj=300000;//攻击
$tzmg=300000;//魔攻
$tzfy=300000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=30;//冰防
$tzhf=30;//火防
$tzlf=30;//雷防

} elseif($tzid==48){	//【圣灵套（神级）】5件
$tzhp=700000;//血量
$tzgj=400000;//攻击
$tzmg=400000;//魔攻
$tzfy=400000;//防御
$tzbg=35;//冰攻
$tzhg=35;//火攻
$tzlg=35;//雷攻
$tzbf=35;//冰防
$tzhf=35;//火防
$tzlf=35;//雷防

} elseif($tzid==49){	//【圣灵套（神级）】6件
$tzhp=800000;//血量
$tzgj=550000;//攻击
$tzmg=550000;//魔攻
$tzfy=550000;//防御
$tzbg=50;//冰攻
$tzhg=50;//火攻
$tzlg=50;//雷攻
$tzbf=50;//冰防
$tzhf=50;//火防
$tzlf=50;//雷防

} elseif($tzid==50){	//【圣灵☯天元套】2件
$tzhp=450000;//血量
$tzgj=230000;//攻击
$tzmg=230000;//魔攻
$tzfy=230000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==51){	//【圣灵☯天元套】3件
$tzhp=550000;//血量
$tzgj=280000;//攻击
$tzmg=280000;//魔攻
$tzfy=280000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=25;//冰防
$tzhf=25;//火防
$tzlf=25;//雷防


} elseif($tzid==52){	//【圣灵☯天元套】4件
$tzhp=700000;//血量
$tzgj=350000;//攻击
$tzmg=350000;//魔攻
$tzfy=350000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=35;//冰防
$tzhf=35;//火防
$tzlf=35;//雷防

} elseif($tzid==53){	//【圣灵☯天元套】5件
$tzhp=700000;//血量
$tzgj=400000;//攻击
$tzmg=400000;//魔攻
$tzfy=400000;//防御
$tzbg=35;//冰攻
$tzhg=35;//火攻
$tzlg=35;//雷攻
$tzbf=35;//冰防
$tzhf=35;//火防
$tzlf=35;//雷防

} elseif($tzid==54){	//【圣灵☯天元套】6件
$tzhp=1000000;//血量
$tzgj=700000;//攻击
$tzmg=700000;//魔攻
$tzfy=700000;//防御
$tzbg=60;//冰攻
$tzhg=60;//火攻
$tzlg=60;//雷攻
$tzbf=60;//冰防
$tzhf=60;//火防
$tzlf=60;//雷防

} elseif($tzid==55){	//【海枯】
$tzhp=100000;//血量
$tzgj=60000;//攻击
$tzmg=60000;//魔攻
$tzfy=60000;//防御
$tzbg=8;//冰攻
$tzhg=8;//火攻
$tzlg=8;//雷攻
$tzbf=8;//冰防
$tzhf=8;//火防
$tzlf=8;//雷防

} elseif($tzid==56){	//【天作】
$tzhp=150000;//血量
$tzgj=100000;//攻击
$tzmg=100000;//魔攻
$tzfy=100000;//防御
$tzbg=15;//冰攻
$tzhg=15;//火攻
$tzlg=15;//雷攻
$tzbf=15;//冰防
$tzhf=15;//火防
$tzlf=15;//雷防

} elseif($tzid==57){	//【一生所爱】
$tzhp=400000;//血量
$tzgj=200000;//攻击
$tzmg=200000;//魔攻
$tzfy=200000;//防御
$tzbg=25;//冰攻
$tzhg=25;//火攻
$tzlg=25;//雷攻
$tzbf=25;//冰防
$tzhf=25;//火防
$tzlf=25;//雷防


} elseif($tzid==58){	//【恋人未满】
$tzhp=400000;//血量
$tzgj=0;//攻击
$tzmg=200000;//魔攻
$tzfy=200000;//防御
$tzbg=25;//冰攻
$tzhg=25;//火攻
$tzlg=25;//雷攻
$tzbf=25;//冰防
$tzhf=25;//火防
$tzlf=25;//雷防



} elseif($tzid==59){	//【噬魂套】2件
$tzhp=550000;//血量
$tzgj=330000;//攻击
$tzmg=330000;//魔攻
$tzfy=330000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==60){	//【噬魂套】3件
$tzhp=650000;//血量
$tzgj=380000;//攻击
$tzmg=380000;//魔攻
$tzfy=380000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=30;//冰防
$tzhf=30;//火防
$tzlf=30;//雷防


} elseif($tzid==61){	//【噬魂套】4件
$tzhp=800000;//血量
$tzgj=450000;//攻击
$tzmg=450000;//魔攻
$tzfy=450000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=40;//冰防
$tzhf=40;//火防
$tzlf=40;//雷防

} elseif($tzid==62){	//【噬魂套】5件
$tzhp=800000;//血量
$tzgj=500000;//攻击
$tzmg=500000;//魔攻
$tzfy=500000;//防御
$tzbg=40;//冰攻
$tzhg=40;//火攻
$tzlg=40;//雷攻
$tzbf=40;//冰防
$tzhf=40;//火防
$tzlf=40;//雷防

} elseif($tzid==63){	//【噬魂套】6件
$tzhp=1500000;//血量
$tzgj=1000000;//攻击
$tzmg=1000000;//魔攻
$tzfy=1000000;//防御
$tzbg=80;//冰攻
$tzhg=80;//火攻
$tzlg=80;//雷攻
$tzbf=80;//冰防
$tzhf=80;//火防
$tzlf=80;//雷防




} elseif($tzid==64){	//【缘定今生】
$tzhp=600000;//血量
$tzgj=350000;//攻击
$tzmg=350000;//魔攻
$tzfy=350000;//防御
$tzbg=40;//冰攻
$tzhg=40;//火攻
$tzlg=40;//雷攻
$tzbf=40;//冰防
$tzhf=40;//火防
$tzlf=40;//雷防


} elseif($tzid==65){	//【天赐良缘】
$tzhp=500000;//血量
$tzgj=300000;//攻击
$tzmg=300000;//魔攻
$tzfy=300000;//防御
$tzbg=30;//冰攻
$tzhg=30;//火攻
$tzlg=30;//雷攻
$tzbf=30;//冰防
$tzhf=30;//火防
$tzlf=30;//雷防








} elseif($tzid==66){	//【帝王套】2件
$tzhp=650000;//血量
$tzgj=430000;//攻击
$tzmg=430000;//魔攻
$tzfy=430000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=0;//冰防
$tzhf=0;//火防
$tzlf=0;//雷防

} elseif($tzid==67){	//【帝王套】3件
$tzhp=750000;//血量
$tzgj=480000;//攻击
$tzmg=480000;//魔攻
$tzfy=480000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=40;//冰防
$tzhf=40;//火防
$tzlf=40;//雷防


} elseif($tzid==68){	//【帝王套】4件
$tzhp=900000;//血量
$tzgj=550000;//攻击
$tzmg=550000;//魔攻
$tzfy=550000;//防御
$tzbg=0;//冰攻
$tzhg=0;//火攻
$tzlg=0;//雷攻
$tzbf=50;//冰防
$tzhf=50;//火防
$tzlf=50;//雷防

} elseif($tzid==69){	//【帝王套】5件
$tzhp=900000;//血量
$tzgj=600000;//攻击
$tzmg=600000;//魔攻
$tzfy=600000;//防御
$tzbg=50;//冰攻
$tzhg=50;//火攻
$tzlg=50;//雷攻
$tzbf=50;//冰防
$tzhf=50;//火防
$tzlf=50;//雷防

} elseif($tzid==70){	//【帝王套】6件
$tzhp=2000000;//血量
$tzgj=1500000;//攻击
$tzmg=1500000;//魔攻
$tzfy=1500000;//防御
$tzbg=99;//冰攻
$tzhg=99;//火攻
$tzlg=99;//雷攻
$tzbf=99;//冰防
$tzhf=99;//火防
$tzlf=99;//雷防



} elseif($tzid==71){	//【天仙之恋】
$tzhp=600000;//血量
$tzgj=400000;//攻击
$tzmg=400000;//魔攻
$tzfy=400000;//防御
$tzbg=40;//冰攻
$tzhg=40;//火攻
$tzlg=40;//雷攻
$tzbf=40;//冰防
$tzhf=40;//火防
$tzlf=40;//雷防



} elseif($tzid==72){	//【天尊之恋】
$tzhp=700000;//血量
$tzgj=550000;//攻击
$tzmg=550000;//魔攻
$tzfy=550000;//防御
$tzbg=50;//冰攻
$tzhg=50;//火攻
$tzlg=50;//雷攻
$tzbf=50;//冰防
$tzhf=50;//火防
$tzlf=50;//雷防



















} else{	

}




?>


