<?php



if ($npcc==1201) {

$xsbl=165;
//名字
$nname="【阎罗王】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1202) {
$xsbl=100;
//名字
$nname="〖采花〗百花仙子";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
} elseif ($npcc==1210) {
$xsbl=100;
//名字
$nname="〖日常〗伏羲仙人（福满阵）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落


} elseif ($npcc==1211) {
$xsbl=10;
//名字
$nname="【天阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1212) {
$xsbl=10;
//名字
$nname="【天阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1213) {
$xsbl=10;
//名字
$nname="【天阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1214) {
$xsbl=10;
//名字
$nname="【地阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1215) {
$xsbl=10;
//名字
$nname="【地阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1216) {
$xsbl=10;
//名字
$nname="【地阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

//经验
$npjy=100000000;//经验
include("./wj/hddl.php");
//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==1217) {
$xsbl=10;
//名字
$nname="【人阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1218) {
$xsbl=10;
//名字
$nname="【人阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1219) {
$xsbl=10;
//名字
$nname="【人阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1220) {
$xsbl=10;
//名字
$nname="【风阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");
//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1221) {
$xsbl=10;
//名字
$nname="【风阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1222) {
$xsbl=10;
//名字
$nname="【风阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1223) {
$xsbl=10;
//名字
$nname="【云阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1224) {
$xsbl=10;
//名字
$nname="【云阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1225) {
$xsbl=10;
//名字
$nname="【云阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1226) {
$xsbl=10;
//名字
$nname="【龙阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==1227) {
$xsbl=10;
//名字
$nname="【龙阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1228) {
$xsbl=10;
//名字
$nname="【龙阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



} elseif ($npcc==1229) {
$xsbl=10;
//名字
$nname="【虎阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1230) {
$xsbl=10;
//名字
$nname="【虎阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1231) {
$xsbl=10;
//名字
$nname="【虎阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率



$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



} elseif ($npcc==1232) {
$xsbl=10;
//名字
$nname="【神阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1233) {
$xsbl=10;
//名字
$nname="【神阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1234) {
$xsbl=10;
//名字
$nname="【神阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率



$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率




} elseif ($npcc==1235) {
$xsbl=10;
//名字
$nname="【鬼阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1236) {
$xsbl=10;
//名字
$nname="【鬼阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1237) {
$xsbl=10;
//名字
$nname="【鬼阵】守卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落


//经验
$npjy=100000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖仙佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=974;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖仙晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=975;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=976;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==1238) {
$xsbl=20;
//名字
$nname="【休门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率






} elseif ($npcc==1239) {
$xsbl=20;
//名字
$nname="【休门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1240) {
$xsbl=20;
//名字
$nname="【休门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1241) {
$xsbl=20;
//名字
$nname="【生门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1242) {
$xsbl=20;
//名字
$nname="【生门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1243) {
$xsbl=20;
//名字
$nname="【生门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1244) {
$xsbl=20;
//名字
$nname="【伤门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1245) {
$xsbl=20;
//名字
$nname="【伤门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1246) {
$xsbl=20;
//名字
$nname="【伤门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1247) {
$xsbl=20;
//名字
$nname="【杜门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1248) {
$xsbl=20;
//名字
$nname="【杜门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1249) {
$xsbl=20;
//名字
$nname="【杜门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1250) {
$xsbl=20;
//名字
$nname="【景门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1251) {
$xsbl=20;
//名字
$nname="【景门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1252) {
$xsbl=20;
//名字
$nname="【景门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1253) {
$xsbl=20;
//名字
$nname="【死门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1254) {
$xsbl=20;
//名字
$nname="【死门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1255) {
$xsbl=20;
//名字
$nname="【死门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1256) {
$xsbl=20;
//名字
$nname="【惊门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1257) {
$xsbl=20;
//名字
$nname="【惊门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1258) {
$xsbl=20;
//名字
$nname="【惊门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1259) {
$xsbl=20;
//名字
$nname="【开门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");
//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1260) {
$xsbl=20;
//名字
$nname="【开门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1261) {
$xsbl=20;
//名字
$nname="【开门】守将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=977;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=978;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=979;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1262) {
$xsbl=40;
//名字
$nname="【乾阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1263) {
$xsbl=40;
//名字
$nname="【乾阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1264) {
$xsbl=40;
//名字
$nname="【乾阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1265) {
$xsbl=40;
//名字
$nname="【震阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1266) {
$xsbl=40;
//名字
$nname="【震阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1267) {
$xsbl=40;
//名字
$nname="【震阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1268) {
$xsbl=40;
//名字
$nname="【坎阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1269) {
$xsbl=40;
//名字
$nname="【坎阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1270) {
$xsbl=40;
//名字
$nname="【坎阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1271) {
$xsbl=40;
//名字
$nname="【艮阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1272) {
$xsbl=40;
//名字
$nname="【艮阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1273) {
$xsbl=40;
//名字
$nname="【艮阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1274) {
$xsbl=40;
//名字
$nname="【坤阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1275) {
$xsbl=40;
//名字
$nname="【坤阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1276) {
$xsbl=40;
//名字
$nname="【坤阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1277) {
$xsbl=40;
//名字
$nname="【巽阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1278) {
$xsbl=40;
//名字
$nname="【巽阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1279) {
$xsbl=40;
//名字
$nname="【巽阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1280) {
$xsbl=40;
//名字
$nname="【离阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1281) {
$xsbl=40;
//名字
$nname="【离阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1282) {
$xsbl=40;
//名字
$nname="【离阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1283) {
$xsbl=40;
//名字
$nname="【兑阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1284) {
$xsbl=40;
//名字
$nname="【兑阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1285) {
$xsbl=40;
//名字
$nname="【兑阵】仙卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=200000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=980;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=981;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=982;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1286) {
$xsbl=60;
//名字
$nname="【天覆阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖混沌天佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=983;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌天晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=984;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌天器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=985;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1287) {
$xsbl=60;
//名字
$nname="【天覆阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌天佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=983;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌天晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=984;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌天器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=985;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1288) {
$xsbl=60;
//名字
$nname="【天覆阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌天佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=983;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌天晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=984;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌天器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=985;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1289) {
$xsbl=60;
//名字
$nname="【地载阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌天佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=983;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌天晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=984;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌天器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=985;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1290) {
$xsbl=60;
//名字
$nname="【地载阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌天佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=983;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌天晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=984;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌天器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=985;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1291) {
$xsbl=60;
//名字
$nname="【地载阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌天佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=983;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌天晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=984;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌天器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=985;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1292) {
$xsbl=60;
//名字
$nname="【风扬阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖混沌神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=986;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=987;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=988;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==1293) {
$xsbl=60;
//名字
$nname="【风扬阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=986;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=987;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=988;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1294) {
$xsbl=60;
//名字
$nname="【风扬阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");
//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=986;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=987;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=988;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1295) {
$xsbl=60;
//名字
$nname="【云垂阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=986;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=987;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=988;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1296) {
$xsbl=60;
//名字
$nname="【云垂阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=986;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=987;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=988;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1297) {
$xsbl=60;
//名字
$nname="【云垂阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=986;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=987;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=988;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1298) {
$xsbl=60;
//名字
$nname="【龙飞阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=986;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=987;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=988;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1299) {
$xsbl=60;
//名字
$nname="【龙飞阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=986;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=987;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=988;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1300) {
$xsbl=60;
//名字
$nname="【龙飞阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=986;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=987;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=988;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



} else{
$nccp=2;
echo "<font color=black>没有这个id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}















?>



