<?php
if ($npcc==701) {
//名字
$nname="野蛮丫头";
//等级
$ndj=12;
//HP
$nhp=800;
//MAXHP
$nmaxhp=800;
//MP
$nmp=300;
//MAXMP
$nmaxmp=300;
//攻击
$ngj=786;
//魔攻
$nmg=434;
//防御
$nfy=213;
//魔防
$nmf=213;
//冰攻
$nbg=17;
//火攻
$nhg=17;
//雷攻
$nlg=17;
//冰防
$nbf=9;
//火防
$nhf=9;
//雷防
$nlf=9;
//NPC被攻击说话语
$ntake="啊~~~哒哒~~~哒~~~~";

		} elseif ($npcc==702) {
//名字
$nname="众酒客";
//等级
$ndj=10;
//HP
$nhp=200;
//MAXHP
$nmaxhp=200;
//MP
$nmp=50;
//MAXMP
$nmaxmp=50;
//攻击
$ngj=1856;
//魔攻
$nmg=434;
//防御
$nfy=186;
//魔防
$nmf=213;
//冰攻
$nbg=15;
//火攻
$nhg=15;
//雷攻
$nlg=15;
//冰防
$nbf=15;
//火防
$nhf=15;
//雷防
$nlf=15;
//NPC被攻击说话语
$ntake="啊~~~哒哒~~~哒~~~~";

		} elseif ($npcc==703) {
//名字
$nname="项长老";
//等级
$ndj=50;
//HP
$nhp=10000;
//MAXHP
$nmaxhp=10000;
//MP
$nmp=2000;
//MAXMP
$nmaxmp=2000;
//攻击
$ngj=9754;
//魔攻
$nmg=9754;
//防御
$nfy=3775;
//魔防
$nmf=3775;
//冰攻
$nbg=60;
//火攻
$nhg=60;
//雷攻
$nlg=60;
//冰防
$nbf=40;
//火防
$nhf=40;
//雷防
$nlf=40;
//NPC被攻击说话语
$ntake="老夫倒要看看你们这些娃娃有多大能耐～";

		} elseif ($npcc==704) {
//名字
$nname="凌月";
//等级
$ndj=50;
//HP
$nhp=9000;
//MAXHP
$nmaxhp=9000;
//MP
$nmp=1000;
//MAXMP
$nmaxmp=1000;
//攻击
$ngj=11654;
//魔攻
$nmg=11654;
//防御
$nfy=4065;
//魔防
$nmf=4065;
//冰攻
$nbg=70;
//火攻
$nhg=70;
//雷攻
$nlg=70;
//冰防
$nbf=50;
//火防
$nhf=50;
//雷防
$nlf=50;
//NPC被攻击说话语
$ntake="挡我者～死～～";

		} elseif ($npcc==705) {
//名字
$nname="绿衣女子";
//等级
$ndj=45;
//HP
$nhp=7000;
//MAXHP
$nmaxhp=7000;
//MP
$nmp=1000;
//MAXMP
$nmaxmp=1000;
//攻击
$ngj=10654;
//魔攻
$nmg=10654;
//防御
$nfy=4065;
//魔防
$nmf=4065;
//冰攻
$nbg=60;
//火攻
$nhg=60;
//雷攻
$nlg=60;
//冰防
$nbf=40;
//火防
$nhf=40;
//雷防
$nlf=40;
//NPC被攻击说话语
$ntake="挡我者～死～～";







		} elseif ($npcc==706) {
//名字
$nname="飞贼";
//等级
$ndj=40;
//HP
$nhp=3000;
//MAXHP
$nmaxhp=3000;
//MP
$nmp=500;
//MAXMP
$nmaxmp=500;
//攻击
$ngj=9754;
//魔攻
$nmg=9754;
//防御
$nfy=3775;
//魔防
$nmf=3775;
//冰攻
$nbg=60;
//火攻
$nhg=60;
//雷攻
$nlg=60;
//冰防
$nbf=40;
//火防
$nhf=40;
//雷防
$nlf=40;
//NPC被攻击说话语
$ntake="挡我者～死～～";

		} elseif ($npcc==707) {
//名字
$nname="萧晓月";
//等级
$ndj=15;
//HP
$nhp=2300;
//MAXHP
$nmaxhp=2300;
//MP
$nmp=260;
//MAXMP
$nmaxmp=260;
//攻击
$ngj=2804;
//魔攻
$nmg=1654;
//防御
$nfy=1284;
//魔防
$nmf=213;
//冰攻
$nbg=15;
//火攻
$nhg=15;
//雷攻
$nlg=15;
//冰防
$nbf=15;
//火防
$nhf=15;
//雷防
$nlf=15;
//NPC被攻击说话语
$ntake="呆瓜小贼～看招～";

		} elseif ($npcc==708) {
//名字
$nname="清风道长";
//等级
$ndj=40;
//HP
$nhp=8000;
//MAXHP
$nmaxhp=8000;
//MP
$nmp=1000;
//MAXMP
$nmaxmp=1000;
//攻击
$ngj=7000;
//魔攻
$nmg=7000;
//防御
$nfy=3775;
//魔防
$nmf=3775;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=50;
//火防
$nhf=50;
//雷防
$nlf=50;
//NPC被攻击说话语
$ntake="不做道士就别想走～";

		} elseif ($npcc==709) {
//名字
$nname="狐妖女";
//等级
$ndj=25;
//HP
$nhp=6000;
//MAXHP
$nmaxhp=6000;
//MP
$nmp=500;
//MAXMP
$nmaxmp=500;
//攻击
$ngj=4286;
//魔攻
$nmg=4286;
//防御
$nfy=2675;
//魔防
$nmf=2675;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=40;
//火防
$nhf=40;
//雷防
$nlf=40;
//NPC被攻击说话语
$ntake="还我相公性命～死吧！";

		} elseif ($npcc==710) {

//名字
$nname="蛇妖男";
//等级
$ndj=25;
//HP
$nhp=5000;
//MAXHP
$nmaxhp=5000;
//MP
$nmp=500;
//MAXMP
$nmaxmp=500;
//攻击
$ngj=3300;
//魔攻
$nmg=2897;
//防御
$nfy=2200;
//魔防
$nmf=213;
//冰攻
$nbg=33;
//火攻
$nhg=33;
//雷攻
$nlg=33;
//冰防
$nbf=33;
//火防
$nhf=33;
//雷防
$nlf=33;
//NPC被攻击说话语
$ntake="自己送上门来～看招～";

	} elseif ($npcc==711) {

//名字
$nname="喽罗";
//等级
$ndj=20;
//HP
$nhp=2000;
//MAXHP
$nmaxhp=2000;
//MP
$nmp=500;
//MAXMP
$nmaxmp=500;
//攻击
$ngj=6867;
//魔攻
$nmg=6867;
//防御
$nfy=3775;
//魔防
$nmf=3775;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=20;
//火防
$nhf=20;
//雷防
$nlf=20;
//NPC被攻击说话语
$ntake="你们竟敢挑战我们大王！";
	} elseif ($npcc==712) {
//名字
$nname="赤血龙王";
//等级
$ndj=50;
//HP
$nhp=10000;
//MAXHP
$nmaxhp=10000;
//MP
$nmp=2000;
//MAXMP
$nmaxmp=2000;
//攻击
$ngj=9867;
//魔攻
$nmg=9867;
//防御
$nfy=4775;
//魔防
$nmf=4775;
//冰攻
$nbg=60;
//火攻
$nhg=60;
//雷攻
$nlg=60;
//冰防
$nbf=50;
//火防
$nhf=50;
//雷防
$nlf=50;
//NPC被攻击说话语
$ntake="你们这些愚蠢的人类会付出代价的！";

	} elseif ($npcc==713) {
//名字
$nname="酒鬼";
//等级
$ndj=60;
//HP
$nhp=$ndj*2000;
//MAXHP
$nmaxhp=$ndj*2000;
//MP
$nmp=$ndj*50;
//MAXMP
$nmaxmp=$ndj*50;
//攻击
$ngj=$ndj*211;
//魔攻
$nmg=$ndj*222;
//防御
$nfy=$ndj*232;
//魔防
$nmf=$ndj*242;
//冰攻
$nbg=$ndj;
//火攻
$nhg=$ndj;
//雷攻
$nlg=$ndj;
//冰防
$nbf=$ndj;
//火防
$nhf=$ndj;
//雷防
$nlf=$ndj;
//NPC被攻击说话语
$ntake="啊~~~哒哒~~~哒~~~~";



	} elseif ($npcc==714) {

//名字
$nname="守门兵俑";
//等级
$ndj=40;
//HP
$nhp=5000;
//MAXHP
$nmaxhp=5000;
//MP
$nmp=400;
//MAXMP
$nmaxmp=400;
//攻击
$ngj=6754;
//魔攻
$nmg=6754;
//防御
$nfy=4775;
//魔防
$nmf=4775;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=30;
//火防
$nhf=30;
//雷防
$nlf=30;
//NPC被攻击说话语
$ntake="保护皇陵～护驾～杀！";

	} elseif ($npcc==715) {

//名字
$nname="【受气包】";
//等级
$ndj=40;
//HP
$nhp=1000000000;
//MAXHP
$nmaxhp=1000000000;
//MP
$nmp=8000000;
//MAXMP
$nmaxmp=8000000;
//攻击
$ngj=6754;
//魔攻
$nmg=6754;
//防御
$nfy=4775;
//魔防
$nmf=4775;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=30;
//火防
$nhf=30;
//雷防
$nlf=30;
//NPC被攻击说话语
$ntake="随便打反正你打不死我！我也不想打你！！";
	} elseif ($npcc==716) {

//名字
$nname="【经验怪】";
//等级
$ndj=40;
//HP
$nhp=100000;
//MAXHP
$nmaxhp=100000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=6754;
//魔攻
$nmg=6754;
//防御
$nfy=4775;
//魔防
$nmf=4775;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=30;
//火防
$nhf=30;
//雷防
$nlf=30;
//NPC被攻击说话语
$ntake="打我得经验";
//经验
$npjy=66666666;//经验


	} elseif ($npcc==717) {

//名字
$nname="【重置灵牌怪】";
//等级
$ndj=40;
//HP
$nhp=100000;
//MAXHP
$nmaxhp=100000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=6754;
//魔攻
$nmg=6754;
//防御
$nfy=4775;
//魔防
$nmf=4775;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=30;
//火防
$nhf=30;
//雷防
$nlf=30;
//NPC被攻击说话语
$ntake="打我得副本重置派";


$wpdz1[]="【副本重置令】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=409;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=80;//	多少爆率


//死亡掉落
$bossdj=4;//boss级别
//经验
$npjy=$ndj*100;//经验
include("./wj/hddl.php");

$wpdz1[]="〖银宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=278;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=$bossdjdv;//	多少爆率

$wpdz1[]="小幸运草";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=126;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=$bossdjdv;//	多少爆率
$wpdz1[]="【宠物岛门票】";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=488;//物品id
$wpdz4[]=100;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=$bossdjdv;//	多少爆率
if ($bossdj==1) {
include("./wj/fb4jbs-1.php");
} elseif ($bossdj==2) {
include("./wj/fb4jbs-2.php");	
} elseif ($bossdj==3) {
include("./wj/fb4jbs-3.php");
} elseif ($bossdj==4) {
include("./wj/fb4jbs-4.php");	
} else {
}
//死亡掉落


	} elseif ($npcc==718) {

//名字
$nname="宠物岛传送员";
//等级
$ndj=40;
//HP
$nhp=100000;
//MAXHP
$nmaxhp=100000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=6754;
//魔攻
$nmg=6754;
//防御
$nfy=4775;
//魔防
$nmf=4775;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=30;
//火防
$nhf=30;
//雷防
$nlf=30;
//NPC被攻击说话语
$ntake="想要奇珍异兽，找我啊？干嘛要动粗";

	} elseif ($npcc==719) {//宠物

//名字
$nname="【花斑虎王】";
//等级
$ndj=10;
//HP
$nhp=5000;
//MAXHP
$nmaxhp=5000;
//MP
$nmp=1000;
//MAXMP
$nmaxmp=1000;
//攻击
$ngj=2000;
//魔攻
$nmg=2000;
//防御
$nfy=3000;
//魔防
$nmf=2000;
//冰攻
$nbg=10;
//火攻
$nhg=10;
//雷攻
$nlg=10;
//冰防
$nbf=10;
//火防
$nhf=10;
//雷防
$nlf=10;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=1;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率



	} elseif ($npcc==720) {//宠物

//名字
$nname="【雪豹大王】";
//等级
$ndj=10;
//HP
$nhp=6000;
//MAXHP
$nmaxhp=6000;
//MP
$nmp=1000;
//MAXMP
$nmaxmp=1000;
//攻击
$ngj=2500;
//魔攻
$nmg=2000;
//防御
$nfy=3500;
//魔防
$nmf=2000;
//冰攻
$nbg=10;
//火攻
$nhg=10;
//雷攻
$nlg=10;
//冰防
$nbf=10;
//火防
$nhf=10;
//雷防
$nlf=10;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=2;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率



	} elseif ($npcc==721) {//宠物

//名字
$nname="【狂狼大王】";
//等级
$ndj=15;
//HP
$nhp=8000;
//MAXHP
$nmaxhp=8000;
//MP
$nmp=2000;
//MAXMP
$nmaxmp=2000;
//攻击
$ngj=4000;
//魔攻
$nmg=4000;
//防御
$nfy=4000;
//魔防
$nmf=400;
//冰攻
$nbg=15;
//火攻
$nhg=15;
//雷攻
$nlg=15;
//冰防
$nbf=15;
//火防
$nhf=15;
//雷防
$nlf=15;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=3;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率
	} elseif ($npcc==722) {//宠物

//名字
$nname="【双翅飞虎】";
//等级
$ndj=30;
//HP
$nhp=10000;
//MAXHP
$nmaxhp=10000;
//MP
$nmp=3000;
//MAXMP
$nmaxmp=3000;
//攻击
$ngj=5252;
//魔攻
$nmg=5252;
//防御
$nfy=5252;
//魔防
$nmf=5252;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=50;
//火防
$nhf=50;
//雷防
$nlf=50;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=4;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率
	} elseif ($npcc==723) {//宠物

//名字
$nname="【噬月天狼】";
//等级
$ndj=30;
//HP
$nhp=10000;
//MAXHP
$nmaxhp=10000;
//MP
$nmp=3000;
//MAXMP
$nmaxmp=3000;
//攻击
$ngj=5252;
//魔攻
$nmg=5252;
//防御
$nfy=5252;
//魔防
$nmf=5252;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=50;
//火防
$nhf=50;
//雷防
$nlf=50;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=5;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率


	} elseif ($npcc==724) {//宠物

//名字
$nname="【统帅佣】";
//等级
$ndj=30;
//HP
$nhp=10000;
//MAXHP
$nmaxhp=10000;
//MP
$nmp=3000;
//MAXMP
$nmaxmp=3000;
//攻击
$ngj=5252;
//魔攻
$nmg=5252;
//防御
$nfy=5252;
//魔防
$nmf=5252;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=50;
//火防
$nhf=50;
//雷防
$nlf=50;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=6;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率


	} elseif ($npcc==725) {//宠物

//名字
$nname="【通天神鼠】";
//等级
$ndj=30;
//HP
$nhp=10000;
//MAXHP
$nmaxhp=10000;
//MP
$nmp=3000;
//MAXMP
$nmaxmp=3000;
//攻击
$ngj=5252;
//魔攻
$nmg=5252;
//防御
$nfy=5252;
//魔防
$nmf=5252;
//冰攻
$nbg=50;
//火攻
$nhg=50;
//雷攻
$nlg=50;
//冰防
$nbf=50;
//火防
$nhf=50;
//雷防
$nlf=50;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=7;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率


	} elseif ($npcc==726) {//宠物

//名字
$nname="【混沌战神】";
//等级
$ndj=150;
//HP
$nhp=1000000;
//MAXHP
$nmaxhp=1000000;
//MP
$nmp=3000;
//MAXMP
$nmaxmp=3000;
//攻击
$ngj=505051;
//魔攻
$nmg=505051;
//防御
$nfy=505051;
//魔防
$nmf=5252;
//冰攻
$nbg=150;
//火攻
$nhg=150;
//雷攻
$nlg=150;
//冰防
$nbf=150;
//火防
$nhf=150;
//雷防
$nlf=150;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=8;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率


	} elseif ($npcc==727) {//宠物

//名字
$nname="【九天玄女】";
//等级
$ndj=150;
//HP
$nhp=1000000;
//MAXHP
$nmaxhp=1000000;
//MP
$nmp=3000;
//MAXMP
$nmaxmp=3000;
//攻击
$ngj=505051;
//魔攻
$nmg=505051;
//防御
$nfy=505051;
//魔防
$nmf=5252;
//冰攻
$nbg=150;
//火攻
$nhg=150;
//雷攻
$nlg=150;
//冰防
$nbf=150;
//火防
$nhf=150;
//雷防
$nlf=150;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=9;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率

	} elseif ($npcc==728) {//宠物

//名字
$nname="【五行裂云兽】";
//等级
$ndj=150;
//HP
$nhp=1000000;
//MAXHP
$nmaxhp=1000000;
//MP
$nmp=3000;
//MAXMP
$nmaxmp=3000;
//攻击
$ngj=505051;
//魔攻
$nmg=505051;
//防御
$nfy=505051;
//魔防
$nmf=5252;
//冰攻
$nbg=150;
//火攻
$nhg=150;
//雷攻
$nlg=150;
//冰防
$nbf=150;
//火防
$nhf=150;
//雷防
$nlf=150;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=10;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率

	} elseif ($npcc==729) {//宠物

//名字
$nname="【九尾妖狐】";
//等级
$ndj=200;
//HP
$nhp=3000000;
//MAXHP
$nmaxhp=3000000;
//MP
$nmp=3000;
//MAXMP
$nmaxmp=3000;
//攻击
$ngj=1585258;
//魔攻
$nmg=1585258;
//防御
$nfy=1025250;
//魔防
$nmf=5252;
//冰攻
$nbg=230;
//火攻
$nhg=230;
//雷攻
$nlg=230;
//冰防
$nbf=230;
//火防
$nhf=230;
//雷防
$nlf=230;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=11;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率


	} elseif ($npcc==730) {

//名字
$nname="宠行天下";
//等级
$ndj=180;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=674554;
//魔攻
$nmg=674554;
//防御
$nfy=471275;
//魔防
$nmf=471275;
//冰攻
$nbg=200;
//火攻
$nhg=200;
//雷攻
$nlg=200;
//冰防
$nbf=200;
//火防
$nhf=200;
//雷防
$nlf=200;
//NPC被攻击说话语
$ntake="找死？是吧！";



} elseif ($npcc==731) {//〖瞌睡虫〗（典藏版）

//名字
$nname="〖瞌睡虫〗（典藏版）";
//等级
$ndj=200;
//HP
$nhp=3000000;
//MAXHP
$nmaxhp=3000000;
//MP
$nmp=3000;
//MAXMP
$nmaxmp=3000;
//攻击
$ngj=1585258;
//魔攻
$nmg=1585258;
//防御
$nfy=1025250;
//魔防
$nmf=5252;
//冰攻
$nbg=230;
//火攻
$nhg=230;
//雷攻
$nlg=230;
//冰防
$nbf=230;
//火防
$nhf=230;
//雷防
$nlf=230;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=12;//宠物的ID
$bzgl=50;//被捕捉到的概率
$tpgl=50;//逃跑概率





	} elseif ($npcc==732) {

//名字
$nname="大唐国师";
//等级
$ndj=180;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=674554;
//魔攻
$nmg=674554;
//防御
$nfy=471275;
//魔防
$nmf=471275;
//冰攻
$nbg=200;
//火攻
$nhg=200;
//雷攻
$nlg=200;
//冰防
$nbf=200;
//火防
$nhf=200;
//雷防
$nlf=200;
//NPC被攻击说话语
$ntake="找死？是吧！";


} elseif ($npcc==733) {

//名字
$nname="女儿国国师";
//等级
$ndj=180;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=674554;
//魔攻
$nmg=674554;
//防御
$nfy=471275;
//魔防
$nmf=471275;
//冰攻
$nbg=200;
//火攻
$nhg=200;
//雷攻
$nlg=200;
//冰防
$nbf=200;
//火防
$nhf=200;
//雷防
$nlf=200;
//NPC被攻击说话语
$ntake="找死？是吧！";

} elseif ($npcc==734) {

//名字
$nname="宝象国国师";
//等级
$ndj=180;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=674554;
//魔攻
$nmg=674554;
//防御
$nfy=471275;
//魔防
$nmf=471275;
//冰攻
$nbg=200;
//火攻
$nhg=200;
//雷攻
$nlg=200;
//冰防
$nbf=200;
//火防
$nhf=200;
//雷防
$nlf=200;
//NPC被攻击说话语
$ntake="找死？是吧！";


} elseif ($npcc==735) {

//名字
$nname="万恶的班主任（暑期活动）";
//等级
$ndj=180;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=674554;
//魔攻
$nmg=674554;
//防御
$nfy=471275;
//魔防
$nmf=471275;
//冰攻
$nbg=200;
//火攻
$nhg=200;
//雷攻
$nlg=200;
//冰防
$nbf=200;
//火防
$nhf=200;
//雷防
$nlf=200;
//NPC被攻击说话语
$ntake="找死？是吧！";



} elseif ($npcc==736) {

//名字
$nname="老夫子（才子印记兑换）";
//等级
$ndj=180;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=674554;
//魔攻
$nmg=674554;
//防御
$nfy=471275;
//魔防
$nmf=471275;
//冰攻
$nbg=200;
//火攻
$nhg=200;
//雷攻
$nlg=200;
//冰防
$nbf=200;
//火防
$nhf=200;
//雷防
$nlf=200;
//NPC被攻击说话语
$ntake="找死？是吧！";



} elseif ($npcc==737) {

//名字
$nname="【测试人偶】";
//等级
$ndj=1;
//HP
$nhp=10000000000000;
//MAXHP
$nmaxhp=1000000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=2264;
//魔攻
$nmg=100;
//防御
$nfy=80;
//魔防
$nmf=10000;
//冰攻
$nbg=1;
//火攻
$nhg=1;
//雷攻
$nlg=1;
//冰防
$nbf=1;
//火防
$nhf=1;
//雷防
$nlf=1;
//NPC被攻击说话语
$ntake="找死？是吧！";




} elseif ($npcc==738) {

//名字
$nname="【烈焰土熊】";
//等级
$ndj=100;
//HP
$nhp=500000;
//MAXHP
$nmaxhp=500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=112783;
//魔攻
$nmg=112783;
//防御
$nfy=112783;
//魔防
$nmf=112783;
//冰攻
$nbg=100;
//火攻
$nhg=100;
//雷攻
$nlg=100;
//冰防
$nbf=100;
//火防
$nhf=100;
//雷防
$nlf=100;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率



include("./wj/fb3jbs-2.php");

//死亡掉落


} elseif ($npcc==739) {

//名字
$nname="【烈焰土熊】";
//等级
$ndj=100;
//HP
$nhp=500000;
//MAXHP
$nmaxhp=500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=112783;
//魔攻
$nmg=112783;
//防御
$nfy=112783;
//魔防
$nmf=112783;
//冰攻
$nbg=100;
//火攻
$nhg=100;
//雷攻
$nlg=100;
//冰防
$nbf=100;
//火防
$nhf=100;
//雷防
$nlf=100;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率




include("./wj/fb3jbs-2.php");

//死亡掉落





} elseif ($npcc==740) {

//名字
$nname="【大地之熊】";
//等级
$ndj=100;
//HP
$nhp=650000;
//MAXHP
$nmaxhp=650000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=152783;
//魔攻
$nmg=152783;
//防御
$nfy=152783;
//魔防
$nmf=152783;
//冰攻
$nbg=$ndj+10;
//火攻
$nhg=$ndj+10;
//雷攻
$nlg=$ndj+10;
//冰防
$nbf=$ndj+10;
//火防
$nhf=$ndj+10;
//雷防
$nlf=$ndj+10;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


include("./wj/fb3jbs-4.php");

//死亡掉落


} elseif ($npcc==741) {

//名字
$nname="【玄冰毒蚁】";
//等级
$ndj=110;
//HP
$nhp=700000;
//MAXHP
$nmaxhp=700000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=178644;
//魔攻
$nmg=178644;
//防御
$nfy=178644;
//魔防
$nmf=178644;
//冰攻
$nbg=$ndj+20;
//火攻
$nhg=$ndj+20;
//雷攻
$nlg=$ndj+20;
//冰防
$nbf=$ndj+20;
//火防
$nhf=$ndj+20;
//雷防
$nlf=$ndj+20;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率



include("./wj/fb3jbs-2.php");

//死亡掉落


} elseif ($npcc==742) {

//名字
$nname="【玄冰毒蚁】";
//等级
$ndj=110;
//HP
$nhp=700000;
//MAXHP
$nmaxhp=700000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=178644;
//魔攻
$nmg=178644;
//防御
$nfy=178644;
//魔防
$nmf=178644;
//冰攻
$nbg=$ndj+20;
//火攻
$nhg=$ndj+20;
//雷攻
$nlg=$ndj+20;
//冰防
$nbf=$ndj+20;
//火防
$nhf=$ndj+20;
//雷防
$nlf=$ndj+20;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

include("./wj/fb3jbs-2.php");

//死亡掉落











} elseif ($npcc==743) {

//名字
$nname="【噬魂蚁王】";
//等级
$ndj=110;
//HP
$nhp=1000000;
//MAXHP
$nmaxhp=1000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=213453;
//魔攻
$nmg=213453;
//防御
$nfy=213453;
//魔防
$nmf=213453;
//冰攻
$nbg=$ndj+30;
//火攻
$nhg=$ndj+30;
//雷攻
$nlg=$ndj+30;
//冰防
$nbf=$ndj+30;
//火防
$nhf=$ndj+30;
//雷防
$nlf=$ndj+30;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

include("./wj/fb3jbs-4.php");

//死亡掉落







} elseif ($npcc==744) {

//名字
$nname="【金丝蚕】";
//等级
$ndj=120;
//HP
$nhp=1200000;
//MAXHP
$nmaxhp=1200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=234234;
//魔攻
$nmg=234234;
//防御
$nfy=234234;
//魔防
$nmf=234234;
//冰攻
$nbg=$ndj+40;
//火攻
$nhg=$ndj+40;
//雷攻
$nlg=$ndj+40;
//冰防
$nbf=$ndj+40;
//火防
$nhf=$ndj+40;
//雷防
$nlf=$ndj+40;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

include("./wj/fb3jbs-2.php");

//死亡掉落





} elseif ($npcc==745) {

//名字
$nname="【金丝蚕】";
//等级
$ndj=120;
//HP
$nhp=1200000;
//MAXHP
$nmaxhp=1200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=234234;
//魔攻
$nmg=234234;
//防御
$nfy=234234;
//魔防
$nmf=234234;
//冰攻
$nbg=$ndj+40;
//火攻
$nhg=$ndj+40;
//雷攻
$nlg=$ndj+40;
//冰防
$nbf=$ndj+40;
//火防
$nhf=$ndj+40;
//雷防
$nlf=$ndj+40;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

include("./wj/fb3jbs-2.php");

//死亡掉落






} elseif ($npcc==746) {

//名字
$nname="【冰火蚕皇】";
//等级
$ndj=120;
//HP
$nhp=1500000;
//MAXHP
$nmaxhp=1500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=312343;
//魔攻
$nmg=312343;
//防御
$nfy=312343;
//魔防
$nmf=312343;
//冰攻
$nbg=$ndj+50;
//火攻
$nhg=$ndj+50;
//雷攻
$nlg=$ndj+50;
//冰防
$nbf=$ndj+50;
//火防
$nhf=$ndj+50;
//雷防
$nlf=$ndj+50;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

include("./wj/fb3jbs-4.php");

//死亡掉落


} elseif ($npcc==747) {

//名字
$nname="【风影豹】";
//等级
$ndj=130;
//HP
$nhp=2000000;
//MAXHP
$nmaxhp=2000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=335463;
//魔攻
$nmg=335463;
//防御
$nfy=335463;
//魔防
$nmf=335463;
//冰攻
$nbg=$ndj+60;
//火攻
$nhg=$ndj+60;
//雷攻
$nlg=$ndj+60;
//冰防
$nbf=$ndj+60;
//火防
$nhf=$ndj+60;
//雷防
$nlf=$ndj+60;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");

//死亡掉落


} elseif ($npcc==748) {

//名字
$nname="【风影豹】";
//等级
$ndj=130;
//HP
$nhp=2000000;
//MAXHP
$nmaxhp=2000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=335463;
//魔攻
$nmg=335463;
//防御
$nfy=335463;
//魔防
$nmf=335463;
//冰攻
$nbg=$ndj+60;
//火攻
$nhg=$ndj+60;
//雷攻
$nlg=$ndj+60;
//冰防
$nbf=$ndj+60;
//火防
$nhf=$ndj+60;
//雷防
$nlf=$ndj+60;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");

//死亡掉落




} elseif ($npcc==749) {

//名字
$nname="【迅影斑斓豹】";
//等级
$ndj=130;
//HP
$nhp=2300000;
//MAXHP
$nmaxhp=2300000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=415432;
//魔攻
$nmg=415432;
//防御
$nfy=415432;
//魔防
$nmf=415432;
//冰攻
$nbg=$ndj+70;
//火攻
$nhg=$ndj+70;
//雷攻
$nlg=$ndj+70;
//冰防
$nbf=$ndj+70;
//火防
$nhf=$ndj+70;
//雷防
$nlf=$ndj+70;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

include("./wj/fb4jbs-4.php");





















//死亡掉落



} elseif ($npcc==750) {

//名字
$nname="【魔音蝙蝠】";
//等级
$ndj=140;
//HP
$nhp=2800000;
//MAXHP
$nmaxhp=2800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=465432;
//魔攻
$nmg=465432;
//防御
$nfy=465432;
//魔防
$nmf=465432;
//冰攻
$nbg=$ndj+80;
//火攻
$nhg=$ndj+80;
//雷攻
$nlg=$ndj+80;
//冰防
$nbf=$ndj+80;
//火防
$nhf=$ndj+80;
//雷防
$nlf=$ndj+80;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");




} elseif ($npcc==751) {

//名字
$nname="【魔音蝙蝠】";
//等级
$ndj=140;
//HP
$nhp=2800000;
//MAXHP
$nmaxhp=2800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=465432;
//魔攻
$nmg=465432;
//防御
$nfy=465432;
//魔防
$nmf=465432;
//冰攻
$nbg=$ndj+80;
//火攻
$nhg=$ndj+80;
//雷攻
$nlg=$ndj+80;
//冰防
$nbf=$ndj+80;
//火防
$nhf=$ndj+80;
//雷防
$nlf=$ndj+80;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");








} elseif ($npcc==752) {

//名字
$nname="【七翼暗金蝙王】";
//等级
$ndj=140;
//HP
$nhp=3000000;
//MAXHP
$nmaxhp=3000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=513332;
//魔攻
$nmg=513332;
//防御
$nfy=513332;
//魔防
$nmf=513332;
//冰攻
$nbg=$ndj+90;
//火攻
$nhg=$ndj+90;
//雷攻
$nlg=$ndj+90;
//冰防
$nbf=$ndj+90;
//火防
$nhf=$ndj+90;
//雷防
$nlf=$ndj+90;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$bbdlsl= rand(1, 2);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

include("./wj/fb4jbs-4.php");

} elseif ($npcc==753) {

//名字
$nname="【紫尾貂】";
//等级
$ndj=150;
//HP
$nhp=3200000;
//MAXHP
$nmaxhp=3200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=533332;
//魔攻
$nmg=533332;
//防御
$nfy=533332;
//魔防
$nmf=533332;
//冰攻
$nbg=$ndj+100;
//火攻
$nhg=$ndj+100;
//雷攻
$nlg=$ndj+100;
//冰防
$nbf=$ndj+100;
//火防
$nhf=$ndj+100;
//雷防
$nlf=$ndj+100;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");

} elseif ($npcc==754) {

//名字
$nname="【紫尾貂】";
//等级
$ndj=150;
//HP
$nhp=3200000;
//MAXHP
$nmaxhp=3200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=533332;
//魔攻
$nmg=533332;
//防御
$nfy=533332;
//魔防
$nmf=533332;
//冰攻
$nbg=$ndj+100;
//火攻
$nhg=$ndj+100;
//雷攻
$nlg=$ndj+100;
//冰防
$nbf=$ndj+100;
//火防
$nhf=$ndj+100;
//雷防
$nlf=$ndj+100;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");


} elseif ($npcc==755) {

//名字
$nname="【双翅紫尾貂】";
//等级
$ndj=150;
//HP
$nhp=3500000;
//MAXHP
$nmaxhp=3500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=605433;
//魔攻
$nmg=605433;
//防御
$nfy=605433;
//魔防
$nmf=605433;
//冰攻
$nbg=$ndj+110;
//火攻
$nhg=$ndj+110;
//雷攻
$nlg=$ndj+110;
//冰防
$nbf=$ndj+110;
//火防
$nhf=$ndj+110;
//雷防
$nlf=$ndj+110;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=6;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

include("./wj/fb4jbs-4.php");

} elseif ($npcc==756) {

//名字
$nname="【堕落魔蛹】";
//等级
$ndj=150;
//HP
$nhp=4000000;
//MAXHP
$nmaxhp=4000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=645433;
//魔攻
$nmg=645433;
//防御
$nfy=645433;
//魔防
$nmf=645433;
//冰攻
$nbg=$ndj+120;
//火攻
$nhg=$ndj+120;
//雷攻
$nlg=$ndj+120;
//冰防
$nbf=$ndj+120;
//火防
$nhf=$ndj+120;
//雷防
$nlf=$ndj+120;
//NPC被攻击说话语
$ntake="找死？是吧！";





//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");





} elseif ($npcc==757) {

//名字
$nname="【堕落魔蛹】";
//等级
$ndj=150;
//HP
$nhp=4000000;
//MAXHP
$nmaxhp=4000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=645433;
//魔攻
$nmg=645433;
//防御
$nfy=645433;
//魔防
$nmf=645433;
//冰攻
$nbg=$ndj+120;
//火攻
$nhg=$ndj+120;
//雷攻
$nlg=$ndj+120;
//冰防
$nbf=$ndj+120;
//火防
$nhf=$ndj+120;
//雷防
$nlf=$ndj+120;
//NPC被攻击说话语
$ntake="找死？是吧！";





//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");










} elseif ($npcc==758) {

//名字
$nname="【深渊邪蛹王】";
//等级
$ndj=150;
//HP
$nhp=4200000;
//MAXHP
$nmaxhp=4200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=705433;
//魔攻
$nmg=705433;
//防御
$nfy=705433;
//魔防
$nmf=705433;
//冰攻
$nbg=$ndj+130;
//火攻
$nhg=$ndj+130;
//雷攻
$nlg=$ndj+130;
//冰防
$nbf=$ndj+130;
//火防
$nhf=$ndj+130;
//雷防
$nlf=$ndj+130;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=7;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


include("./wj/fb5jbs-4.php");




} elseif ($npcc==759) {

//名字
$nname="【幽冥火狐】";
//等级
$ndj=150;
//HP
$nhp=4200000;
//MAXHP
$nmaxhp=4200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=735433;
//魔攻
$nmg=735433;
//防御
$nfy=735433;
//魔防
$nmf=735433;
//冰攻
$nbg=$ndj+140;
//火攻
$nhg=$ndj+140;
//雷攻
$nlg=$ndj+140;
//冰防
$nbf=$ndj+140;
//火防
$nhf=$ndj+140;
//雷防
$nlf=$ndj+140;
//NPC被攻击说话语
$ntake="找死？是吧！";



//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");



} elseif ($npcc==760) {

//名字
$nname="【幽冥火狐】";
//等级
$ndj=150;
//HP
$nhp=4200000;
//MAXHP
$nmaxhp=4200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=735433;
//魔攻
$nmg=735433;
//防御
$nfy=735433;
//魔防
$nmf=735433;
//冰攻
$nbg=$ndj+140;
//火攻
$nhg=$ndj+140;
//雷攻
$nlg=$ndj+140;
//冰防
$nbf=$ndj+140;
//火防
$nhf=$ndj+140;
//雷防
$nlf=$ndj+140;
//NPC被攻击说话语
$ntake="找死？是吧！";



//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");
} elseif ($npcc==761) {

//名字
$nname="【九尾天狐】";
//等级
$ndj=150;
//HP
$nhp=4500000;
//MAXHP
$nmaxhp=4500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=838833;
//魔攻
$nmg=838833;
//防御
$nfy=838833;
//魔防
$nmf=838833;
//冰攻
$nbg=$ndj+150;
//火攻
$nhg=$ndj+150;
//雷攻
$nlg=$ndj+150;
//冰防
$nbf=$ndj+150;
//火防
$nhf=$ndj+150;
//雷防
$nlf=$ndj+150;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=9;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


include("./wj/fb5jbs-4.php");

} elseif ($npcc==762) {

//名字
$nname="【暗夜火鹰】";
//等级
$ndj=150;
//HP
$nhp=4800000;
//MAXHP
$nmaxhp=4800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=938833;
//魔攻
$nmg=938833;
//防御
$nfy=938833;
//魔防
$nmf=938833;
//冰攻
$nbg=$ndj+160;
//火攻
$nhg=$ndj+160;
//雷攻
$nlg=$ndj+160;
//冰防
$nbf=$ndj+160;
//火防
$nhf=$ndj+160;
//雷防
$nlf=$ndj+160;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");



} elseif ($npcc==763) {

//名字
$nname="【暗夜火鹰】";
//等级
$ndj=150;
//HP
$nhp=4800000;
//MAXHP
$nmaxhp=4800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=938833;
//魔攻
$nmg=938833;
//防御
$nfy=938833;
//魔防
$nmf=938833;
//冰攻
$nbg=$ndj+160;
//火攻
$nhg=$ndj+160;
//雷攻
$nlg=$ndj+160;
//冰防
$nbf=$ndj+160;
//火防
$nhf=$ndj+160;
//雷防
$nlf=$ndj+160;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");



} elseif ($npcc==764) {

//名字
$nname="【八翼雷鹰王】";
//等级
$ndj=150;
//HP
$nhp=5000000;
//MAXHP
$nmaxhp=5000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1038833;
//魔攻
$nmg=1038833;
//防御
$nfy=1038833;
//魔防
$nmf=1038833;
//冰攻
$nbg=$ndj+170;
//火攻
$nhg=$ndj+170;
//雷攻
$nlg=$ndj+170;
//冰防
$nbf=$ndj+170;
//火防
$nhf=$ndj+170;
//雷防
$nlf=$ndj+170;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


include("./wj/fb5jbs-4.php");
} elseif ($npcc==765) {

//名字
$nname="【暗黑冰龙】";
//等级
$ndj=150;
//HP
$nhp=5200000;
//MAXHP
$nmaxhp=5200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1113233;
//魔攻
$nmg=1113233;
//防御
$nfy=1113233;
//魔防
$nmf=1113233;
//冰攻
$nbg=$ndj+180;
//火攻
$nhg=$ndj+180;
//雷攻
$nlg=$ndj+180;
//冰防
$nbf=$ndj+180;
//火防
$nhf=$ndj+180;
//雷防
$nlf=$ndj+180;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");
} elseif ($npcc==766) {

//名字
$nname="【暗黑冰龙】";
//等级
$ndj=150;
//HP
$nhp=5200000;
//MAXHP
$nmaxhp=5200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1113233;
//魔攻
$nmg=1113233;
//防御
$nfy=1113233;
//魔防
$nmf=1113233;
//冰攻
$nbg=$ndj+180;
//火攻
$nhg=$ndj+180;
//雷攻
$nlg=$ndj+180;
//冰防
$nbf=$ndj+180;
//火防
$nhf=$ndj+180;
//雷防
$nlf=$ndj+180;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");


} elseif ($npcc==767) {

//名字
$nname="【九幽飞天龙王】";
//等级
$ndj=150;
//HP
$nhp=5500000;
//MAXHP
$nmaxhp=5500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1213233;
//魔攻
$nmg=1213233;
//防御
$nfy=1213233;
//魔防
$nmf=1213233;
//冰攻
$nbg=$ndj+200;
//火攻
$nhg=$ndj+200;
//雷攻
$nlg=$ndj+200;
//冰防
$nbf=$ndj+200;
//火防
$nhf=$ndj+200;
//雷防
$nlf=$ndj+200;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$bbdlsl= rand(1, 5);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率



$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


include("./wj/fb5jbs-4.php");



} elseif ($npcc==768) {

//名字
$nname="【巨人】";
//等级
$ndj=150;
//HP
$nhp=5600000;
//MAXHP
$nmaxhp=5600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1253233;
//魔攻
$nmg=1253233;
//防御
$nfy=1253233;
//魔防
$nmf=1253233;
//冰攻
$nbg=$ndj+200;
//火攻
$nhg=$ndj+200;
//雷攻
$nlg=$ndj+200;
//冰防
$nbf=$ndj+200;
//火防
$nhf=$ndj+200;
//雷防
$nlf=$ndj+200;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==769) {

//名字
$nname="【巨人】";
//等级
$ndj=150;
//HP
$nhp=5600000;
//MAXHP
$nmaxhp=5600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1253233;
//魔攻
$nmg=1253233;
//防御
$nfy=1253233;
//魔防
$nmf=1253233;
//冰攻
$nbg=$ndj+200;
//火攻
$nhg=$ndj+200;
//雷攻
$nlg=$ndj+200;
//冰防
$nbf=$ndj+200;
//火防
$nhf=$ndj+200;
//雷防
$nlf=$ndj+200;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==770) {

//名字
$nname="【泰坦巨人】";
//等级
$ndj=160;
//HP
$nhp=5800000;
//MAXHP
$nmaxhp=5800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1283233;
//魔攻
$nmg=1283233;
//防御
$nfy=1283233;
//魔防
$nmf=1283233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

} elseif ($npcc==771) {

//名字
$nname="【火精灵】";
//等级
$ndj=160;
//HP
$nhp=5900000;
//MAXHP
$nmaxhp=5900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1293233;
//魔攻
$nmg=1293233;
//防御
$nfy=1293233;
//魔防
$nmf=1293233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==772) {

//名字
$nname="【火精灵】";
//等级
$ndj=160;
//HP
$nhp=5900000;
//MAXHP
$nmaxhp=5900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1293233;
//魔攻
$nmg=1293233;
//防御
$nfy=1293233;
//魔防
$nmf=1293233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==773) {

//名字
$nname="【烈火精灵】";
//等级
$ndj=165;
//HP
$nhp=6000000;
//MAXHP
$nmaxhp=6000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1303233;
//魔攻
$nmg=1303233;
//防御
$nfy=1303233;
//魔防
$nmf=1303233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率


} elseif ($npcc==774) {

//名字
$nname="【吸血鬼】";
//等级
$ndj=165;
//HP
$nhp=6200000;
//MAXHP
$nmaxhp=6200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1323233;
//魔攻
$nmg=1323233;
//防御
$nfy=1323233;
//魔防
$nmf=1323233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==775) {

//名字
$nname="【吸血鬼】";
//等级
$ndj=165;
//HP
$nhp=6200000;
//MAXHP
$nmaxhp=6200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1323233;
//魔攻
$nmg=1323233;
//防御
$nfy=1323233;
//魔防
$nmf=1323233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==776) {

//名字
$nname="【吸血鬼王】";
//等级
$ndj=170;
//HP
$nhp=6500000;
//MAXHP
$nmaxhp=6500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1353233;
//魔攻
$nmg=1353233;
//防御
$nfy=1353233;
//魔防
$nmf=1353233;
//冰攻
$nbg=$ndj+215;
//火攻
$nhg=$ndj+215;
//雷攻
$nlg=$ndj+215;
//冰防
$nbf=$ndj+215;
//火防
$nhf=$ndj+215;
//雷防
$nlf=$ndj+215;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
} elseif ($npcc==777) {

//名字
$nname="【美杜莎】";
//等级
$ndj=170;
//HP
$nhp=6600000;
//MAXHP
$nmaxhp=6600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1373233;
//魔攻
$nmg=1373233;
//防御
$nfy=1373233;
//魔防
$nmf=1373233;
//冰攻
$nbg=$ndj+215;
//火攻
$nhg=$ndj+215;
//雷攻
$nlg=$ndj+215;
//冰防
$nbf=$ndj+215;
//火防
$nhf=$ndj+215;
//雷防
$nlf=$ndj+215;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==778) {

//名字
$nname="【美杜莎】";
//等级
$ndj=170;
//HP
$nhp=6600000;
//MAXHP
$nmaxhp=6600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1373233;
//魔攻
$nmg=1373233;
//防御
$nfy=1373233;
//魔防
$nmf=1373233;
//冰攻
$nbg=$ndj+215;
//火攻
$nhg=$ndj+215;
//雷攻
$nlg=$ndj+215;
//冰防
$nbf=$ndj+215;
//火防
$nhf=$ndj+215;
//雷防
$nlf=$ndj+215;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



} elseif ($npcc==779) {

//名字
$nname="【美杜莎女王】";
//等级
$ndj=175;
//HP
$nhp=6800000;
//MAXHP
$nmaxhp=6800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1403233;
//魔攻
$nmg=1403233;
//防御
$nfy=1403233;
//魔防
$nmf=1403233;
//冰攻
$nbg=$ndj+220;
//火攻
$nhg=$ndj+220;
//雷攻
$nlg=$ndj+220;
//冰防
$nbf=$ndj+220;
//火防
$nhf=$ndj+220;
//雷防
$nlf=$ndj+220;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率


} elseif ($npcc==780) {

//名字
$nname="【圣婴】";
//等级
$ndj=175;
//HP
$nhp=7000000;
//MAXHP
$nmaxhp=7000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1433233;
//魔攻
$nmg=1433233;
//防御
$nfy=1433233;
//魔防
$nmf=1433233;
//冰攻
$nbg=$ndj+220;
//火攻
$nhg=$ndj+220;
//雷攻
$nlg=$ndj+220;
//冰防
$nbf=$ndj+220;
//火防
$nhf=$ndj+220;
//雷防
$nlf=$ndj+220;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==781) {

//名字
$nname="【圣婴】";
//等级
$ndj=175;
//HP
$nhp=7000000;
//MAXHP
$nmaxhp=7000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1433233;
//魔攻
$nmg=1433233;
//防御
$nfy=1433233;
//魔防
$nmf=1433233;
//冰攻
$nbg=$ndj+220;
//火攻
$nhg=$ndj+220;
//雷攻
$nlg=$ndj+220;
//冰防
$nbf=$ndj+220;
//火防
$nhf=$ndj+220;
//雷防
$nlf=$ndj+220;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==782) {

//名字
$nname="【圣婴大王】";
//等级
$ndj=180;
//HP
$nhp=7300000;
//MAXHP
$nmaxhp=7300000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1453233;
//魔攻
$nmg=1453233;
//防御
$nfy=1453233;
//魔防
$nmf=1453233;
//冰攻
$nbg=$ndj+225;
//火攻
$nhg=$ndj+225;
//雷攻
$nlg=$ndj+225;
//冰防
$nbf=$ndj+225;
//火防
$nhf=$ndj+225;
//雷防
$nlf=$ndj+225;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$bbdlsl= rand(1, 10);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==783) {

//名字
$nname="【琵琶精】";
//等级
$ndj=180;
//HP
$nhp=7500000;
//MAXHP
$nmaxhp=7500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1503233;
//魔攻
$nmg=1503233;
//防御
$nfy=1503233;
//魔防
$nmf=1503233;
//冰攻
$nbg=$ndj+225;
//火攻
$nhg=$ndj+225;
//雷攻
$nlg=$ndj+225;
//冰防
$nbf=$ndj+225;
//火防
$nhf=$ndj+225;
//雷防
$nlf=$ndj+225;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==784) {

//名字
$nname="【琵琶精】";
//等级
$ndj=180;
//HP
$nhp=7500000;
//MAXHP
$nmaxhp=7500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1503233;
//魔攻
$nmg=1503233;
//防御
$nfy=1503233;
//魔防
$nmf=1503233;
//冰攻
$nbg=$ndj+225;
//火攻
$nhg=$ndj+225;
//雷攻
$nlg=$ndj+225;
//冰防
$nbf=$ndj+225;
//火防
$nhf=$ndj+225;
//雷防
$nlf=$ndj+225;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==785) {

//名字
$nname="【六耳猕猴】";
//等级
$ndj=185;
//HP
$nhp=7700000;
//MAXHP
$nmaxhp=7700000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1503233;
//魔攻
$nmg=1553233;
//防御
$nfy=1553233;
//魔防
$nmf=1503233;
//冰攻
$nbg=$ndj+230;
//火攻
$nhg=$ndj+230;
//雷攻
$nlg=$ndj+230;
//冰防
$nbf=$ndj+230;
//火防
$nhf=$ndj+230;
//雷防
$nlf=$ndj+230;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==786) {

//名字
$nname="【狮猁怪】";
//等级
$ndj=185;
//HP
$nhp=7900000;
//MAXHP
$nmaxhp=7900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1603233;
//魔攻
$nmg=1603233;
//防御
$nfy=1603233;
//魔防
$nmf=1603233;
//冰攻
$nbg=$ndj+230;
//火攻
$nhg=$ndj+230;
//雷攻
$nlg=$ndj+230;
//冰防
$nbf=$ndj+230;
//火防
$nhf=$ndj+230;
//雷防
$nlf=$ndj+230;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率




$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率








} elseif ($npcc==787) {

//名字
$nname="【狮猁怪】";
//等级
$ndj=185;
//HP
$nhp=7900000;
//MAXHP
$nmaxhp=7900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1603233;
//魔攻
$nmg=1603233;
//防御
$nfy=1603233;
//魔防
$nmf=1603233;
//冰攻
$nbg=$ndj+230;
//火攻
$nhg=$ndj+230;
//雷攻
$nlg=$ndj+230;
//冰防
$nbf=$ndj+230;
//火防
$nhf=$ndj+230;
//雷防
$nlf=$ndj+230;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==788) {

//名字
$nname="【铁扇公主】";
//等级
$ndj=190;
//HP
$nhp=8000000;
//MAXHP
$nmaxhp=8000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1703233;
//魔攻
$nmg=1703233;
//防御
$nfy=1703233;
//魔防
$nmf=1703233;
//冰攻
$nbg=$ndj+240;
//火攻
$nhg=$ndj+240;
//雷攻
$nlg=$ndj+240;
//冰防
$nbf=$ndj+240;
//火防
$nhf=$ndj+240;
//雷防
$nlf=$ndj+240;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==789) {

//名字
$nname="【玉面狐狸】";
//等级
$ndj=190;
//HP
$nhp=8000000;
//MAXHP
$nmaxhp=8000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1753233;
//魔攻
$nmg=1753233;
//防御
$nfy=1753233;
//魔防
$nmf=1753233;
//冰攻
$nbg=$ndj+240;
//火攻
$nhg=$ndj+240;
//雷攻
$nlg=$ndj+240;
//冰防
$nbf=$ndj+240;
//火防
$nhf=$ndj+240;
//雷防
$nlf=$ndj+240;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==790) {

//名字
$nname="【玉面狐狸】";
//等级
$ndj=190;
//HP
$nhp=8000000;
//MAXHP
$nmaxhp=8000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1753233;
//魔攻
$nmg=1753233;
//防御
$nfy=1753233;
//魔防
$nmf=1753233;
//冰攻
$nbg=$ndj+240;
//火攻
$nhg=$ndj+240;
//雷攻
$nlg=$ndj+240;
//冰防
$nbf=$ndj+240;
//火防
$nhf=$ndj+240;
//雷防
$nlf=$ndj+240;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==791) {

//名字
$nname="【牛魔王】";
//等级
$ndj=195;
//HP
$nhp=8500000;
//MAXHP
$nmaxhp=8500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1803233;
//魔攻
$nmg=1803233;
//防御
$nfy=1803233;
//魔防
$nmf=1803233;
//冰攻
$nbg=$ndj+250;
//火攻
$nhg=$ndj+250;
//雷攻
$nlg=$ndj+250;
//冰防
$nbf=$ndj+250;
//火防
$nhf=$ndj+250;
//雷防
$nlf=$ndj+250;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==792) {

//名字
$nname="【白面狐狸】";
//等级
$ndj=195;
//HP
$nhp=8500000;
//MAXHP
$nmaxhp=8500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1853233;
//魔攻
$nmg=1853233;
//防御
$nfy=1853233;
//魔防
$nmf=1853233;
//冰攻
$nbg=$ndj+250;
//火攻
$nhg=$ndj+250;
//雷攻
$nlg=$ndj+250;
//冰防
$nbf=$ndj+250;
//火防
$nhf=$ndj+250;
//雷防
$nlf=$ndj+250;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==793) {

//名字
$nname="【白面狐狸】";
//等级
$ndj=195;
//HP
$nhp=8500000;
//MAXHP
$nmaxhp=8500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1853233;
//魔攻
$nmg=1853233;
//防御
$nfy=1853233;
//魔防
$nmf=1853233;
//冰攻
$nbg=$ndj+250;
//火攻
$nhg=$ndj+250;
//雷攻
$nlg=$ndj+250;
//冰防
$nbf=$ndj+250;
//火防
$nhf=$ndj+250;
//雷防
$nlf=$ndj+250;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==794) {

//名字
$nname="【九灵元圣】";
//等级
$ndj=200;
//HP
$nhp=9000000;
//MAXHP
$nmaxhp=9000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1903233;
//魔攻
$nmg=1903233;
//防御
$nfy=1903233;
//魔防
$nmf=1903233;
//冰攻
$nbg=$ndj+255;
//火攻
$nhg=$ndj+255;
//雷攻
$nlg=$ndj+255;
//冰防
$nbf=$ndj+255;
//火防
$nhf=$ndj+255;
//雷防
$nlf=$ndj+255;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==795) {

//名字
$nname="【大鹏金翅雕】";
//等级
$ndj=210;
//HP
$nhp=9200000;
//MAXHP
$nmaxhp=9200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2003233;
//魔攻
$nmg=2003233;
//防御
$nfy=2003233;
//魔防
$nmf=2003233;
//冰攻
$nbg=$ndj+255;
//火攻
$nhg=$ndj+255;
//雷攻
$nlg=$ndj+255;
//冰防
$nbf=$ndj+255;
//火防
$nhf=$ndj+255;
//雷防
$nlf=$ndj+255;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==796) {

//名字
$nname="【大鹏金翅雕】";
//等级
$ndj=210;
//HP
$nhp=9200000;
//MAXHP
$nmaxhp=9200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2003233;
//魔攻
$nmg=2003233;
//防御
$nfy=2003233;
//魔防
$nmf=2003233;
//冰攻
$nbg=$ndj+255;
//火攻
$nhg=$ndj+255;
//雷攻
$nlg=$ndj+255;
//冰防
$nbf=$ndj+255;
//火防
$nhf=$ndj+255;
//雷防
$nlf=$ndj+255;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==797) {

//名字
$nname="【齐天大圣】";
//等级
$ndj=220;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2203233;
//魔攻
$nmg=2203233;
//防御
$nfy=2203233;
//魔防
$nmf=2203233;
//冰攻
$nbg=$ndj+260;
//火攻
$nhg=$ndj+260;
//雷攻
$nlg=$ndj+260;
//冰防
$nbf=$ndj+260;
//火防
$nhf=$ndj+260;
//雷防
$nlf=$ndj+260;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖齐天大圣〗（宠物蛋）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=570;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率




$bbdlsl= rand(1, 20);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率




$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==798) {

//名字
$nname="唐三藏（暑期活动第二波）";
//等级
$ndj=180;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=674554;
//魔攻
$nmg=674554;
//防御
$nfy=471275;
//魔防
$nmf=471275;
//冰攻
$nbg=200;
//火攻
$nhg=200;
//雷攻
$nlg=200;
//冰防
$nbf=200;
//火防
$nhf=200;
//雷防
$nlf=200;
//NPC被攻击说话语
$ntake="找死？是吧！";


} elseif ($npcc==799) {//〖齐天大圣〗（宠物蛋）

//名字
$nname="〖齐天大圣〗";
//等级
$ndj=200;
//HP
$nhp=3000000;
//MAXHP
$nmaxhp=3000000;
//MP
$nmp=3000;
//MAXMP
$nmaxmp=3000;
//攻击
$ngj=1585258;
//魔攻
$nmg=1585258;
//防御
$nfy=1025250;
//魔防
$nmf=5252;
//冰攻
$nbg=230;
//火攻
$nhg=230;
//雷攻
$nlg=230;
//冰防
$nbf=230;
//火防
$nhf=230;
//雷防
$nlf=230;
//NPC被攻击说话语
$ntake="我是不可能让你抓住的";
$cwid=13;//宠物的ID
$bzgl=100;//被捕捉到的概率
$tpgl=100;//逃跑概率

} elseif ($npcc==800) {//师门祖师

//名字
$nname="师门祖师";
//等级
$ndj=200;
//HP
$nhp=3000000;
//MAXHP
$nmaxhp=3000000;
//MP
$nmp=3000;
//MAXMP
$nmaxmp=3000;
//攻击
$ngj=1585258;
//魔攻
$nmg=1585258;
//防御
$nfy=1025250;
//魔防
$nmf=5252;
//冰攻
$nbg=230;
//火攻
$nhg=230;
//雷攻
$nlg=230;
//冰防
$nbf=230;
//火防
$nhf=230;
//雷防
$nlf=230;





} else{

$nccp=2;
echo "<font color=black>没有这个id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}












?>



