<?php


if ($npcc==1101) {//副本boss地狱

$xsbl=11;
//名字
$nname="【四蛛精·紫】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1102) {//副本boss普通

$xsbl=9;
//名字
$nname="【二蛛精·白】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1103) {//副本boss困难

$xsbl=10;
//名字
$nname="【二蛛精·白】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1104) {//副本boss梦魇

$xsbl=11;
//名字
$nname="【二蛛精·白】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1105) {//副本boss地狱

$xsbl=12;
//名字
$nname="【二蛛精·白】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1106) {//副本boss普通

$xsbl=10;
//名字
$nname="【三蛛精·蓝】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1107) {//副本boss困难

$xsbl=11;
//名字
$nname="【三蛛精·蓝】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1108) {//副本boss梦魇

$xsbl=12;
//名字
$nname="【三蛛精·蓝】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1109) {//副本boss地狱

$xsbl=13;
//名字
$nname="【三蛛精·蓝】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1110) {//副本boss普通

$xsbl=10;
//名字
$nname="【大蛛精·黑】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1111) {//副本boss困难

$xsbl=12;
//名字
$nname="【大蛛精·黑】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1112) {//副本boss梦魇

$xsbl=13;
//名字
$nname="【大蛛精·黑】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1113) {//副本boss地狱

$xsbl=14;
//名字
$nname="【大蛛精·黑】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖玄天残叶〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=601;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖神兽仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=602;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖帝王之心〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=690;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之血〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=691;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖帝王之魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=692;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1114) {//副本boss普通

$xsbl=70;
//名字
$nname="【狮驼王】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖祥云残片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=603;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖大圣仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=604;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1115) {//副本boss困难

$xsbl=71;
//名字
$nname="【狮驼王】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖祥云残片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=603;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖大圣仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=604;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1116) {//副本boss梦魇

$xsbl=72;
//名字
$nname="【狮驼王】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

} elseif ($npcc==1117) {//副本boss地狱

$xsbl=73;
//名字
$nname="【狮驼王】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖祥云残片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=603;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖大圣仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=604;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1118) {//副本boss普通

$xsbl=87;
//名字
$nname="【白象尊者】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖祥云残片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=603;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖大圣仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=604;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1119) {//副本boss困难

$xsbl=88;
//名字
$nname="【白象尊者】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖祥云残片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=603;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖大圣仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=604;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1120) {//副本boss梦魇

$xsbl=89;
//名字
$nname="【白象尊者】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖祥云残片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=603;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖大圣仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=604;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1121) {//副本boss地狱

$xsbl=90;
//名字
$nname="【白象尊者】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖祥云残片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=603;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖大圣仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=604;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落







} elseif ($npcc==1122) {//副本boss普通

$xsbl=97;
//名字
$nname="【大鹏明王】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖祥云残片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=603;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖大圣仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=604;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1123) {//副本boss困难

$xsbl=98;
//名字
$nname="【大鹏明王】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖祥云残片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=603;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖大圣仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=604;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1124) {//副本boss梦魇

$xsbl=99;
//名字
$nname="【大鹏明王】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖祥云残片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=603;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖大圣仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=604;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1125) {//副本boss地狱

$xsbl=100;
//名字
$nname="【大鹏明王】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖祥云残片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=603;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖大圣仙魄〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=604;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落







} elseif ($npcc==1126) {//副本boss普通

$xsbl=100;
//名字
$nname="【白鼠精】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1127) {//副本boss困难

$xsbl=105;
//名字
$nname="【白鼠精】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1128) {//副本boss梦魇

$xsbl=110;
//名字
$nname="【白鼠精】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1129) {//副本boss地狱

$xsbl=120;
//名字
$nname="【白鼠精】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落





} elseif ($npcc==1130) {//副本boss普通

$xsbl=110;
//名字
$nname="【黑鼠精】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1131) {//副本boss困难

$xsbl=115;
//名字
$nname="【黑鼠精】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1132) {//副本boss梦魇

$xsbl=120;
//名字
$nname="【黑鼠精】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1133) {//副本boss地狱

$xsbl=130;
//名字
$nname="【黑鼠精】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1134) {//副本boss普通

$xsbl=115;
//名字
$nname="【田鼠精】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1135) {//副本boss困难

$xsbl=120;
//名字
$nname="【田鼠精】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1136) {//副本boss梦魇

$xsbl=125;
//名字
$nname="【田鼠精】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1137) {//副本boss地狱

$xsbl=130;
//名字
$nname="【田鼠精】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1138) {//副本boss普通

$xsbl=120;
//名字
$nname="【黄鼠精】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1139) {//副本boss困难

$xsbl=125;
//名字
$nname="【黄鼠精】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1140) {//副本boss梦魇

$xsbl=130;
//名字
$nname="【黄鼠精】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1141) {//副本boss地狱

$xsbl=140;
//名字
$nname="【黄鼠精】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖时装碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=818;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖时装契约〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=819;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1142) {

$xsbl=70;
//名字
$nname="【巨人】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1143) {

$xsbl=70;
//名字
$nname="【巨人】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1144) {

$xsbl=75;
//名字
$nname="【泰坦巨人】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1145) {

$xsbl=80;
//名字
$nname="【火精灵】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1146) {

$xsbl=80;
//名字
$nname="【火精灵】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1147) {

$xsbl=85;
//名字
$nname="【烈火精灵】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1148) {

$xsbl=90;
//名字
$nname="【吸血鬼】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1149) {

$xsbl=90;
//名字
$nname="【吸血鬼】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1150) {

$xsbl=95;
//名字
$nname="【吸血鬼王】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1151) {

$xsbl=100;
//名字
$nname="【美杜莎】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1152) {

$xsbl=100;
//名字
$nname="【美杜莎】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1153) {

$xsbl=105;
//名字
$nname="【美杜莎女王】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1154) {

$xsbl=110;
//名字
$nname="【圣婴】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1155) {

$xsbl=110;
//名字
$nname="【圣婴】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1156) {

$xsbl=115;
//名字
$nname="【圣婴大王】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1157) {

$xsbl=120;
//名字
$nname="【琵琶精】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1158) {

$xsbl=120;
//名字
$nname="【琵琶精】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1159) {

$xsbl=125;
//名字
$nname="【六耳猕猴】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1160) {

$xsbl=130;
//名字
$nname="【狮猁怪】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1161) {

$xsbl=130;
//名字
$nname="【狮猁怪】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1162) {

$xsbl=135;
//名字
$nname="【铁扇公主】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1163) {

$xsbl=140;
//名字
$nname="【玉面狐狸】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1164) {

$xsbl=140;
//名字
$nname="【玉面狐狸】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1165) {

$xsbl=145;
//名字
$nname="【牛魔王】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1166) {

$xsbl=150;
//名字
$nname="【白面狐狸】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1167) {

$xsbl=150;
//名字
$nname="【白面狐狸】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1168) {

$xsbl=155;
//名字
$nname="【九灵元圣】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1169) {

$xsbl=160;
//名字
$nname="【大鹏金翅雕】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1170) {

$xsbl=160;
//名字
$nname="【大鹏金翅雕】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1171) {

$xsbl=165;
//名字
$nname="【齐天大圣】（天尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1172) {

$xsbl=70;
//名字
$nname="【石压鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1173) {

$xsbl=70;
//名字
$nname="【石压鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1174) {

$xsbl=75;
//名字
$nname="【掌善判官】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1175) {

$xsbl=80;
//名字
$nname="【舂臼鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1176) {

$xsbl=80;
//名字
$nname="【舂臼鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1177) {

$xsbl=85;
//名字
$nname="【掌恶判官】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1178) {

$xsbl=90;
//名字
$nname="【血池鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1179) {

$xsbl=90;
//名字
$nname="【血池鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1180) {

$xsbl=95;
//名字
$nname="【生死判官】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1181) {

$xsbl=100;
//名字
$nname="【枉死鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1182) {

$xsbl=100;
//名字
$nname="【枉死鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1183) {

$xsbl=105;
//名字
$nname="【五官王】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1184) {

$xsbl=110;
//名字
$nname="【磔刑鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1185) {

$xsbl=110;
//名字
$nname="【磔刑鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1186) {

$xsbl=115;
//名字
$nname="【泰山王】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落




} elseif ($npcc==1187) {

$xsbl=120;
//名字
$nname="【火山鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1188) {

$xsbl=120;
//名字
$nname="【火山鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1189) {

$xsbl=125;
//名字
$nname="【轮回王】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} elseif ($npcc==1190) {

$xsbl=130;
//名字
$nname="【石磨鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1191) {

$xsbl=130;
//名字
$nname="【石磨鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1192) {

$xsbl=135;
//名字
$nname="【赏善司】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落


} elseif ($npcc==1193) {

$xsbl=140;
//名字
$nname="【刀锯鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1194) {

$xsbl=140;
//名字
$nname="【刀锯鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1195) {

$xsbl=145;
//名字
$nname="【罚恶司】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1196) {

$xsbl=150;
//名字
$nname="【无边鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1197) {

$xsbl=150;
//名字
$nname="【无边鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1198) {

$xsbl=155;
//名字
$nname="【冥府判官】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖5亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=626;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（蓝）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=619;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落

} elseif ($npcc==1199) {

$xsbl=160;
//名字
$nname="【无尽鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落
} elseif ($npcc==1200) {

$xsbl=160;
//名字
$nname="【无尽鬼】（魔尊）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";



//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="【占星秘典】";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=730;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1亿修炼经验丹〗";//名字
$wpdz2[]=5;//物品分类
$wpdz3[]=625;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖练星符〗（绿）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=618;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖神仙果〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=694;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖仙の陨魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=823;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率
//死亡掉落



} else{
$nccp=2;
echo "<font color=black>没有这个id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}















?>



