<?php


if ($npcc==1301) {
$xsbl=60;
//名字
$nname="【虎翼阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=989;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=990;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=991;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==1302) {
$xsbl=60;
//名字
$nname="【虎翼阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=989;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=990;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=991;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1303) {
$xsbl=60;
//名字
$nname="【虎翼阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=989;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=990;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=991;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1304) {
$xsbl=60;
//名字
$nname="【鸟翔阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=989;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=990;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=991;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1305) {
$xsbl=60;
//名字
$nname="【鸟翔阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=989;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=990;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=991;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1306) {
$xsbl=60;
//名字
$nname="【鸟翔阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=989;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=990;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=991;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1307) {
$xsbl=60;
//名字
$nname="【蛇蟠阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=989;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=990;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=991;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1308) {
$xsbl=60;
//名字
$nname="【蛇蟠阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");
//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=989;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=990;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=991;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1309) {
$xsbl=60;
//名字
$nname="【蛇蟠阵】神卫";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=300000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖混沌圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=989;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖混沌圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=990;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖混沌圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=991;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==1310) {
$xsbl=80;
//名字
$nname="【神仙气阵图】神将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=500000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=20;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖鸿蒙天佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=992;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖鸿蒙天晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=993;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖鸿蒙天器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=994;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1311) {
$xsbl=80;
//名字
$nname="【神仙气阵图】神将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=500000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=20;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率、

$wpdz1[]="〖鸿蒙天佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=992;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖鸿蒙天晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=993;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖鸿蒙天器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=994;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1312) {
$xsbl=80;
//名字
$nname="【神仙气阵图】神将";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//经验
$npjy=500000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=20;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖鸿蒙天佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=992;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖鸿蒙天晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=993;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖鸿蒙天器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=994;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==1313) {
$xsbl=100;
//名字
$nname="【如来佛祖】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//经验
$npjy=500000000;//经验
include("./wj/hddl.php");

//死亡掉落
$wpdz1[]="〖碎银块〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=659;//物品id
$wpdz4[]=20;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖云梯石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=821;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖金豆〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=127;//物品id
$wpdz4[]=50;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率


$wpdz1[]="〖鸿蒙神佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=995;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖鸿蒙神晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=996;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖鸿蒙神器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=997;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖鸿蒙圣佑石〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=998;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖鸿蒙圣晶砂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=999;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖鸿蒙圣器魂〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=1000;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率





} elseif ($npcc==1314) {
$xsbl=100;
//名字
$nname="摔伤的老人";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";



} elseif ($npcc==1315) {
$xsbl=100;
//名字
$nname="〖活动〗奇怪的商人";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";



} elseif ($npcc==1316) {
$xsbl=100;
//名字
$nname="〖活动〗重阳婆婆";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

} elseif ($npcc==1317) {
$xsbl=50;
//名字
$nname="蟠桃树";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

} elseif ($npcc==1318) {
$xsbl=150;
//名字
$nname="〖活动〗西方传教士";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


} elseif ($npcc==1319) {
$xsbl=150;
//名字
$nname="〖活动〗西方传教士";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

} elseif ($npcc==1321) {
$xsbl=150;
//名字
$nname="〖活动〗竞猜使者";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

} elseif ($npcc==1322) {
$xsbl=150;
//名字
$nname="〖活动〗火鸡先生";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
} elseif ($npcc==1323) {
$xsbl=150;
//名字
$nname="〖活动〗点石成金传送员";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+1000000*$xsbl;
//MAXHP
$nmaxhp=10000000+1000000*$xsbl;
//MP
$nmp=10000+100000*$xsbl;
//MAXMP
$nmaxmp=10000+100000*$xsbl;
//攻击
$ngj=2203233+300000*$xsbl;
//魔攻
$nmg=2203233+300000*$xsbl;
//防御
$nfy=2203233+300000*$xsbl;
//魔防
$nmf=2203233+300000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";



} elseif ($npcc==1324) {
$xsbl=60;
//名字
$nname="〖活动〗【铁矿财神】";
//等级
$ndj=20+1*$xsbl;
//HP
$nhp=1000+1000*$xsbl;
//MAXHP
$nmaxhp=1000+1000*$xsbl;
//MP
$nmp=1000+1000*$xsbl;
//MAXMP
$nmaxmp=1000+1000*$xsbl;
//攻击
$ngj=1000+1000*$xsbl;
//魔攻
$nmg=1000+1000*$xsbl;
//防御
$nfy=1000+1000*$xsbl;
//魔防
$nmf=1000+1000*$xsbl;
//冰攻
$nbg=$ndj+60;
//火攻
$nhg=$ndj+60;
//雷攻
$nlg=$ndj+60;
//冰防
$nbf=$ndj+60;
//火防
$nhf=$ndj+60;
//雷防
$nlf=$ndj+60;
//NPC被攻击说话语
$ntake="找死？是吧！";





$mapbv=1;//爆率倍场
include("jks.php");
$wpdz1[]="〖金矿石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=1099;//物品id
$wpdz4[]=$mapbvv;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=$oysbv;//	多少爆率








} elseif ($npcc==1325) {
$xsbl=60;
//名字
$nname="〖活动〗【铜矿财神】";
//等级
$ndj=20+1*$xsbl;
//HP
$nhp=1000+1000*$xsbl;
//MAXHP
$nmaxhp=1000+1000*$xsbl;
//MP
$nmp=1000+1000*$xsbl;
//MAXMP
$nmaxmp=1000+1000*$xsbl;
//攻击
$ngj=1000+1000*$xsbl;
//魔攻
$nmg=1000+1000*$xsbl;
//防御
$nfy=1000+1000*$xsbl;
//魔防
$nmf=1000+1000*$xsbl;
//冰攻
$nbg=$ndj+60;
//火攻
$nhg=$ndj+60;
//雷攻
$nlg=$ndj+60;
//冰防
$nbf=$ndj+60;
//火防
$nhf=$ndj+60;
//雷防
$nlf=$ndj+60;
//NPC被攻击说话语
$ntake="找死？是吧！";


$mapbv=10;//爆率倍场
include("jks.php");
$wpdz1[]="〖金矿石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=1099;//物品id
$wpdz4[]=$mapbvv;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=$oysbv;//	多少爆率
} elseif ($npcc==1326) {
$xsbl=60;
//名字
$nname="〖活动〗【银矿财神】";
//等级
$ndj=20+1*$xsbl;
//HP
$nhp=1000+1000*$xsbl;
//MAXHP
$nmaxhp=1000+1000*$xsbl;
//MP
$nmp=1000+1000*$xsbl;
//MAXMP
$nmaxmp=1000+1000*$xsbl;
//攻击
$ngj=1000+1000*$xsbl;
//魔攻
$nmg=1000+1000*$xsbl;
//防御
$nfy=1000+1000*$xsbl;
//魔防
$nmf=1000+1000*$xsbl;
//冰攻
$nbg=$ndj+60;
//火攻
$nhg=$ndj+60;
//雷攻
$nlg=$ndj+60;
//冰防
$nbf=$ndj+60;
//火防
$nhf=$ndj+60;
//雷防
$nlf=$ndj+60;
//NPC被攻击说话语
$ntake="找死？是吧！";
$mapbv=50;//爆率倍场
include("jks.php");
$wpdz1[]="〖金矿石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=1099;//物品id
$wpdz4[]=$mapbvv;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=$oysbv;//	多少爆率
} elseif ($npcc==1327) {
$xsbl=60;
//名字
$nname="〖活动〗【金矿财神】";
//等级
$ndj=20+1*$xsbl;
//HP
$nhp=1000+1000*$xsbl;
//MAXHP
$nmaxhp=1000+1000*$xsbl;
//MP
$nmp=1000+1000*$xsbl;
//MAXMP
$nmaxmp=1000+1000*$xsbl;
//攻击
$ngj=1000+1000*$xsbl;
//魔攻
$nmg=1000+1000*$xsbl;
//防御
$nfy=1000+1000*$xsbl;
//魔防
$nmf=1000+1000*$xsbl;
//冰攻
$nbg=$ndj+60;
//火攻
$nhg=$ndj+60;
//雷攻
$nlg=$ndj+60;
//冰防
$nbf=$ndj+60;
//火防
$nhf=$ndj+60;
//雷防
$nlf=$ndj+60;
//NPC被攻击说话语
$ntake="找死？是吧！";
$mapbv=100;//爆率倍场
include("jks.php");
$wpdz1[]="〖金矿石〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=1099;//物品id
$wpdz4[]=$mapbvv;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=$oysbv;//	多少爆率





} else{
$nccp=2;
echo "<font color=black>没有这个id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}















?>



