<?php
if ($npcc==801) {


//名字
$nname="【拔舌鬼】";
//等级
$ndj=100;
//HP
$nhp=500000;
//MAXHP
$nmaxhp=500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=112783;
//魔攻
$nmg=112783;
//防御
$nfy=112783;
//魔防
$nmf=112783;
//冰攻
$nbg=100;
//火攻
$nhg=100;
//雷攻
$nlg=100;
//冰防
$nbf=100;
//火防
$nhf=100;
//雷防
$nlf=100;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率



include("./wj/fb3jbs-2.php");

//死亡掉落


} elseif ($npcc==802) {

//名字
$nname="【拔舌鬼】";
//等级
$ndj=100;
//HP
$nhp=500000;
//MAXHP
$nmaxhp=500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=112783;
//魔攻
$nmg=112783;
//防御
$nfy=112783;
//魔防
$nmf=112783;
//冰攻
$nbg=100;
//火攻
$nhg=100;
//雷攻
$nlg=100;
//冰防
$nbf=100;
//火防
$nhf=100;
//雷防
$nlf=100;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率




include("./wj/fb3jbs-2.php");

//死亡掉落





} elseif ($npcc==803) {

//名字
$nname="【牛头】";
//等级
$ndj=100;
//HP
$nhp=650000;
//MAXHP
$nmaxhp=650000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=152783;
//魔攻
$nmg=152783;
//防御
$nfy=152783;
//魔防
$nmf=152783;
//冰攻
$nbg=$ndj+10;
//火攻
$nhg=$ndj+10;
//雷攻
$nlg=$ndj+10;
//冰防
$nbf=$ndj+10;
//火防
$nhf=$ndj+10;
//雷防
$nlf=$ndj+10;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


include("./wj/fb3jbs-4.php");

//死亡掉落


} elseif ($npcc==804) {

//名字
$nname="【剪刀鬼】";
//等级
$ndj=110;
//HP
$nhp=700000;
//MAXHP
$nmaxhp=700000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=178644;
//魔攻
$nmg=178644;
//防御
$nfy=178644;
//魔防
$nmf=178644;
//冰攻
$nbg=$ndj+20;
//火攻
$nhg=$ndj+20;
//雷攻
$nlg=$ndj+20;
//冰防
$nbf=$ndj+20;
//火防
$nhf=$ndj+20;
//雷防
$nlf=$ndj+20;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率



include("./wj/fb3jbs-2.php");

//死亡掉落


} elseif ($npcc==805) {

//名字
$nname="【剪刀鬼】";
//等级
$ndj=110;
//HP
$nhp=700000;
//MAXHP
$nmaxhp=700000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=178644;
//魔攻
$nmg=178644;
//防御
$nfy=178644;
//魔防
$nmf=178644;
//冰攻
$nbg=$ndj+20;
//火攻
$nhg=$ndj+20;
//雷攻
$nlg=$ndj+20;
//冰防
$nbf=$ndj+20;
//火防
$nhf=$ndj+20;
//雷防
$nlf=$ndj+20;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

include("./wj/fb3jbs-2.php");

//死亡掉落











} elseif ($npcc==806) {

//名字
$nname="【马面】";
//等级
$ndj=110;
//HP
$nhp=1000000;
//MAXHP
$nmaxhp=1000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=213453;
//魔攻
$nmg=213453;
//防御
$nfy=213453;
//魔防
$nmf=213453;
//冰攻
$nbg=$ndj+30;
//火攻
$nhg=$ndj+30;
//雷攻
$nlg=$ndj+30;
//冰防
$nbf=$ndj+30;
//火防
$nhf=$ndj+30;
//雷防
$nlf=$ndj+30;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

include("./wj/fb3jbs-4.php");

//死亡掉落







} elseif ($npcc==807) {

//名字
$nname="【铁树鬼】";
//等级
$ndj=120;
//HP
$nhp=1200000;
//MAXHP
$nmaxhp=1200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=234234;
//魔攻
$nmg=234234;
//防御
$nfy=234234;
//魔防
$nmf=234234;
//冰攻
$nbg=$ndj+40;
//火攻
$nhg=$ndj+40;
//雷攻
$nlg=$ndj+40;
//冰防
$nbf=$ndj+40;
//火防
$nhf=$ndj+40;
//雷防
$nlf=$ndj+40;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

include("./wj/fb3jbs-2.php");

//死亡掉落





} elseif ($npcc==808) {

//名字
$nname="【铁树鬼】";
//等级
$ndj=120;
//HP
$nhp=1200000;
//MAXHP
$nmaxhp=1200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=234234;
//魔攻
$nmg=234234;
//防御
$nfy=234234;
//魔防
$nmf=234234;
//冰攻
$nbg=$ndj+40;
//火攻
$nhg=$ndj+40;
//雷攻
$nlg=$ndj+40;
//冰防
$nbf=$ndj+40;
//火防
$nhf=$ndj+40;
//雷防
$nlf=$ndj+40;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

include("./wj/fb3jbs-2.php");

//死亡掉落






} elseif ($npcc==809) {

//名字
$nname="【白无常】";
//等级
$ndj=120;
//HP
$nhp=1500000;
//MAXHP
$nmaxhp=1500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=312343;
//魔攻
$nmg=312343;
//防御
$nfy=312343;
//魔防
$nmf=312343;
//冰攻
$nbg=$ndj+50;
//火攻
$nhg=$ndj+50;
//雷攻
$nlg=$ndj+50;
//冰防
$nbf=$ndj+50;
//火防
$nhf=$ndj+50;
//雷防
$nlf=$ndj+50;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

include("./wj/fb3jbs-4.php");

//死亡掉落


} elseif ($npcc==810) {

//名字
$nname="【孽镜鬼】";
//等级
$ndj=130;
//HP
$nhp=2000000;
//MAXHP
$nmaxhp=2000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=335463;
//魔攻
$nmg=335463;
//防御
$nfy=335463;
//魔防
$nmf=335463;
//冰攻
$nbg=$ndj+60;
//火攻
$nhg=$ndj+60;
//雷攻
$nlg=$ndj+60;
//冰防
$nbf=$ndj+60;
//火防
$nhf=$ndj+60;
//雷防
$nlf=$ndj+60;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");

//死亡掉落


} elseif ($npcc==811) {

//名字
$nname="【孽镜鬼】";
//等级
$ndj=130;
//HP
$nhp=2000000;
//MAXHP
$nmaxhp=2000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=335463;
//魔攻
$nmg=335463;
//防御
$nfy=335463;
//魔防
$nmf=335463;
//冰攻
$nbg=$ndj+60;
//火攻
$nhg=$ndj+60;
//雷攻
$nlg=$ndj+60;
//冰防
$nbf=$ndj+60;
//火防
$nhf=$ndj+60;
//雷防
$nlf=$ndj+60;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");

//死亡掉落




} elseif ($npcc==812) {

//名字
$nname="【黑无常】";
//等级
$ndj=130;
//HP
$nhp=2300000;
//MAXHP
$nmaxhp=2300000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=415432;
//魔攻
$nmg=415432;
//防御
$nfy=415432;
//魔防
$nmf=415432;
//冰攻
$nbg=$ndj+70;
//火攻
$nhg=$ndj+70;
//雷攻
$nlg=$ndj+70;
//冰防
$nbf=$ndj+70;
//火防
$nhf=$ndj+70;
//雷防
$nlf=$ndj+70;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

include("./wj/fb4jbs-4.php");





















//死亡掉落



} elseif ($npcc==813) {

//名字
$nname="【蒸笼鬼】";
//等级
$ndj=140;
//HP
$nhp=2800000;
//MAXHP
$nmaxhp=2800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=465432;
//魔攻
$nmg=465432;
//防御
$nfy=465432;
//魔防
$nmf=465432;
//冰攻
$nbg=$ndj+80;
//火攻
$nhg=$ndj+80;
//雷攻
$nlg=$ndj+80;
//冰防
$nbf=$ndj+80;
//火防
$nhf=$ndj+80;
//雷防
$nlf=$ndj+80;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");




} elseif ($npcc==814) {

//名字
$nname="【蒸笼鬼】";
//等级
$ndj=140;
//HP
$nhp=2800000;
//MAXHP
$nmaxhp=2800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=465432;
//魔攻
$nmg=465432;
//防御
$nfy=465432;
//魔防
$nmf=465432;
//冰攻
$nbg=$ndj+80;
//火攻
$nhg=$ndj+80;
//雷攻
$nlg=$ndj+80;
//冰防
$nbf=$ndj+80;
//火防
$nhf=$ndj+80;
//雷防
$nlf=$ndj+80;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");








} elseif ($npcc==815) {

//名字
$nname="【推磨鬼】";
//等级
$ndj=140;
//HP
$nhp=3000000;
//MAXHP
$nmaxhp=3000000;
//MP
$nmp=100000;
//MAXMP
$nmaxmp=100000;
//攻击
$ngj=513332;
//魔攻
$nmg=513332;
//防御
$nfy=513332;
//魔防
$nmf=513332;
//冰攻
$nbg=$ndj+90;
//火攻
$nhg=$ndj+90;
//雷攻
$nlg=$ndj+90;
//冰防
$nbf=$ndj+90;
//火防
$nhf=$ndj+90;
//雷防
$nlf=$ndj+90;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$bbdlsl= rand(1, 2);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率



$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

include("./wj/fb4jbs-4.php");

} elseif ($npcc==816) {

//名字
$nname="【铜柱鬼】";
//等级
$ndj=150;
//HP
$nhp=3200000;
//MAXHP
$nmaxhp=3200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=533332;
//魔攻
$nmg=533332;
//防御
$nfy=533332;
//魔防
$nmf=533332;
//冰攻
$nbg=$ndj+100;
//火攻
$nhg=$ndj+100;
//雷攻
$nlg=$ndj+100;
//冰防
$nbf=$ndj+100;
//火防
$nhf=$ndj+100;
//雷防
$nlf=$ndj+100;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");

} elseif ($npcc==817) {

//名字
$nname="【铜柱鬼】";
//等级
$ndj=150;
//HP
$nhp=3200000;
//MAXHP
$nmaxhp=3200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=533332;
//魔攻
$nmg=533332;
//防御
$nfy=533332;
//魔防
$nmf=533332;
//冰攻
$nbg=$ndj+100;
//火攻
$nhg=$ndj+100;
//雷攻
$nlg=$ndj+100;
//冰防
$nbf=$ndj+100;
//火防
$nhf=$ndj+100;
//雷防
$nlf=$ndj+100;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb4jbs-2.php");


} elseif ($npcc==818) {

//名字
$nname="【轮转王】";
//等级
$ndj=150;
//HP
$nhp=3500000;
//MAXHP
$nmaxhp=3500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=605433;
//魔攻
$nmg=605433;
//防御
$nfy=605433;
//魔防
$nmf=605433;
//冰攻
$nbg=$ndj+110;
//火攻
$nhg=$ndj+110;
//雷攻
$nlg=$ndj+110;
//冰防
$nbf=$ndj+110;
//火防
$nhf=$ndj+110;
//雷防
$nlf=$ndj+110;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=6;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

include("./wj/fb4jbs-4.php");

} elseif ($npcc==819) {

//名字
$nname="【刀山鬼】";
//等级
$ndj=150;
//HP
$nhp=4000000;
//MAXHP
$nmaxhp=4000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=645433;
//魔攻
$nmg=645433;
//防御
$nfy=645433;
//魔防
$nmf=645433;
//冰攻
$nbg=$ndj+120;
//火攻
$nhg=$ndj+120;
//雷攻
$nlg=$ndj+120;
//冰防
$nbf=$ndj+120;
//火防
$nhf=$ndj+120;
//雷防
$nlf=$ndj+120;
//NPC被攻击说话语
$ntake="找死？是吧！";





//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");





} elseif ($npcc==820) {

//名字
$nname="【刀山鬼】";
//等级
$ndj=150;
//HP
$nhp=4000000;
//MAXHP
$nmaxhp=4000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=645433;
//魔攻
$nmg=645433;
//防御
$nfy=645433;
//魔防
$nmf=645433;
//冰攻
$nbg=$ndj+120;
//火攻
$nhg=$ndj+120;
//雷攻
$nlg=$ndj+120;
//冰防
$nbf=$ndj+120;
//火防
$nhf=$ndj+120;
//雷防
$nlf=$ndj+120;
//NPC被攻击说话语
$ntake="找死？是吧！";





//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");










} elseif ($npcc==821) {

//名字
$nname="【地藏王】";
//等级
$ndj=150;
//HP
$nhp=4200000;
//MAXHP
$nmaxhp=4200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=705433;
//魔攻
$nmg=705433;
//防御
$nfy=705433;
//魔防
$nmf=705433;
//冰攻
$nbg=$ndj+130;
//火攻
$nhg=$ndj+130;
//雷攻
$nlg=$ndj+130;
//冰防
$nbf=$ndj+130;
//火防
$nhf=$ndj+130;
//雷防
$nlf=$ndj+130;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=7;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


include("./wj/fb5jbs-4.php");




} elseif ($npcc==822) {

//名字
$nname="【冰山鬼】";
//等级
$ndj=150;
//HP
$nhp=4200000;
//MAXHP
$nmaxhp=4200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=735433;
//魔攻
$nmg=735433;
//防御
$nfy=735433;
//魔防
$nmf=735433;
//冰攻
$nbg=$ndj+140;
//火攻
$nhg=$ndj+140;
//雷攻
$nlg=$ndj+140;
//冰防
$nbf=$ndj+140;
//火防
$nhf=$ndj+140;
//雷防
$nlf=$ndj+140;
//NPC被攻击说话语
$ntake="找死？是吧！";



//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");



} elseif ($npcc==823) {

//名字
$nname="【冰山鬼】";
//等级
$ndj=150;
//HP
$nhp=4200000;
//MAXHP
$nmaxhp=4200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=735433;
//魔攻
$nmg=735433;
//防御
$nfy=735433;
//魔防
$nmf=735433;
//冰攻
$nbg=$ndj+140;
//火攻
$nhg=$ndj+140;
//雷攻
$nlg=$ndj+140;
//冰防
$nbf=$ndj+140;
//火防
$nhf=$ndj+140;
//雷防
$nlf=$ndj+140;
//NPC被攻击说话语
$ntake="找死？是吧！";



//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");
} elseif ($npcc==824) {

//名字
$nname="【孟婆】";
//等级
$ndj=150;
//HP
$nhp=4500000;
//MAXHP
$nmaxhp=4500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=838833;
//魔攻
$nmg=838833;
//防御
$nfy=838833;
//魔防
$nmf=838833;
//冰攻
$nbg=$ndj+150;
//火攻
$nhg=$ndj+150;
//雷攻
$nlg=$ndj+150;
//冰防
$nbf=$ndj+150;
//火防
$nhf=$ndj+150;
//雷防
$nlf=$ndj+150;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=9;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


include("./wj/fb5jbs-4.php");

} elseif ($npcc==825) {

//名字
$nname="【油锅鬼】";
//等级
$ndj=150;
//HP
$nhp=4800000;
//MAXHP
$nmaxhp=4800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=938833;
//魔攻
$nmg=938833;
//防御
$nfy=938833;
//魔防
$nmf=938833;
//冰攻
$nbg=$ndj+160;
//火攻
$nhg=$ndj+160;
//雷攻
$nlg=$ndj+160;
//冰防
$nbf=$ndj+160;
//火防
$nhf=$ndj+160;
//雷防
$nlf=$ndj+160;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");



} elseif ($npcc==826) {

//名字
$nname="【油锅鬼】";
//等级
$ndj=150;
//HP
$nhp=4800000;
//MAXHP
$nmaxhp=4800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=938833;
//魔攻
$nmg=938833;
//防御
$nfy=938833;
//魔防
$nmf=938833;
//冰攻
$nbg=$ndj+160;
//火攻
$nhg=$ndj+160;
//雷攻
$nlg=$ndj+160;
//冰防
$nbf=$ndj+160;
//火防
$nhf=$ndj+160;
//雷防
$nlf=$ndj+160;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");



} elseif ($npcc==827) {

//名字
$nname="【钟馗】";
//等级
$ndj=150;
//HP
$nhp=5000000;
//MAXHP
$nmaxhp=5000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1038833;
//魔攻
$nmg=1038833;
//防御
$nfy=1038833;
//魔防
$nmf=1038833;
//冰攻
$nbg=$ndj+170;
//火攻
$nhg=$ndj+170;
//雷攻
$nlg=$ndj+170;
//冰防
$nbf=$ndj+170;
//火防
$nhf=$ndj+170;
//雷防
$nlf=$ndj+170;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率
$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


include("./wj/fb5jbs-4.php");
} elseif ($npcc==828) {

//名字
$nname="【牛坑鬼】";
//等级
$ndj=150;
//HP
$nhp=5200000;
//MAXHP
$nmaxhp=5200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1113233;
//魔攻
$nmg=1113233;
//防御
$nfy=1113233;
//魔防
$nmf=1113233;
//冰攻
$nbg=$ndj+180;
//火攻
$nhg=$ndj+180;
//雷攻
$nlg=$ndj+180;
//冰防
$nbf=$ndj+180;
//火防
$nhf=$ndj+180;
//雷防
$nlf=$ndj+180;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");
} elseif ($npcc==829) {

//名字
$nname="【牛坑鬼】";
//等级
$ndj=150;
//HP
$nhp=5200000;
//MAXHP
$nmaxhp=5200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1113233;
//魔攻
$nmg=1113233;
//防御
$nfy=1113233;
//魔防
$nmf=1113233;
//冰攻
$nbg=$ndj+180;
//火攻
$nhg=$ndj+180;
//雷攻
$nlg=$ndj+180;
//冰防
$nbf=$ndj+180;
//火防
$nhf=$ndj+180;
//雷防
$nlf=$ndj+180;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率


include("./wj/fb5jbs-2.php");


} elseif ($npcc==830) {

//名字
$nname="【掌刑判官】";
//等级
$ndj=150;
//HP
$nhp=5500000;
//MAXHP
$nmaxhp=5500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1213233;
//魔攻
$nmg=1213233;
//防御
$nfy=1213233;
//魔防
$nmf=1213233;
//冰攻
$nbg=$ndj+200;
//火攻
$nhg=$ndj+200;
//雷攻
$nlg=$ndj+200;
//冰防
$nbf=$ndj+200;
//火防
$nhf=$ndj+200;
//雷防
$nlf=$ndj+200;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$bbdlsl= rand(1, 5);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率


$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖装备图纸〗（宠物）";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=550;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


$wpdz1[]="〖1千将军府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=11;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千普陀山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=12;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千龙宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=13;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千月宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=14;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千方寸山声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=15;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率



$wpdz1[]="〖1千天宫声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=16;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千地府声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=17;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


$wpdz1[]="〖1千西游声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=18;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千乌鸡国声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=19;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千夫妻声望卷〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=21;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率

$wpdz1[]="〖1千法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=422;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=40;//	多少爆率


include("./wj/fb5jbs-4.php");



} elseif ($npcc==831) {

//名字
$nname="【石压鬼】";
//等级
$ndj=150;
//HP
$nhp=5600000;
//MAXHP
$nmaxhp=5600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1253233;
//魔攻
$nmg=1253233;
//防御
$nfy=1253233;
//魔防
$nmf=1253233;
//冰攻
$nbg=$ndj+200;
//火攻
$nhg=$ndj+200;
//雷攻
$nlg=$ndj+200;
//冰防
$nbf=$ndj+200;
//火防
$nhf=$ndj+200;
//雷防
$nlf=$ndj+200;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==832) {

//名字
$nname="【石压鬼】";
//等级
$ndj=150;
//HP
$nhp=5600000;
//MAXHP
$nmaxhp=5600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1253233;
//魔攻
$nmg=1253233;
//防御
$nfy=1253233;
//魔防
$nmf=1253233;
//冰攻
$nbg=$ndj+200;
//火攻
$nhg=$ndj+200;
//雷攻
$nlg=$ndj+200;
//冰防
$nbf=$ndj+200;
//火防
$nhf=$ndj+200;
//雷防
$nlf=$ndj+200;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==833) {

//名字
$nname="【掌善判官】";
//等级
$ndj=160;
//HP
$nhp=5800000;
//MAXHP
$nmaxhp=5800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1283233;
//魔攻
$nmg=1283233;
//防御
$nfy=1283233;
//魔防
$nmf=1283233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

} elseif ($npcc==834) {

//名字
$nname="【舂臼鬼】";
//等级
$ndj=160;
//HP
$nhp=5900000;
//MAXHP
$nmaxhp=5900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1293233;
//魔攻
$nmg=1293233;
//防御
$nfy=1293233;
//魔防
$nmf=1293233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==835) {

//名字
$nname="【舂臼鬼】";
//等级
$ndj=160;
//HP
$nhp=5900000;
//MAXHP
$nmaxhp=5900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1293233;
//魔攻
$nmg=1293233;
//防御
$nfy=1293233;
//魔防
$nmf=1293233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==836) {

//名字
$nname="【掌恶判官】";
//等级
$ndj=165;
//HP
$nhp=6000000;
//MAXHP
$nmaxhp=6000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1303233;
//魔攻
$nmg=1303233;
//防御
$nfy=1303233;
//魔防
$nmf=1303233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率


} elseif ($npcc==837) {

//名字
$nname="【血池鬼】";
//等级
$ndj=165;
//HP
$nhp=6200000;
//MAXHP
$nmaxhp=6200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1323233;
//魔攻
$nmg=1323233;
//防御
$nfy=1323233;
//魔防
$nmf=1323233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==838) {

//名字
$nname="【血池鬼】";
//等级
$ndj=165;
//HP
$nhp=6200000;
//MAXHP
$nmaxhp=6200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1323233;
//魔攻
$nmg=1323233;
//防御
$nfy=1323233;
//魔防
$nmf=1323233;
//冰攻
$nbg=$ndj+210;
//火攻
$nhg=$ndj+210;
//雷攻
$nlg=$ndj+210;
//冰防
$nbf=$ndj+210;
//火防
$nhf=$ndj+210;
//雷防
$nlf=$ndj+210;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==839) {

//名字
$nname="【生死判官】";
//等级
$ndj=170;
//HP
$nhp=6500000;
//MAXHP
$nmaxhp=6500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1353233;
//魔攻
$nmg=1353233;
//防御
$nfy=1353233;
//魔防
$nmf=1353233;
//冰攻
$nbg=$ndj+215;
//火攻
$nhg=$ndj+215;
//雷攻
$nlg=$ndj+215;
//冰防
$nbf=$ndj+215;
//火防
$nhf=$ndj+215;
//雷防
$nlf=$ndj+215;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
} elseif ($npcc==840) {

//名字
$nname="【枉死鬼】";
//等级
$ndj=170;
//HP
$nhp=6600000;
//MAXHP
$nmaxhp=6600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1373233;
//魔攻
$nmg=1373233;
//防御
$nfy=1373233;
//魔防
$nmf=1373233;
//冰攻
$nbg=$ndj+215;
//火攻
$nhg=$ndj+215;
//雷攻
$nlg=$ndj+215;
//冰防
$nbf=$ndj+215;
//火防
$nhf=$ndj+215;
//雷防
$nlf=$ndj+215;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==841) {

//名字
$nname="【枉死鬼】";
//等级
$ndj=170;
//HP
$nhp=6600000;
//MAXHP
$nmaxhp=6600000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1373233;
//魔攻
$nmg=1373233;
//防御
$nfy=1373233;
//魔防
$nmf=1373233;
//冰攻
$nbg=$ndj+215;
//火攻
$nhg=$ndj+215;
//雷攻
$nlg=$ndj+215;
//冰防
$nbf=$ndj+215;
//火防
$nhf=$ndj+215;
//雷防
$nlf=$ndj+215;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



} elseif ($npcc==842) {

//名字
$nname="【五官王】";
//等级
$ndj=175;
//HP
$nhp=6800000;
//MAXHP
$nmaxhp=6800000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1403233;
//魔攻
$nmg=1403233;
//防御
$nfy=1403233;
//魔防
$nmf=1403233;
//冰攻
$nbg=$ndj+220;
//火攻
$nhg=$ndj+220;
//雷攻
$nlg=$ndj+220;
//冰防
$nbf=$ndj+220;
//火防
$nhf=$ndj+220;
//雷防
$nlf=$ndj+220;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率


} elseif ($npcc==843) {

//名字
$nname="【磔刑鬼】";
//等级
$ndj=175;
//HP
$nhp=7000000;
//MAXHP
$nmaxhp=7000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1433233;
//魔攻
$nmg=1433233;
//防御
$nfy=1433233;
//魔防
$nmf=1433233;
//冰攻
$nbg=$ndj+220;
//火攻
$nhg=$ndj+220;
//雷攻
$nlg=$ndj+220;
//冰防
$nbf=$ndj+220;
//火防
$nhf=$ndj+220;
//雷防
$nlf=$ndj+220;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==844) {

//名字
$nname="【磔刑鬼】";
//等级
$ndj=175;
//HP
$nhp=7000000;
//MAXHP
$nmaxhp=7000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1433233;
//魔攻
$nmg=1433233;
//防御
$nfy=1433233;
//魔防
$nmf=1433233;
//冰攻
$nbg=$ndj+220;
//火攻
$nhg=$ndj+220;
//雷攻
$nlg=$ndj+220;
//冰防
$nbf=$ndj+220;
//火防
$nhf=$ndj+220;
//雷防
$nlf=$ndj+220;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



} elseif ($npcc==845) {

//名字
$nname="【泰山王】";
//等级
$ndj=180;
//HP
$nhp=7300000;
//MAXHP
$nmaxhp=7300000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1453233;
//魔攻
$nmg=1453233;
//防御
$nfy=1453233;
//魔防
$nmf=1453233;
//冰攻
$nbg=$ndj+225;
//火攻
$nhg=$ndj+225;
//雷攻
$nlg=$ndj+225;
//冰防
$nbf=$ndj+225;
//火防
$nhf=$ndj+225;
//雷防
$nlf=$ndj+225;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$bbdlsl= rand(1, 10);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==846) {

//名字
$nname="【火山鬼】";
//等级
$ndj=180;
//HP
$nhp=7500000;
//MAXHP
$nmaxhp=7500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1503233;
//魔攻
$nmg=1503233;
//防御
$nfy=1503233;
//魔防
$nmf=1503233;
//冰攻
$nbg=$ndj+225;
//火攻
$nhg=$ndj+225;
//雷攻
$nlg=$ndj+225;
//冰防
$nbf=$ndj+225;
//火防
$nhf=$ndj+225;
//雷防
$nlf=$ndj+225;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==847) {

//名字
$nname="【火山鬼】";
//等级
$ndj=180;
//HP
$nhp=7500000;
//MAXHP
$nmaxhp=7500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1503233;
//魔攻
$nmg=1503233;
//防御
$nfy=1503233;
//魔防
$nmf=1503233;
//冰攻
$nbg=$ndj+225;
//火攻
$nhg=$ndj+225;
//雷攻
$nlg=$ndj+225;
//冰防
$nbf=$ndj+225;
//火防
$nhf=$ndj+225;
//雷防
$nlf=$ndj+225;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==848) {

//名字
$nname="【轮回王】";
//等级
$ndj=185;
//HP
$nhp=7700000;
//MAXHP
$nmaxhp=7700000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1503233;
//魔攻
$nmg=1553233;
//防御
$nfy=1553233;
//魔防
$nmf=1503233;
//冰攻
$nbg=$ndj+230;
//火攻
$nhg=$ndj+230;
//雷攻
$nlg=$ndj+230;
//冰防
$nbf=$ndj+230;
//火防
$nhf=$ndj+230;
//雷防
$nlf=$ndj+230;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==849) {

//名字
$nname="【石磨鬼】";
//等级
$ndj=185;
//HP
$nhp=7900000;
//MAXHP
$nmaxhp=7900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1603233;
//魔攻
$nmg=1603233;
//防御
$nfy=1603233;
//魔防
$nmf=1603233;
//冰攻
$nbg=$ndj+230;
//火攻
$nhg=$ndj+230;
//雷攻
$nlg=$ndj+230;
//冰防
$nbf=$ndj+230;
//火防
$nhf=$ndj+230;
//雷防
$nlf=$ndj+230;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==850) {

//名字
$nname="【石磨鬼】";
//等级
$ndj=185;
//HP
$nhp=7900000;
//MAXHP
$nmaxhp=7900000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1603233;
//魔攻
$nmg=1603233;
//防御
$nfy=1603233;
//魔防
$nmf=1603233;
//冰攻
$nbg=$ndj+230;
//火攻
$nhg=$ndj+230;
//雷攻
$nlg=$ndj+230;
//冰防
$nbf=$ndj+230;
//火防
$nhf=$ndj+230;
//雷防
$nlf=$ndj+230;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==851) {

//名字
$nname="【赏善司】";
//等级
$ndj=190;
//HP
$nhp=8000000;
//MAXHP
$nmaxhp=8000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1703233;
//魔攻
$nmg=1703233;
//防御
$nfy=1703233;
//魔防
$nmf=1703233;
//冰攻
$nbg=$ndj+240;
//火攻
$nhg=$ndj+240;
//雷攻
$nlg=$ndj+240;
//冰防
$nbf=$ndj+240;
//火防
$nhf=$ndj+240;
//雷防
$nlf=$ndj+240;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==852) {

//名字
$nname="【刀锯鬼】";
//等级
$ndj=190;
//HP
$nhp=8000000;
//MAXHP
$nmaxhp=8000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1753233;
//魔攻
$nmg=1753233;
//防御
$nfy=1753233;
//魔防
$nmf=1753233;
//冰攻
$nbg=$ndj+240;
//火攻
$nhg=$ndj+240;
//雷攻
$nlg=$ndj+240;
//冰防
$nbf=$ndj+240;
//火防
$nhf=$ndj+240;
//雷防
$nlf=$ndj+240;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==853) {

//名字
$nname="【刀锯鬼】";
//等级
$ndj=190;
//HP
$nhp=8000000;
//MAXHP
$nmaxhp=8000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1753233;
//魔攻
$nmg=1753233;
//防御
$nfy=1753233;
//魔防
$nmf=1753233;
//冰攻
$nbg=$ndj+240;
//火攻
$nhg=$ndj+240;
//雷攻
$nlg=$ndj+240;
//冰防
$nbf=$ndj+240;
//火防
$nhf=$ndj+240;
//雷防
$nlf=$ndj+240;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==854) {

//名字
$nname="【罚恶司】";
//等级
$ndj=195;
//HP
$nhp=8500000;
//MAXHP
$nmaxhp=8500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1803233;
//魔攻
$nmg=1803233;
//防御
$nfy=1803233;
//魔防
$nmf=1803233;
//冰攻
$nbg=$ndj+250;
//火攻
$nhg=$ndj+250;
//雷攻
$nlg=$ndj+250;
//冰防
$nbf=$ndj+250;
//火防
$nhf=$ndj+250;
//雷防
$nlf=$ndj+250;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==855) {

//名字
$nname="【无边鬼】";
//等级
$ndj=195;
//HP
$nhp=8500000;
//MAXHP
$nmaxhp=8500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1853233;
//魔攻
$nmg=1853233;
//防御
$nfy=1853233;
//魔防
$nmf=1853233;
//冰攻
$nbg=$ndj+250;
//火攻
$nhg=$ndj+250;
//雷攻
$nlg=$ndj+250;
//冰防
$nbf=$ndj+250;
//火防
$nhf=$ndj+250;
//雷防
$nlf=$ndj+250;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==856) {

//名字
$nname="【无边鬼】";
//等级
$ndj=195;
//HP
$nhp=8500000;
//MAXHP
$nmaxhp=8500000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1853233;
//魔攻
$nmg=1853233;
//防御
$nfy=1853233;
//魔防
$nmf=1853233;
//冰攻
$nbg=$ndj+250;
//火攻
$nhg=$ndj+250;
//雷攻
$nlg=$ndj+250;
//冰防
$nbf=$ndj+250;
//火防
$nhf=$ndj+250;
//雷防
$nlf=$ndj+250;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==857) {

//名字
$nname="【冥府判官】";
//等级
$ndj=200;
//HP
$nhp=9000000;
//MAXHP
$nmaxhp=9000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=1903233;
//魔攻
$nmg=1903233;
//防御
$nfy=1903233;
//魔防
$nmf=1903233;
//冰攻
$nbg=$ndj+255;
//火攻
$nhg=$ndj+255;
//雷攻
$nlg=$ndj+255;
//冰防
$nbf=$ndj+255;
//火防
$nhf=$ndj+255;
//雷防
$nlf=$ndj+255;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==858) {

//名字
$nname="【无尽鬼】";
//等级
$ndj=210;
//HP
$nhp=9200000;
//MAXHP
$nmaxhp=9200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2003233;
//魔攻
$nmg=2003233;
//防御
$nfy=2003233;
//魔防
$nmf=2003233;
//冰攻
$nbg=$ndj+255;
//火攻
$nhg=$ndj+255;
//雷攻
$nlg=$ndj+255;
//冰防
$nbf=$ndj+255;
//火防
$nhf=$ndj+255;
//雷防
$nlf=$ndj+255;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==859) {

//名字
$nname="【无尽鬼】";
//等级
$ndj=210;
//HP
$nhp=9200000;
//MAXHP
$nmaxhp=9200000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2003233;
//魔攻
$nmg=2003233;
//防御
$nfy=2003233;
//魔防
$nmf=2003233;
//冰攻
$nbg=$ndj+255;
//火攻
$nhg=$ndj+255;
//雷攻
$nlg=$ndj+255;
//冰防
$nbf=$ndj+255;
//火防
$nhf=$ndj+255;
//雷防
$nlf=$ndj+255;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==860) {

//名字
$nname="【阎罗王】";
//等级
$ndj=220;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2203233;
//魔攻
$nmg=2203233;
//防御
$nfy=2203233;
//魔防
$nmf=2203233;
//冰攻
$nbg=$ndj+260;
//火攻
$nhg=$ndj+260;
//雷攻
$nlg=$ndj+260;
//冰防
$nbf=$ndj+260;
//火防
$nhf=$ndj+260;
//雷防
$nlf=$ndj+260;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖齐天大圣〗（宠物蛋）";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=570;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$bbdlsl= rand(1, 20);
$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖钻符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=511;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==861) {
$xsbl=1;
//名字
$nname="【玉兔】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率













} elseif ($npcc==862) {
$xsbl=2;
//名字
$nname="【玉蟾】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==863) {
$xsbl=3;
//名字
$nname="【嫦娥】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==864) {
$xsbl=4;
//名字
$nname="【七仙女】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==865) {
$xsbl=5;
//名字
$nname="【哪吒】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==866) {
$xsbl=6;
//名字
$nname="【天蓬元帅】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==867) {
$xsbl=7;
//名字
$nname="【风伯】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==868) {
$xsbl=8;
//名字
$nname="【雨师】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==869) {
$xsbl=9;
//名字
$nname="【道行天尊】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==870) {
$xsbl=10;
//名字
$nname="【雷公】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率


} elseif ($npcc==871) {
$xsbl=11;
//名字
$nname="【电母】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==872) {
$xsbl=12;
//名字
$nname="【清虚道德真君】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==873) {
$xsbl=13;
//名字
$nname="【鹤童】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率


} elseif ($npcc==874) {
$xsbl=14;
//名字
$nname="【鹿童】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==875) {
$xsbl=15;
//名字
$nname="【南极仙翁】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$bbdlsl= rand(1, 3);
$wpdz1[]="〖大号财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=487;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

} elseif ($npcc==876) {
$xsbl=16;
//名字
$nname="【金吒】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==877) {
$xsbl=17;
//名字
$nname="【木吒】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==878) {
$xsbl=18;
//名字
$nname="【托塔天王李靖】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==879) {
$xsbl=19;
//名字
$nname="【千里眼】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率


} elseif ($npcc==880) {
$xsbl=20;
//名字
$nname="【顺风耳】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==881) {
$xsbl=21;
//名字
$nname="【太白金星】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==882) {
$xsbl=22;
//名字
$nname="【金童】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率


} elseif ($npcc==883) {
$xsbl=23;
//名字
$nname="【玉女】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率


} elseif ($npcc==884) {
$xsbl=24;
//名字
$nname="【太上老君】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==885) {
$xsbl=25;
//名字
$nname="【三圣母】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==886) {
$xsbl=26;
//名字
$nname="【麻姑】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==887) {
$xsbl=27;
//名字
$nname="【王母娘娘】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==888) {
$xsbl=28;
//名字
$nname="【二郎神】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==889) {
$xsbl=29;
//名字
$nname="【哮天犬】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==890) {
$xsbl=30;
//名字
$nname="【玉皇大帝】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");



$bbdlsl= rand(1, 5);
$wpdz1[]="〖大号财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=487;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率



$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率



} elseif ($npcc==891) {
$xsbl=1;
//名字
$nname="【巨蟒怪】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率













} elseif ($npcc==892) {
$xsbl=2;
//名字
$nname="【巨蟒怪】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==893) {
$xsbl=3;
//名字
$nname="【黄眉老佛】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==894) {
$xsbl=4;
//名字
$nname="【蜘蛛精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==895) {
$xsbl=5;
//名字
$nname="【蜘蛛精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==896) {
$xsbl=6;
//名字
$nname="【百眼魔君】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=20;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==897) {
$xsbl=7;
//名字
$nname="【金鱼精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==898) {
$xsbl=8;
//名字
$nname="【鳜鱼精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==899) {
$xsbl=9;
//名字
$nname="【南山大王】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==900) {
$xsbl=10;
//名字
$nname="【狐妖】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率




} else{

$nccp=2;
echo "<font color=black>没有这个id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}












?>



