<?php

if($npcc ==901){
$xsbl=11;
//名字
$nname="【狐妖】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==902) {
$xsbl=12;
//名字
$nname="【七情大王】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==903) {
$xsbl=13;
//名字
$nname="【如意牛精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率


} elseif ($npcc==904) {
$xsbl=14;
//名字
$nname="【如意牛精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==905) {
$xsbl=15;
//名字
$nname="【六欲大王】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");



$bbdlsl= rand(1, 3);
$wpdz1[]="〖大号财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=487;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=5;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

} elseif ($npcc==906) {
$xsbl=16;
//名字
$nname="【青狮精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==907) {
$xsbl=17;
//名字
$nname="【青狮精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率
} elseif ($npcc==908) {
$xsbl=18;
//名字
$nname="【南天王殿】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==909) {
$xsbl=19;
//名字
$nname="【白骨精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率


} elseif ($npcc==910) {
$xsbl=20;
//名字
$nname="【白骨精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==911) {
$xsbl=21;
//名字
$nname="【三尸魔王】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==912) {
$xsbl=22;
//名字
$nname="【蜈蚣精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率


} elseif ($npcc==913) {
$xsbl=23;
//名字
$nname="【蜈蚣精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率


} elseif ($npcc==914) {
$xsbl=24;
//名字
$nname="【玉面娘娘】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==915) {
$xsbl=25;
//名字
$nname="【蝎子精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==916) {
$xsbl=26;
//名字
$nname="【蝎子精】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==917) {
$xsbl=27;
//名字
$nname="【地涌夫人】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==918) {
$xsbl=28;
//名字
$nname="【镇元大仙】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==919) {
$xsbl=29;
//名字
$nname="【镇元大仙】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

} elseif ($npcc==920) {
$xsbl=30;
//名字
$nname="【菩提老祖】";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");




$bbdlsl= rand(1, 5);
$wpdz1[]="〖大号财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=487;//物品id
$wpdz4[]=$bbdlsl;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖财宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=453;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=10;//	多少爆率

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=10;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=100;//	多少爆率

} elseif ($npcc==921) {
//名字
$nname="〖活动〗金银山山神";
//等级
$ndj=200;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2203233;
//魔攻
$nmg=2203233;
//防御
$nfy=2203233;
//魔防
$nmf=2203233;
//冰攻
$nbg=$ndj+260;
//火攻
$nhg=$ndj+260;
//雷攻
$nlg=$ndj+260;
//冰防
$nbf=$ndj+260;
//火防
$nhf=$ndj+260;
//雷防
$nlf=$ndj+260;
//NPC被攻击说话语
$ntake="找死？是吧！";



} elseif ($npcc==922) {
//名字
$nname="〖活动〗牛郎";
//等级
$ndj=200;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2203233;
//魔攻
$nmg=2203233;
//防御
$nfy=2203233;
//魔防
$nmf=2203233;
//冰攻
$nbg=$ndj+260;
//火攻
$nhg=$ndj+260;
//雷攻
$nlg=$ndj+260;
//冰防
$nbf=$ndj+260;
//火防
$nhf=$ndj+260;
//雷防
$nlf=$ndj+260;
//NPC被攻击说话语
$ntake="找死？是吧！";




} elseif ($npcc==923) {
//名字
$nname="〖活动〗织女";
//等级
$ndj=200;
//HP
$nhp=10000000;
//MAXHP
$nmaxhp=10000000;
//MP
$nmp=10000;
//MAXMP
$nmaxmp=10000;
//攻击
$ngj=2203233;
//魔攻
$nmg=2203233;
//防御
$nfy=2203233;
//魔防
$nmf=2203233;
//冰攻
$nbg=$ndj+260;
//火攻
$nhg=$ndj+260;
//雷攻
$nlg=$ndj+260;
//冰防
$nbf=$ndj+260;
//火防
$nhf=$ndj+260;
//雷防
$nlf=$ndj+260;
//NPC被攻击说话语
$ntake="找死？是吧！";



} elseif ($npcc==924) {//副本boss普通

//名字
$xsbl=1;
//名字
$nname="【鹿头军师】（普通）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==925) {//副本boss困难

//名字
$xsbl=2;
//名字
$nname="【鹿头军师】（困难）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");



$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==926) {//副本boss梦魇

//名字
$xsbl=3;
//名字
$nname="【鹿头军师】（梦魇）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==927) {//副本boss地狱


//名字
$xsbl=4;
//名字
$nname="【鹿头军师】（地狱）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==928) {//副本boss普通

//名字
$xsbl=2;
//名字
$nname="【花豹将军】（普通）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率





} elseif ($npcc==929) {//副本boss困难

//名字
$xsbl=3;
//名字
$nname="【花豹将军】（困难）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==930) {//副本boss梦魇

//名字
$xsbl=4;
//名字
$nname="【花豹将军】（梦魇）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==931) {//副本boss地狱
//名字
$nname="【花豹将军】（地狱）";

//名字
$xsbl=5;
//名字
$nname="【花豹将军】（梦魇）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率




} elseif ($npcc==932) {//副本boss普通
//名字
$xsbl=3;
//名字
$nname="【山妖头目】（普通）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


} elseif ($npcc==933) {//副本boss困难
//名字
$xsbl=4;
//名字
$nname="【山妖头目】（困难）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



} elseif ($npcc==934) {//副本boss梦魇
//名字
$xsbl=5;
//名字
$nname="【山妖头目】（梦魇）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



} elseif ($npcc==935) {//副本boss地狱


$xsbl=6;
//名字
$nname="【山妖头目】（地狱）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



} elseif ($npcc==936) {//副本boss普通

$xsbl=4;
//名字
$nname="【金兜大王】（普通）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==937) {//副本boss困难

$xsbl=5;
//名字
$nname="【金兜大王】（困难）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==938) {//副本boss梦魇

$xsbl=6;
//名字
$nname="【金兜大王】（梦魇）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率

} elseif ($npcc==939) {//副本boss地狱

$xsbl=7;
//名字
$nname="【金兜大王】（地狱）";
//等级
$ndj=120+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖大圣精魄〗";//名字
$wpdz2[]=4;//物品分类
$wpdz3[]=571;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=80;//	多少爆率

} elseif ($npcc==940) {//副本boss普通

$xsbl=1;
//名字
$nname="【瑶池守将】（普通）";
//等级
$ndj=100+1*$xsbl;
//HP
$nhp=100000+50000*$xsbl;
//MAXHP
$nmaxhp=100000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=100000+80000*$xsbl;
//魔攻
$nmg=100000+80000*$xsbl;
//防御
$nfy=100000+80000*$xsbl;
//魔防
$nmf=100000+80000*$xsbl;
//冰攻
$nbg=$ndj+100+10*$xsbl;
//火攻
$nhg=$ndj+100+10*$xsbl;
//雷攻
$nlg=$ndj+100+10*$xsbl;
//冰防
$nbf=$ndj+100+10*$xsbl;
//火防
$nhf=$ndj+100+10*$xsbl;
//雷防
$nlf=$ndj+100+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==941) {//副本boss困难
$xsbl=2;
//名字
$nname="【瑶池守将】（困难）";
//等级
$ndj=100+1*$xsbl;
//HP
$nhp=100000+50000*$xsbl;
//MAXHP
$nmaxhp=100000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=100000+80000*$xsbl;
//魔攻
$nmg=100000+80000*$xsbl;
//防御
$nfy=100000+80000*$xsbl;
//魔防
$nmf=100000+80000*$xsbl;
//冰攻
$nbg=$ndj+100+10*$xsbl;
//火攻
$nhg=$ndj+100+10*$xsbl;
//雷攻
$nlg=$ndj+100+10*$xsbl;
//冰防
$nbf=$ndj+100+10*$xsbl;
//火防
$nhf=$ndj+100+10*$xsbl;
//雷防
$nlf=$ndj+100+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==942) {//副本boss梦魇

$xsbl=3;
//名字
$nname="【瑶池守将】（梦魇）";
//等级
$ndj=100+1*$xsbl;
//HP
$nhp=100000+50000*$xsbl;
//MAXHP
$nmaxhp=100000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=100000+80000*$xsbl;
//魔攻
$nmg=100000+80000*$xsbl;
//防御
$nfy=100000+80000*$xsbl;
//魔防
$nmf=100000+80000*$xsbl;
//冰攻
$nbg=$ndj+100+10*$xsbl;
//火攻
$nhg=$ndj+100+10*$xsbl;
//雷攻
$nlg=$ndj+100+10*$xsbl;
//冰防
$nbf=$ndj+100+10*$xsbl;
//火防
$nhf=$ndj+100+10*$xsbl;
//雷防
$nlf=$ndj+100+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==943) {//副本boss地狱
$xsbl=4;
//名字
$nname="【瑶池守将】（地狱）";
//等级
$ndj=100+1*$xsbl;
//HP
$nhp=100000+50000*$xsbl;
//MAXHP
$nmaxhp=100000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=100000+80000*$xsbl;
//魔攻
$nmg=100000+80000*$xsbl;
//防御
$nfy=100000+80000*$xsbl;
//魔防
$nmf=100000+80000*$xsbl;
//冰攻
$nbg=$ndj+100+10*$xsbl;
//火攻
$nhg=$ndj+100+10*$xsbl;
//雷攻
$nlg=$ndj+100+10*$xsbl;
//冰防
$nbf=$ndj+100+10*$xsbl;
//火防
$nhf=$ndj+100+10*$xsbl;
//雷防
$nlf=$ndj+100+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==944) {//副本boss普通
//名字
$xsbl=1;
//名字
$nname="【碧波仙女】（普通）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==945) {//副本boss困难



//名字
$xsbl=2;
//名字
$nname="【碧波仙女】（困难）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");




$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率








} elseif ($npcc==946) {//副本boss梦魇


//名字
$xsbl=3;
//名字
$nname="【碧波仙女】（梦魇）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==947) {//副本boss地狱

//名字
$xsbl=4;
//名字
$nname="【碧波仙女】（地狱）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==948) {//副本boss普通

//名字
$xsbl=2;
//名字
$nname="【紫霞仙子】（普通）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==949) {//副本boss困难

//名字
$xsbl=3;
//名字
$nname="【紫霞仙子】（困难）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==950) {//副本boss梦魇

//名字
$xsbl=4;
//名字
$nname="【紫霞仙子】（梦魇）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==951) {//副本boss地狱

//名字
$xsbl=5;
//名字
$nname="【紫霞仙子】（地狱）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖银符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=513;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



} elseif ($npcc==952) {//副本boss普通

//名字
$xsbl=3;
//名字
$nname="【王母娘娘】（普通）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==953) {//副本boss困难

//名字
$xsbl=4;
//名字
$nname="【王母娘娘】（困难）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==954) {//副本boss梦魇

//名字
$xsbl=5;
//名字
$nname="【王母娘娘】（梦魇）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==955) {//副本boss地狱

//名字
$xsbl=6;
//名字
$nname="【王母娘娘】（梦魇）";
//等级
$ndj=110+1*$xsbl;
//HP
$nhp=120000+50000*$xsbl;
//MAXHP
$nmaxhp=120000+500000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=120000+80000*$xsbl;
//魔攻
$nmg=120000+80000*$xsbl;
//防御
$nfy=120000+80000*$xsbl;
//魔防
$nmf=120000+80000*$xsbl;
//冰攻
$nbg=$ndj+110+10*$xsbl;
//火攻
$nhg=$ndj+110+10*$xsbl;
//雷攻
$nlg=$ndj+110+10*$xsbl;
//冰防
$nbf=$ndj+110+10*$xsbl;
//火防
$nhf=$ndj+110+10*$xsbl;
//雷防
$nlf=$ndj+110+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖金符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=510;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



} elseif ($npcc==956) {//副本boss普通

$xsbl=7;
//名字
$nname="【黑鳞鲛人】（普通）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==957) {//副本boss困难

$xsbl=8;
//名字
$nname="【黑鳞鲛人】（困难）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==958) {//副本boss梦魇

$xsbl=9;
//名字
$nname="【黑鳞鲛人】（梦魇）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==959) {//副本boss地狱

$xsbl=10;
//名字
$nname="【黑鳞鲛人】（地狱）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==960) {//副本boss普通

$xsbl=8;
//名字
$nname="【倚海龙王】（普通）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==961) {//副本boss困难

$xsbl=9;
//名字
$nname="【倚海龙王】（困难）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==962) {//副本boss梦魇

$xsbl=10;
//名字
$nname="【倚海龙王】（梦魇）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==963) {//副本boss地狱

$xsbl=11;
//名字
$nname="【倚海龙王】（地狱）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



} elseif ($npcc==964) {//副本boss普通

$xsbl=9;
//名字
$nname="【银鳞大王】（普通）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==965) {//副本boss困难

$xsbl=10;
//名字
$nname="【银鳞大王】（困难）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
} elseif ($npcc==966) {//副本boss梦魇

$xsbl=11;
//名字
$nname="【银鳞大王】（梦魇）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==967) {//副本boss地狱

$xsbl=12;
//名字
$nname="【银鳞大王】（地狱）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==968) {//副本boss普通

$xsbl=10;
//名字
$nname="【金鳞大王】（普通）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==969) {//副本boss困难

$xsbl=11;
//名字
$nname="【金鳞大王】（困难）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=2;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==970) {//副本boss梦魇

$xsbl=12;
//名字
$nname="【金鳞大王】（梦魇）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=3;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
} elseif ($npcc==971) {//副本boss地狱

$xsbl=13;
//名字
$nname="【金鳞大王】（地狱）";
//等级
$ndj=140+1*$xsbl;
//HP
$nhp=800000+50000*$xsbl;
//MAXHP
$nmaxhp=800000+50000*$xsbl;
//MP
$nmp=1000+5000*$xsbl;
//MAXMP
$nmaxmp=1000+5000*$xsbl;
//攻击
$ngj=500000+80000*$xsbl;
//魔攻
$nmg=500000+80000*$xsbl;
//防御
$nfy=500000+80000*$xsbl;
//魔防
$nmf=500000+80000*$xsbl;
//冰攻
$nbg=$ndj+180+10*$xsbl;
//火攻
$nhg=$ndj+180+10*$xsbl;
//雷攻
$nlg=$ndj+180+10*$xsbl;
//冰防
$nbf=$ndj+180+10*$xsbl;
//火防
$nhf=$ndj+180+10*$xsbl;
//雷防
$nlf=$ndj+180+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";
//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=4;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=80;//	多少爆率


} elseif ($npcc==972) {//副本boss普通

$xsbl=1;
//名字
$nname="【铁扇公主】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==973) {//副本boss困难

$xsbl=2;
//名字
$nname="【铁扇公主】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==974) {//副本boss梦魇

$xsbl=3;
//名字
$nname="【铁扇公主】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率








} elseif ($npcc==975) {//副本boss地狱

$xsbl=4;
//名字
$nname="【铁扇公主】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==976) {//副本boss普通

$xsbl=2;
//名字
$nname="【牛魔王】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



} elseif ($npcc==977) {//副本boss困难

$xsbl=3;
//名字
$nname="【牛魔王】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率
$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

} elseif ($npcc==978) {//副本boss梦魇


$xsbl=4;
//名字
$nname="【牛魔王】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";

//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率
} elseif ($npcc==979) {//副本boss地狱

$xsbl=5;
//名字
$nname="【牛魔王】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率



$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=80;//	多少爆率

} elseif ($npcc==980) {//副本boss普通

$xsbl=3;
//名字
$nname="【守门金刚】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==981) {//副本boss困难

$xsbl=4;
//名字
$nname="【守门金刚】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==982) {//副本boss梦魇

$xsbl=5;
//名字
$nname="【守门金刚】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



} elseif ($npcc==983) {//副本boss地狱

$xsbl=6;
//名字
$nname="【守门金刚】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==984) {//副本boss普通

$xsbl=4;
//名字
$nname="【灵山接引僧】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==985) {//副本boss困难

$xsbl=5;
//名字
$nname="【灵山接引僧】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==986) {//副本boss梦魇

$xsbl=6;
//名字
$nname="【灵山接引僧】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率




} elseif ($npcc==987) {//副本boss地狱

$xsbl=7;
//名字
$nname="【灵山接引僧】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==988) {//副本boss普通

$xsbl=8;
//名字
$nname="【迦叶】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==989) {//副本boss困难

$xsbl=9;
//名字
$nname="【迦叶】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



} elseif ($npcc==990) {//副本boss梦魇

$xsbl=10;
//名字
$nname="【迦叶】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==991) {//副本boss地狱

$xsbl=11;
//名字
$nname="【迦叶】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



} elseif ($npcc==992) {//副本boss普通

$xsbl=9;
//名字
$nname="【青莲妖女】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==993) {//副本boss困难

$xsbl=10;
//名字
$nname="【青莲妖女】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


} elseif ($npcc==994) {//副本boss梦魇

$xsbl=11;
//名字
$nname="【青莲妖女】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");

$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

} elseif ($npcc==995) {//副本boss地狱

$xsbl=12;
//名字
$nname="【青莲妖女】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



} elseif ($npcc==996) {//副本boss普通

$xsbl=10;
//名字
$nname="【黄眉老佛】（普通）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率





} elseif ($npcc==997) {//副本boss困难

$xsbl=11;
//名字
$nname="【黄眉老佛】（困难）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率

$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率
} elseif ($npcc==998) {//副本boss梦魇


$xsbl=12;
//名字
$nname="【黄眉老佛】（梦魇）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");
$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率


$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=60;//	多少爆率


} elseif ($npcc==999) {//副本boss地狱

$xsbl=15;
//名字
$nname="【黄眉老佛】（地狱）";
//等级
$ndj=200+1*$xsbl;
//HP
$nhp=10000000+500000*$xsbl;
//MAXHP
$nmaxhp=10000000+500000*$xsbl;
//MP
$nmp=10000+50000*$xsbl;
//MAXMP
$nmaxmp=10000+50000*$xsbl;
//攻击
$ngj=2203233+80000*$xsbl;
//魔攻
$nmg=2203233+80000*$xsbl;
//防御
$nfy=2203233+80000*$xsbl;
//魔防
$nmf=2203233+80000*$xsbl;
//冰攻
$nbg=$ndj+260+10*$xsbl;
//火攻
$nhg=$ndj+260+10*$xsbl;
//雷攻
$nlg=$ndj+260+10*$xsbl;
//冰防
$nbf=$ndj+260+10*$xsbl;
//火防
$nhf=$ndj+260+10*$xsbl;
//雷防
$nlf=$ndj+260+10*$xsbl;
//NPC被攻击说话语
$ntake="找死？是吧！";


//死亡掉落

include("./wj/hddl.php");


$wpdz1[]="〖1万法宝经验卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=423;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖1万西游声望卷轴〗";//名字
$wpdz2[]=1;//物品分类
$wpdz3[]=427;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率

$wpdz1[]="〖陨符碎片〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=512;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=50;//	多少爆率


$wpdz1[]="〖圣灵锻造图纸〗";//名字
$wpdz2[]=2;//物品分类
$wpdz3[]=577;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=30;//	多少爆率



$wpdz1[]="〖金宝箱〗";//名字
$wpdz2[]=8;//物品分类
$wpdz3[]=628;//物品id
$wpdz4[]=1;//	掉落的量
$wpdz5[]=1;//	重量
$wpdz6[]=100;//	爆率百分比
$wpdz7[]=80;//	多少爆率

} else{

$nccp=2;
echo "<font color=black>没有这个id编号".$npcc."请尝试联系gm解决此问题！！</font><br>";
}














?>



