<?php



$h= date('H')*1;
$i= date('i')*1;
$s= date('s')*1;



if ($h==11&&$i==55) {
//echo"<font color=red>[系统]小遗迹即将火热开启，请等级达到110级的玩家做好准备！！</font></a>"."<br>";
} elseif ($h==12&&$i==00) {
//echo"<font color=red>[系统]小遗迹已经火热开启，快去抢夺属于你的宝贝吧！！</font></a>"."<br>";
} elseif ($h==18&&$i==55) {
//echo"<font color=red>[系统]大遗迹即将火热开启，请等级达到165级的玩家做好准备！！</font></a>"."<br>";
} elseif ($h==19&&$i==00) {
//echo"<font color=red>[系统]大遗迹已经火热开启，快去抢夺属于你的宝贝吧！！</font></a>"."<br>";


  
  
  } elseif ($h==23&&$i==45) {
  
echo"<font color=red>[系统](づ￣3￣)づ╭❤～爱的玩家为了保证玩家的数据安全，服务器【五分钟】后即将进入玩家数据备份！！给您造成的不便请谅解~~</font></a>"."<br>";
  } elseif ($h==23&&$i==46) {
  
echo"<font color=red>[系统](づ￣3￣)づ╭❤～爱的玩家为了保证玩家的数据安全，服务器【四分钟】后即将进入玩家数据备份！！给您造成的不便请谅解~~</font></a>"."<br>";

    } elseif ($h==23&&$i==47) {
  
echo"<font color=red>[系统](づ￣3￣)づ╭❤～爱的玩家为了保证玩家的数据安全，服务器【三分钟】后即将进入玩家数据备份！！给您造成的不便请谅解~~</font></a>"."<br>";

    } elseif ($h==23&&$i==48) {
  
echo"<font color=red>[系统](づ￣3￣)づ╭❤～爱的玩家为了保证玩家的数据安全，服务器【两分钟】后即将进入玩家数据备份！！给您造成的不便请谅解~~</font></a>"."<br>";

    } elseif ($h==23&&$i==49) {
  
echo"<font color=red>[系统](づ￣3￣)づ╭❤～爱的玩家为了保证玩家的数据安全，服务器【一分钟】后即将进入玩家数据备份！！给您造成的不便请谅解~~</font></a>"."<br>";


} elseif ($h==21&&$i==0) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【半小时】后火热开启！！请做好准备哦~~</font></a>"."<br>";

} elseif ($h==21&&$i==10) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【20分钟】后火热开启！！请做好准备哦~~</font></a>"."<br>";
} elseif ($h==21&&$i==20) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【10分钟】后火热开启！！请做好准备哦~~</font></a>"."<br>";
} elseif ($h==21&&$i==25) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【5分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==21&&$i==26) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【4分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==21&&$i==27) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【3分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==21&&$i==28) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【2分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==21&&$i==29) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【1分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==21&&$i>=30&&$i<40) {
echo"<font color=red>[系统]【第一波天降秘宝】（持续10分钟）火热开启中！！请前往长安各个主街道寻找秘宝吧~~~</font></a>"."<br>";
} elseif ($h==21&&$i==40) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【10分钟】后火热开启！！请做好准备哦~~</font></a>"."<br>";
} elseif ($h==21&&$i==45) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【5分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==21&&$i==46) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【4分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==21&&$i==47) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【3分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==21&&$i==48) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【2分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==21&&$i==49) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【1分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==21&&$i>=50&&$i<59) {
echo"<font color=red>[系统]【第二波天降秘宝】（持续10分钟）火热开启中！！请前往长安各个主街道寻找秘宝吧~~~</font></a>"."<br>";
  
} elseif ($h==22&&$i==0) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【10分钟】后火热开启！！请做好准备哦~~</font></a>"."<br>";
} elseif ($h==22&&$i==5) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【5分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==22&&$i==6) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【4分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==22&&$i==7) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【3分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==22&&$i==8) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【2分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==22&&$i==9) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【1分钟】后火热开启！！秘宝将在长安主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==22&&$i>=10&&$i<20) {
echo"<font color=red>[系统]【第三波天降秘宝】（持续10分钟）火热开启中！！请前往长安各个主街道寻找秘宝吧~~~</font></a>"."<br>";
 } elseif ($h==22&&$i>=20&&$i<=25) {
echo"<font color=red>[系统]【天降秘宝】活动已结束！！请明天再来哦~~~~~~</font></a>"."<br>";

  
  } elseif ($h==11&&$i==30) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【半小时】后在天宫火热开启！！请做好准备哦~~</font></a>"."<br>";

} elseif ($h==11&&$i==40) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【20分钟】后火热开启！！请做好准备哦~~</font></a>"."<br>";
} elseif ($h==11&&$i==50) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【10分钟】后火热开启！！请做好准备哦~~</font></a>"."<br>";
} elseif ($h==11&&$i==55) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【5分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==11&&$i==56) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【4分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==11&&$i==57) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【3分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==11&&$i==58) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【2分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==11&&$i==59) {
echo"<font color=red>[系统]爱的玩家【第一波天降秘宝】将在【1分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==12&&$i>=0&&$i<10) {
echo"<font color=red>[系统]【第一波天降秘宝】（持续10分钟）火热开启中！！请前往天宫各个主街道寻找秘宝吧~~~</font></a>"."<br>";
} elseif ($h==12&&$i==10) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【10分钟】后火热开启！！请做好准备哦~~</font></a>"."<br>";
} elseif ($h==12&&$i==15) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【5分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==12&&$i==16) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【4分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==12&&$i==17) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【3分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==12&&$i==18) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【2分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==12&&$i==19) {
echo"<font color=red>[系统]爱的玩家【第二波天降秘宝】将在【1分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==12&&$i>=20&&$i<30) {
echo"<font color=red>[系统]【第二波天降秘宝】（持续10分钟）火热开启中！！请前往天宫主街道寻找秘宝吧~~~</font></a>"."<br>";
  
} elseif ($h==12&&$i==30) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【10分钟】后火热开启！！请做好准备哦~~</font></a>"."<br>";
} elseif ($h==12&&$i==35) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【5分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==12&&$i==36) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【4分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==12&&$i==37) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【3分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==12&&$i==38) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【2分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==12&&$i==39) {
echo"<font color=red>[系统]爱的玩家【第三波天降秘宝】将在【1分钟】后火热开启！！秘宝将在天宫主街道随机掉落有缘人皆可得之~~</font></a>"."<br>";
} elseif ($h==12&&$i>=40&&$i<50) {
echo"<font color=red>[系统]【第三波天降秘宝】（持续10分钟）火热开启中！！请前往天宫街道寻找秘宝吧~~~</font></a>"."<br>";
 } elseif ($h==13&&$i>=50&&$i<=55) {
echo"<font color=red>[系统]【天降秘宝】活动已结束！！请明天再来哦~~~~~~</font></a>"."<br>";

} elseif ($h==14&&$i==50) {
echo"<font color=red>[系统]爱的玩家【采花大盗】将在【10分钟】后火热开启！！请做好准备哦~~位置在玄武大街百花仙子处</font></a>"."<br>";
} elseif ($h==14&&$i==55) {
 echo"<font color=red>[系统]爱的玩家【采花大盗】将在【5分钟】后火热开启！！请做好准备哦~~位置在玄武大街百花仙子处</font></a>"."<br>";
  } elseif ($h==14&&$i==56) {
 echo"<font color=red>[系统]爱的玩家【采花大盗】将在【4分钟】后火热开启！！请做好准备哦~~位置在玄武大街百花仙子处</font></a>"."<br>";
  } elseif ($h==14&&$i==57) {
 echo"<font color=red>[系统]爱的玩家【采花大盗】将在【3分钟】后火热开启！！请做好准备哦~~位置在玄武大街百花仙子处</font></a>"."<br>";
  } elseif ($h==14&&$i==58) {
 echo"<font color=red>[系统]爱的玩家【采花大盗】将在【2分钟】后火热开启！！请做好准备哦~~位置在玄武大街百花仙子处</font></a>"."<br>";
  } elseif ($h==14&&$i==59) {
 echo"<font color=red>[系统]爱的玩家【采花大盗】将在【1分钟】后火热开启！！请做好准备哦~~位置在玄武大街百花仙子处</font></a>"."<br>";
  } elseif ($h==15&&$i>=0&&$i<30) {
echo"<font color=red>[系统]【采花大盗】活动正在火热进行中，谁会是今天的花花公子了？</font></a>"."<br>";
  } elseif ($h==15&&$i>=30&&$i<5) {
echo"<font color=red>[系统]【采花大盗】活动已结束，在排行榜的玩家不要忘了领取奖励哦~~~</font></a>"."<br>";

  

} elseif ($h==20&&$i==55) {

$weekarray=array("7","1","2","3","4","5","6");
$week=$weekarray[date("w")];

if($week ==1){
$zcwz="傲来国";
} elseif($week ==2){
$zcwz="宝象国";
} elseif($week ==3){
$zcwz="乌鸡国";
} elseif($week ==4){
$zcwz="女儿国";
} elseif($week ==5){
$zcwz="车迟国";
} elseif($week ==6){
$zcwz="无";
$kfsj="休整";
} elseif($week ==7){
$zcwz="祭赛国";
} else{
$zcwz="无";

}


if ($week ==1||$week ==2||$week ==3||$week ==4||$week ==5||$week ==7) {

//echo"<font color=red>[系统]【".$zcwz."】国战将于21:00开始,请还没报名的国家前往长安城-封榜堂,大宰相.房玄龄处进行报名</font></a>"."<br>";
} else{


}

} elseif ($h==21&&$i==0) {

$weekarray=array("7","1","2","3","4","5","6");
$week=$weekarray[date("w")];

if($week ==1){
$zcwz="傲来国";
} elseif($week ==2){
$zcwz="宝象国";
} elseif($week ==3){
$zcwz="乌鸡国";
} elseif($week ==4){
$zcwz="女儿国";
} elseif($week ==5){
$zcwz="车迟国";
} elseif($week ==6){
$zcwz="无";
$kfsj="休整";
} elseif($week ==7){
$zcwz="祭赛国";
} else{
$zcwz="无";

}


if ($week ==1||$week ==2||$week ==3||$week ==4||$week ==5||$week ==7) {

//echo"<font color=red>[系统]【".$zcwz."】国战已经火热开启了,请各位仙友前往战场争夺属于国家的荣誉吧！</font></a>"."<br>";
} else{


}




} elseif ($h==10&&$i>=50&&$i<=59) {
echo"<font color=red>[系统]幸运女神和财神爷将在11：00-11:10降临到金山当中，把握机会~~机不在失，失不再来哦~~</font></a>"."<br>";

} elseif ($h==11&&$i>=0&&$i<=10) {
echo"<font color=red>[系统]幸运女神和财神时间火热开启中11:11溜走哦（金山挖宝有几率触发幸运女神与财神奖励丰厚）</font></a>"."<br>";





} elseif ($h==16&&$i>=50&&$i<=59) {
echo"<font color=red>[系统]幸运女神和财神爷将在17：00-17:10降临到金山当中，把握机会~~机不在失，失不再来哦~~</font></a>"."<br>";

} elseif ($h==17&&$i>=0&&$i<=10) {
echo"<font color=red>[系统]幸运女神和财神时间火热开启中17:11溜走哦（金山挖宝有几率触发幸运女神与财神奖励丰厚）</font></a>"."<br>";







} elseif ($h==20&&$i>=50&&$i<=59) {
echo"<font color=red>[系统]幸运女神和财神爷将在21：00-21:10降临到金山当中，把握机会~~机不在失，失不再来哦~~</font></a>"."<br>";

} elseif ($h==21&&$i>=0&&$i<=10) {
echo"<font color=red>[系统]幸运女神和财神时间火热开启中21:11溜走哦（金山挖宝有几率触发幸运女神与财神奖励丰厚）</font></a>"."<br>";



} elseif ($h==0&&$i==35||$h==0&&$i==5||$h==1&&$i==35||$h==1&&$i==5||$h==2&&$i==35||$h==2&&$i==5||$h==3&&$i==35||$h==3&&$i==5||$h==4&&$i==35||$h==4&&$i==5||$h==5&&$i==35||$h==5&&$i==5||$h==6&&$i==35||$h==6&&$i==5||$h==7&&$i==35||$h==7&&$i==5||$h==8&&$i==35||$h==8&&$i==5||$h==9&&$i==35||$h==9&&$i==5||$h==10&&$i==35||$h==10&&$i==5||$h==11&&$i==35||$h==11&&$i==5||$h==12&&$i==35||$h==12&&$i==5||$h==13&&$i==35||$h==13&&$i==5||$h==14&&$i==35||$h==14&&$i==5||$h==15&&$i==35||$h==15&&$i==5||$h==16&&$i==35||$h==16&&$i==5||$h==17&&$i==35||$h==17&&$i==5||$h==18&&$i==35||$h==18&&$i==5||$h==19&&$i==35||$h==19&&$i==5||$h==20&&$i==35||$h==20&&$i==5||$h==21&&$i==35||$h==21&&$i==5||$h==22&&$i==35||$h==22&&$i==5||$h==23&&$i==35||$h==23&&$i==5) {
echo"<font color=red>[系统]小轩西游管理人员不会以任何形式向玩家索要账号密码，请注意自身保护，不要相将账号密码告诉他人以免上当受骗，祝小轩西游越来越好。官方qq群：54665469客服qq：137154720</font></a>"."<br>";


} elseif ($h==0&&$i==20||$h==0&&$i==40||$h==1&&$i==20||$h==1&&$i==40||$h==2&&$i==20||$h==2&&$i==40||$h==3&&$i==20||$h==3&&$i==40||$h==4&&$i==20||$h==4&&$i==40||$h==5&&$i==20||$h==5&&$i==40||$h==6&&$i==20||$h==6&&$i==40||$h==7&&$i==20||$h==7&&$i==40||$h==8&&$i==20||$h==8&&$i==40||$h==9&&$i==20||$h==9&&$i==40||$h==10&&$i==20||$h==10&&$i==40||$h==11&&$i==20||$h==11&&$i==40||$h==12&&$i==20||$h==12&&$i==40||$h==13&&$i==20||$h==13&&$i==40||$h==14&&$i==20||$h==14&&$i==40||$h==15&&$i==20||$h==15&&$i==40||$h==16&&$i==20||$h==16&&$i==40||$h==17&&$i==20||$h==17&&$i==40||$h==18&&$i==20||$h==18&&$i==40||$h==19&&$i==20||$h==19&&$i==40||$h==20&&$i==20||$h==20&&$i==40||$h==21&&$i==20||$h==21&&$i==40||$h==22&&$i==20||$h==22&&$i==40||$h==23&&$i==20||$h==23&&$i==40) {
//echo"<font color=red>[系统]小轩西游公测上线啦！在这里还是要衷心的感谢大家,相信游戏的明天会更加美好,如有bug请及时反馈,对于bug隐瞒不报恶意使用采取永久封号处理，祝君游戏愉快，如有任何疑问请咨询官方qq群：54665469客服qq：137154720</font></a>"."<br>";
echo"<font color=red>[系统]小轩西游充值榜与活动榜实时更新，充值更有如意BOSS召唤，惊喜不断（自助充值系统已经完善点击充值即可完成）</font></a>"."<br>";

//} elseif ($h==0&&$i==45||$h==0&&$i==0||$h==1&&$i==45||$h==1&&$i==0||$h==2&&$i==45||$h==2&&$i==0||$h==3&&$i==45||$h==3&&$i==0||$h==4&&$i==45||$h==4&&$i==0||$h==5&&$i==45||$h==5&&$i==0||$h==6&&$i==45||$h==6&&$i==0||$h==7&&$i==45||$h==7&&$i==0||$h==8&&$i==45||$h==8&&$i==0||$h==9&&$i==45||$h==9&&$i==0||$h==10&&$i==45||$h==10&&$i==0||$h==11&&$i==45||$h==11&&$i==0||$h==12&&$i==45||$h==12&&$i==0||$h==13&&$i==45||$h==13&&$i==0||$h==14&&$i==45||$h==14&&$i==0||$h==15&&$i==45||$h==15&&$i==0||$h==16&&$i==45||$h==16&&$i==0||$h==17&&$i==45||$h==17&&$i==0||$h==18&&$i==45||$h==18&&$i==0||$h==19&&$i==45||$h==19&&$i==0||$h==20&&$i==45||$h==20&&$i==0||$h==21&&$i==45||$h==21&&$i==0||$h==22&&$i==45||$h==22&&$i==0||$h==23&&$i==45||$h==23&&$i==0) {
//echo"<font color=red>[系统]七夕活动即将进入尾声目前七夕充值大回馈前三甲1.【小果】2.【玄】（乩）3.殇シ悔~~真是牛到没朋友啦~~结束后将获得大量豆子作为回馈~~小伙伴们抓紧哦~~禁止最后几分钟充值以免造成榜单不准确</font></a>"."<br>";

} elseif ($h==0&&$i==45||$h==0&&$i==0||$h==1&&$i==45||$h==1&&$i==0||$h==2&&$i==45||$h==2&&$i==0||$h==3&&$i==45||$h==3&&$i==0||$h==4&&$i==45||$h==4&&$i==0||$h==5&&$i==45||$h==5&&$i==0||$h==6&&$i==45||$h==6&&$i==0||$h==7&&$i==45||$h==7&&$i==0||$h==8&&$i==45||$h==8&&$i==0||$h==9&&$i==45||$h==9&&$i==0||$h==10&&$i==45||$h==10&&$i==0||$h==11&&$i==45||$h==11&&$i==0||$h==12&&$i==45||$h==12&&$i==0||$h==13&&$i==45||$h==13&&$i==0||$h==14&&$i==45||$h==14&&$i==0||$h==15&&$i==45||$h==15&&$i==0||$h==16&&$i==45||$h==16&&$i==0||$h==17&&$i==45||$h==17&&$i==0||$h==18&&$i==45||$h==18&&$i==0||$h==19&&$i==45||$h==19&&$i==0||$h==20&&$i==45||$h==20&&$i==0||$h==21&&$i==45||$h==21&&$i==0||$h==22&&$i==45||$h==22&&$i==0||$h==23&&$i==45||$h==23&&$i==0) {
echo"<font color=red>[系统]感恩节活动火热上线，为答谢广大西游爱好者，游戏疯狂赠送各种充值卡各种稀有物品绝对的超值超级奖励等你来拿！！！具体关注游戏首页</font></a>"."<br>";


} else {

}






?>




